{
  "url": "https://www.nasdaq.com/article/7-marijuana-stocks-with-critical-levels-to-watch-cm1207509",
  "title": "7 Marijuana Stocks With Critical Levels to Watch - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "[Editor's note: This story will be updated each week with new stocks and analysis. Please check back often for Mark's latest take on marijuana stocks.]",
    "It is easy to understand why technical analysis of marijuana stocks has such a dubious reputation. Most technical analysts mindlessly look at charts and try to identify patterns without actually understanding what they are supposed to mean.",
    "Even worse is the fact that some analysts actually believe that there is credibility in esoteric methods like Elliot Waves or Harmonic Charts. These techniques are like UFOs and Bigfoot. They are fun to talk about, but they are not real. Professional institutional traders do not use them and you shouldn't either.",
    "Technical analysis should be an illustration of supply and demand dynamics, at least when understood and used correctly.",
    "In financial markets, prices are always doing one of three things - going up, going down or staying the same. In addition, in markets there are certain levels that are more important than others with respect to the amount of supply and demand that exists at them. When applied correctly, technical analysis should help you identify these levels and trends.",
    "Understanding these dynamics will help you make money. For example, suppose you want to buy a stock when it drops to $20. Your plan may be ruined if you don't look at a chart. There may be significant support or demand for the stock at the $21 level. The stock may never get to $20. It may find a bottom around $21 and then rally. You lost out on a chance to make money for one dollar because you didn't know where the support was.",
    "Let's take a look at seven of the popular marijuana stocks. There is a lesson to be learned from each of them.",
    "Innovative Industrial Properties (NYSE: IIPR ) manages industrial properties and leases them to licensed medical marijuana growers.",
    "IIPR stock has found support around the $90 level. This is not surprising because the $90 level was resistance from May through June.",
    "Why does a former resistance level become a support level? Consider the following dynamics. The people who sold the stock at $90 were feeling pretty good when it sold off and went lower. The short-sellers are looking at a profit while those who sold it long are patting themselves on the back because they believe they made the correct decision when they decided to sell.",
    "Then in June, it rallied through the level and traded close to $140. Now the short-sellers are losing money. They tell themselves that if the stock comes back to $90, they will close out their positions to break even. Meanwhile, the long sellers believe that selling was the wrong decision, and they decide to buy it back if it drops back to the level. Those who bought it wish they bought more and tell themselves they will add to their positions at $90.",
    "Added to this are professional traders seeking to profit off of a well-defined level. That makes four different groups of investors who want to buy the stock at $90. This demand at the level is what creates support.",
    "Aurora Cannabis  (NYSE: ACB ) is a Canadian company that grows and sells medical marijuana, indoor cultivation systems, and hemp-related food products.",
    "ACB stock continues to trend lower after hitting resistance around the $7 level in early August. It was not surprising that there was resistance at the level, because it was a prior support level.",
    "Why do levels that were support become resistance? It is because those who bought it at the level are losing money after the level breaks and the stock trades lower. They tell themselves that if it rallies back to the level, they will sell it to get out at breakeven.",
    "Those who shorted it are looking at a profit when it goes lower and believe that they made the correct decision. They decide to add to their position if the stock rallies back to it. Added to this are the professional traders seeking to profit off of a clear level, and you can understand how there are three groups of investors who want to sell it. This supply of stock is what creates the resistance.",
    "If ACB continues to trend lower, there may be support around the $5 level. These levels were support in December and January.",
    "Hexo (NYSE: HEXO ) grows and sells medical marijuana.",
    "HEXO stock is testing the $4 level. You do not need to be a Market Guru or Master Trader to see how important $4 is to Hexo stock. This is a great illustration of how specific levels can be important for a long period of time.",
    "The $4 level was resistance in January of 2018. Then it was resistance again from May through August of 2018. After breaking it to the upside, $4 became support in October of 2018. It was also support again in July.",
    "HEXO will probably not trade or consolidate around the $4 level for too long. It will most likely either see a meaningful rally or a meaningful sell-off.",
    "If you trade options, this may be a good time to consider a straddle or other strategy to be long volatility of the stock.",
    "Cronos Group (NASDAQ: CRON ) grows and sells marijuana.",
    "CRON stock continues to trend lower since failing at resistance around $14 in early August. This is another situation where you don't need to be a market expert to identify an important level.",
    "$14 was support this summer, because last fall it was a resistance level. If the stock rallies, I would expect it to run into resistance there again.",
    "If the stock continues to trend lower, there is a good chance that it will find support around the $10 level. This is because it was support in December.",
    "Why does a former support level become a support level again, almost one year later? As described above, those who bought it at $10 wish they bought more after it went higher and add to their positions if the stock drops back there. Also, $10 is an important level from a psychological perspective. This demand for the stock at the level is what creates support.",
    "Canopy Growth (NYSE: CGC ) grows and sells marijuana.",
    "This company is a complete disaster. It lost over $600 million CAD last year, and most analysts believe that it will continue to lose money. In my opinion, this company will not survive and it will eventually be taken over or bought out.",
    "In the meantime, CGC stock continues to trend lower.",
    "One thing that veteran traders look at is something that they refer to as the action of the stock. Canopy is not acting well. Consider that Seaport Global raised its rating from hold to buy. They also put a $31 price target on it. But despite this seemingly positive news, the stock didn't seem to care. The forces of supply continue to control the market, and they are driving the stock lower.",
    "Tilray  (NASDAQ: TLRY ) researches, grows and sells medical cannabis and cannabinoids.",
    "TLRY stock had a decent move upwards yesterday due to the comments of Vivien Azer, an analyst at Cowen, though those gains are already flattening out.",
    "This stock illustrates the absurdity of some Wall Street research. Despite positive comments on the stock from a highly paid Wall Street analyst that has been wrong about TLRY since day one and just reduced the target price from $150 to $60, the stock had a proverbial dead-cat bounce.",
    "It looks to me like Tilray will resume its downtrend. There is a huge amount of stock that is presumably for sale, and this will keep pressure on the TLRY stock price. If it does continue to trend lower, there will probably be some support around the $22 level. This is where the stock hit the market when it became public last July.",
    "Scotts Miracle-Gro (NYSE: SMG ) manufactures and sells systems and accessories for hydroponic growing. Lately, SMG stock has run into resistance and has broken its recent uptrend.",
    "As expected, there was resistance around the $110 level. There was resistance at this level because in early 2018, the stock made a top there before having a significant selloff. By the end of the year, it had lost almost 50% of its value.",
    "Like most things in technical analysis, the concept of a trendline is largely misunderstood. Even some well-known technical analysts don't seem to comprehend the concept of a trendline.",
    "In financial markets prices are always doing one of three things. They are either going up, down, or staying the same. The break of a correctly drawn trendline showing that movement could give an early indication that this control of the markets is about to change.",
    "Of course, drawing trendlines is an art and not a science, but with a little practice and experience, they can help you make money.",
    "As of this writing, Mark Putrino did not hold a position in any of the aforementioned securities.",
    "The post 7 Marijuana Stocks With Critical Levels to Watch appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 12:00:45"
}