{
  "url": "https://www.nasdaq.com/article/why-valero-energy-stock-slumped-nearly-12-in-august-cm1207453",
  "title": "Why Valero Energy Stock Slumped Nearly 12% in August - Nasdaq.com",
  "text": [
    "  What happened  Shares of   Valero Energy    (NYSE: VLO) declined 11.7% in August, according to data provided   by      S&P Global Market Intelligence    . Weighing on the   refining stock    was its   second-quarter results    and the impact that the U.S.-China trade war could have on its   business.  So what  Valero earned $612 million, or $1.47 per share, during the   second quarter. While that matched analysts' expectations, it was   about 23% below the year-ago period. The company experienced   weakness in both its refining and ethanol segments. Refining   earnings tumbled 29% due to weaker margins, while profitability   in its ethanol segment plunged 84% due to higher    corn   prices    . Those weak spots offset a more than 150% surge in   renewable-diesel earnings.   Image source: Getty Images.makeArticleAd();  Another issue last month was the growing trade dispute between   the U.S. and China, which will likely put more pressure on   earnings in the coming quarters. Uncertainty stemming from the   conflict is already weighing on demand for commodities, which are   piling up in storage and pushing down prices. Ethanol storage   levels, for example, are up 4% this year and 16% from 2016, which   has caused the price of the corn-based fuel to tumble more than   25% since June. That will keep the pressure on Valero's ethanol   business. Adding to the issues in the ethanol market is the Trump   Administration's biofuel policy. The administration granted   waivers exempting several refineries from requirements to blend   ethanol into the country's fuel supply, which has angered the   corn industry. This tug of war between refiners and farmers is   adding more volatility to the refining market.  Now what  Valero's margins were pressured in the second quarter by the   trade war's impact on the company's refining and ethanol   businesses. Its struggles will likely continue in the near term   since the issues plaguing the industry don't appear as if they'll   go away anytime soon. But the refining sector could get a boost next year, when a   new global fuel standard goes into effect, which should drive   demand for low-sulfur fuel     from the   shipping industry    . Increased demand for that higher-valued product could boost the   margins of refiners like Valero, which could help lift its stock   price in the next year.   10 stocks we like better than Valero Energy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Valero Energy wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Matthew DiLallo      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   Valero Energy    (NYSE: VLO) declined 11.7% in August, according to data provided   by      S&P Global Market Intelligence    . Weighing on the   refining stock    was its   second-quarter results    and the impact that the U.S.-China trade war could have on its   business.",
    "Valero earned $612 million, or $1.47 per share, during the   second quarter. While that matched analysts' expectations, it was   about 23% below the year-ago period. The company experienced   weakness in both its refining and ethanol segments. Refining   earnings tumbled 29% due to weaker margins, while profitability   in its ethanol segment plunged 84% due to higher    corn   prices    . Those weak spots offset a more than 150% surge in   renewable-diesel earnings.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Another issue last month was the growing trade dispute between   the U.S. and China, which will likely put more pressure on   earnings in the coming quarters. Uncertainty stemming from the   conflict is already weighing on demand for commodities, which are   piling up in storage and pushing down prices. Ethanol storage   levels, for example, are up 4% this year and 16% from 2016, which   has caused the price of the corn-based fuel to tumble more than   25% since June. That will keep the pressure on Valero's ethanol   business.",
    "Adding to the issues in the ethanol market is the Trump   Administration's biofuel policy. The administration granted   waivers exempting several refineries from requirements to blend   ethanol into the country's fuel supply, which has angered the   corn industry. This tug of war between refiners and farmers is   adding more volatility to the refining market.",
    "Valero's margins were pressured in the second quarter by the   trade war's impact on the company's refining and ethanol   businesses. Its struggles will likely continue in the near term   since the issues plaguing the industry don't appear as if they'll   go away anytime soon.",
    "But the refining sector could get a boost next year, when a   new global fuel standard goes into effect, which should drive   demand for low-sulfur fuel     from the   shipping industry    . Increased demand for that higher-valued product could boost the   margins of refiners like Valero, which could help lift its stock   price in the next year.",
    "  10 stocks we like better than Valero Energy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Valero Energy wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Valero Energy       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Valero Energy wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Matthew DiLallo      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 01:30:00"
}