{
  "url": "https://www.nasdaq.com/article/ulta-stock-is-beginning-to-look-pretty-again-cm1210672",
  "title": "Ulta Stock Is Beginning to Look Pretty Again - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Shares of Ulta Beauty (NASDAQ: ULTA ) have certainly had a rough time of it over the past few weeks, dropping over 100 points. ULTA stock has fallen over 30% since reporting a major earnings disappointment on Aug. 29. While both the earnings and guidance were undoubtedly a downer, the negative reaction in the ULTA stock price is now overdone. Look for it to rebound over the coming months.",
    "The earnings report was the impetus behind the recent bloodbath in ULTA stock. The company missed on both the top and bottom line. Earnings per share were $2.76, somewhat shy of analyst expectations of $2.80. Revenues were also a tad light, checking in at $1.67 billion versus consensus of $1.68 billion. Same store sales grew only 6.2% compared to the 6.6% forecast. The company also lowered guidance from $12.93 to $11.96. No doubt bad, but not 100-point drop bad.",
    "InvestorPlace contributor Luke Lango did a superb job of drilling down into the fundamentals for Ulta in his well-researched article. He notes two reasons to buy the dip - namely that the short-term headwinds will pass and that ULTA stock is now attractively valued. I agree wholeheartedly on both his points and expect ULTA to find its footing soon.",
    "ULTA stock is definitely getting attractive on a fundamental basis. Shares are now trading at the by far the cheapest price-to-earnings ratio over the past 10 years with a current multiple under 20. Other traditional valuation metrics, such as Price/Sales, Price/Book and Price/Cash Flow are also at extreme discounts to the five-year average. It is important to remember that although growth is slowing, ULTA still expects to grow at 10% pace.",
    "ULTA is getting extremely oversold from a technical perspective. The five-day relative strength index reached readings well below 20 before finally turning higher. The last time this metric was so pessimistic marked a significant low last December. Moving average convergence/divergence also reached an extreme, printing near -10 which marked a new recent low. Bollinger Percent B got to extremes rarely seen with a reading of -50 before finally breaking back into positive territory. ULTA stock is trading at a massive discount to the 20-day moving average, another sign the carnage may be getting overdone.",
    "More importantly, Ulta stock bounced sharply off major support at $225 yesterday. ULTA opened lower on the day and at new recent lows, only to immediately change course and close sharply higher on the day. This type of reversal pattern is many times emblematic of a significant low in the stock. The selling finally looks exhausted and the buyers are now in charge. It is even more powerful near major support following such a brutal drop in Ulta stock.",
    "Long-term investors should look to add ULTA stock to their portfolios on any meaningful weakness. Implied volatility is still relatively high owing to the massive drop, so selling a covered call against the stock makes sense. The Jan $270 call fetches $7.00 and provides a 3% downside buffer while still allowing for over 13% upside appreciation.",
    "Option players may want to take advantage of the rich option premiums and sell an out of the money bull put spread. Selling the Jan $190/$185 put spread should bring in $1.00 while risking $4.00. Return on risk equates to 25%. The short $190 strike price provides a 15% downside cushion to the $231.42 closing price of ULTA stock.",
    "Tim may hold some of the aforementioned securities in one or more of his newsletters. Anyone interested in finding out more about Tim and his option-based strategies can go to  https://marketfy.com/item/options-and-volatility .",
    "The post Ulta Stock Is Beginning to Look Pretty Again appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:50:27"
}