{
  "url": "https://www.nasdaq.com/article/new-strong-sell-stocks-for-september-4th-cm1207288",
  "title": "New Strong Sell Stocks for September 4th - Nasdaq.com",
  "text": [
    " Here are 5 stocks added to the Zacks Rank #5 (Strong Sell) List today:  Suzuki Motor Corporation  SZKMY   is an automobile company. The Zacks Consensus Estimate for its current year earnings has been revised 4.5% downward over the last 30 days.  Continental Resources, Inc.  CLR   is a petroleum and natural gas exploration and production company. The Zacks Consensus Estimate for its current year earnings has been revised 5.9% downward over the last 30 days.  Limoneira Company  LMNR   is a real estate development company. The Zacks Consensus Estimate for its current year earnings has been revised 53.6% downward over the last 30 days.  Actuant Corporation  ATU   is a manufacturer of industrial products and systems. The Zacks Consensus Estimate for its current year earnings has been revised 41.2% downward over the last 60 days.  Mitie Group plc  MITFY   is a facility management company. The Zacks Consensus Estimate for its current year earnings has been revised 14.3% downward over the last 60 days. View the entire  Zacks Rank #5 List.    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Mitie Group PLC. (MITFY): Free Stock Analysis Report   Actuant Corporation (ATU): Free Stock Analysis Report   Continental Resources, Inc. (CLR): Free Stock Analysis Report   Limoneira Co (LMNR): Free Stock Analysis Report   SUZUKI MOTOR CP (SZKMY): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Here are 5 stocks added to the Zacks Rank #5 (Strong Sell) List today:",
    " Suzuki Motor Corporation  SZKMY   is an automobile company. The Zacks Consensus Estimate for its current year earnings has been revised 4.5% downward over the last 30 days.",
    " Continental Resources, Inc.  CLR   is a petroleum and natural gas exploration and production company. The Zacks Consensus Estimate for its current year earnings has been revised 5.9% downward over the last 30 days.",
    " Limoneira Company  LMNR   is a real estate development company. The Zacks Consensus Estimate for its current year earnings has been revised 53.6% downward over the last 30 days.",
    " Actuant Corporation  ATU   is a manufacturer of industrial products and systems. The Zacks Consensus Estimate for its current year earnings has been revised 41.2% downward over the last 60 days.",
    " Mitie Group plc  MITFY   is a facility management company. The Zacks Consensus Estimate for its current year earnings has been revised 14.3% downward over the last 60 days.",
    "View the entire  Zacks Rank #5 List. ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:19:00"
}