{
  "url": "https://www.nasdaq.com/article/exxon-shell-cannot-revive-18-bln-nigerian-arbitration-award-20190904-01081",
  "title": "Exxon, Shell cannot revive $1.8 bln Nigerian arbitration award - Nasdaq.com",
  "text": [
    "By Jonathan Stempel",
    "NEW YORK, Sept 4 (Reuters) - A U.S. judge on Wednesday rejected Exxon Mobil Corp's  and Royal Dutch Shell Plc's  effort to revive a $1.8 billion arbitration award against Nigeria's state-run oil company, which stemmed from a dispute over a 1993 contract to extract oil near the African country's coastline.",
    "U.S. District Judge William Pauley in Manhattan cited public policy and due process considerations in deciding not to enforce the October 2011 award against Nigerian National Petroleum Corp (NNPC), which was subsequently set aside by courts in Nigeria.",
    "The companies said last November that the award had grown to $2.67 billion, including interest.",
    "Exxon, Shell and their respective lawyers did not immediately respond to requests for comment.",
    "\"NNPC is very pleased with the decision, and was always confident that there was no basis for a U.S. court to confirm the award,\" its lawyer Cecilia Moss said in an interview.",
    "According to court papers, the 1993 contract anticipated that Exxon and Shell affiliates would invest billions of dollars to extract oil from the Erha field, about 60 miles (97 km) off Nigeria's coast, and share profits with NNPC.",
    "But the affiliates, Esso Exploration and Production Nigeria Ltd and Shell Nigeria Exploration and Production Co Ltd, accused NNPC of unilaterally \"lifting\" more oil than was contractually allowed, at the behest of Nigeria's government, depriving them of billions of dollars of oil.",
    "Pauley said Exxon and Shell still have \"multiple appeals pending\" in Nigeria, and rejected their argument that it might be difficult to collect there.",
    "Exxon and Shell \"executed a contract in Nigeria with another Nigerian corporation containing an arbitration clause requiring any arbitration to be held in Nigeria under Nigerian law, and it then sought to confirm the award in Nigeria,\" Pauley wrote. \"[They] cannot now reasonably complain that [their] efforts to collect will be frustrated in Nigeria.\"",
    "In an Aug. 7 regulatory filing, Exxon said it did not expect the case to materially affect its operations or financial condition.",
    "The case is Esso Exploration and Production Nigeria Ltd et al v Nigerian National Petroleum Corp, U.S. District Court, Southern District of New York, No. 14-08445."
  ],
  "published_datetime": "2019-09-04 04:39:00"
}