{
  "url": "https://www.nasdaq.com/article/hedge-funds-cautious-on-oil-wait-for-economy-20190903-00544",
  "title": "Hedge funds cautious on oil, wait for economy - Nasdaq.com",
  "text": [
    "By John Kemp",
    "(John Kemp is a Reuters market analyst.)",
    "LONDON, Sept 3 (Reuters) - Hedge funds are becoming slightly more pessimistic about the outlook for oil and the economy, though position changes remain small owing to the holiday season in North America and Europe.",
    "Fund managers sold a total of 26 million barrels in the six most important futures and options contracts, reducing their net long position to 525 million barrels in the week to Aug. 27.",
    "Funds sold NYMEX and ICE WTI (-20 million barrels), U.S. diesel (-4 million) and European gasoil (-5 million) though they were smaller buyers of Brent (+4 million) and left U.S. gasoline positions basically unchanged.",
    "Since 2013, when the time series starts for all six major contracts, the hedge fund community has always run a \"structural\" net long position in petroleum, concentrated in Brent and WTI.",
    "In this period, fund managers have NEVER been net short of either crude contract in the last six years, even when prices were plunging in 2014/15 (graphic).",
    "Much of this structural net long position represents passive index-tracking positions as well as the predisposition of fund managers to be bullish towards their own asset class.",
    "Across all six petroleum contracts, the structural net long has been equivalent to around 491 million barrels (consisting of 587 million barrels of structural long positions minus 96 million barrels of structural shorts).",
    "Since structural positions do not change, in aggregate, it is more useful to focus on the remaining \"dynamic\" positions, which have a closer relationship with short-term price changes.",
    "Hedge fund managers are currently running a dynamic net long position of just 35 million barrels, down from a recent peak of 420 million in April.",
    "In effect, fund managers are neutral on the outlook for prices, with concern about the economy and oil consumption offsetting production restraint by Saudi Arabia and U.S. sanctions on Iran and Venezuela.",
    "Until economic uncertainty is resolved, either with clearer signs of recession or indications of renewed growth, portfolio managers are likely to remain on the sidelines."
  ],
  "published_datetime": "2019-09-03 08:12:00"
}