{
  "url": "https://www.nasdaq.com/article/noteworthy-wednesday-option-activity-cacc-dpz-immr-cm1207512",
  "title": "Noteworthy Wednesday Option Activity: CACC, DPZ, IMMR - Nasdaq.com",
  "text": [
    "Among the underlying components of the Russell 3000 index, we saw noteworthy  options trading  volume today in Credit Acceptance Corp (Symbol: CACC), where a total of 677 contracts have traded so far, representing approximately 67,700 underlying shares. That amounts to about 86% of CACC's average daily trading volume over the past month of 78,680 shares. Particularly high volume was seen for the $380 strike put option expiring January 17, 2020  , with 120 contracts trading so far today, representing approximately 12,000 underlying shares of CACC. Below is a chart showing CACC's trailing twelve month trading history, with the $380 strike highlighted in orange:       makeArticleAd();    Dominos Pizza Inc. (Symbol: DPZ) options are showing a volume of 6,266 contracts thus far today. That number of contracts represents approximately 626,600 underlying shares, working out to a sizeable 84.4% of DPZ's average daily trading volume over the past month, of 742,615 shares. Especially high volume was seen for the $220 strike put option expiring September 06, 2019  , with 944 contracts trading so far today, representing approximately 94,400 underlying shares of DPZ. Below is a chart showing DPZ's trailing twelve month trading history, with the $220 strike highlighted in orange:       And Immersion Corp (Symbol: IMMR) saw options trading volume of 2,474 contracts, representing approximately 247,400 underlying shares or approximately 83.7% of IMMR's average daily trading volume over the past month, of 295,625 shares. Particularly high volume was seen for the $2.50 strike put option expiring February 21, 2020  , with 1,680 contracts trading so far today, representing approximately 168,000 underlying shares of IMMR. Below is a chart showing IMMR's trailing twelve month trading history, with the $2.50 strike highlighted in orange:         For the various different available expirations for CACC options  , DPZ options  , or IMMR options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 03:25:20"
}