{
  "url": "https://www.nasdaq.com/article/cummins-cmi-hydrogenics-buyout-to-boost-fuel-cell-strength-cm1210395",
  "title": "Cummins' (CMI) Hydrogenics Buyout to Boost Fuel-Cell Strength - Nasdaq.com",
  "text": [
    "  Cummins Inc. CMI  recently closed the acquisition of Hydrogenics Corporation, a Canadian fuel cell and hydrogen production technology provider. Notably, Hydrogenics' expertise and innovative approach will help strengthen Cummins' fuel-cell capabilities. On Jun 28, the company entered into an agreement to acquire the outstanding shares of Hydrogenics for $15 per share in cash. The enterprise value of the deal totaled $290 million. Cummins owns 81% stake in Hydrogenics, while Air Liquide will keep 19%.  makeArticleAd();  Cummins started developing fuel-cell capabilities more than two decades ago. Further, the acquisition of Hydrogenics, with Air Liquide's support, will boost its ability to further innovate hydrogen fuel-cell technologies across commercial markets. Moreover, the latest acquisition is in line with Cummins' strategy to invest in a broader range of clean, fuel-efficient and high-performing products and technologies.    In fact, the company will be able to offer a full, differentiated hydrogen solution to customers by retaining fuel cell and hydrogen generation from electrolysis capabilities.    Hydrogenics will now report under Cummins' Electrified Power Business Segment, which designs and manufactures full electric and hybrid powertrain systems, innovative components and subsystems for commercial markets.    Cummins is focused on enhancing shareholder value through aggressive share repurchases and increasing its dividend payouts. For 2019, the company has set a target to return 75% of full-year operating cash flow to shareholders in forms o f dividends  and share repurchases.    Cummins focuses on introducing innovative products and strategies, such as partnerships in order to deliver higher returns. Besides widening its product portfolio, the company signed separate partnership deals with Hyundai Construction and Isuzu Motors last October. It will jointly develop an electric-powered mini excavator with Hyundai. The Cummins-Isuzu Motors team will discover opportunities in the powertrain area. Further, it has joined forces with Russia's KAMAZ to supply electrified power solutions for KAMAZ's latest line of battery-powered vehicles.  Cummins Inc. Price and Consensus         Cummins Inc. price-consensus-chart    |   Cummins Inc. Quote    Zacks Rank & Key Picks    Cummins currently carries a Zacks Rank #3 (Hold).    Some better-ranked stocks in the Auto-Tires-Trucks  sector are Lithia Motors, Inc. LAD  , General Motors Company GM  , and SPX Corporation SPXC  . While Lithia Motors sports a Zacks Rank #1 (Strong Buy), General Motors and SPX carries a Zacks Rank of 2 (Buy), at present. You can see  the complete list of today's Zacks #1 Rank stocks   here.     Lithia Motors has an expected earnings growth rate of 12.8% for 2019. The company's shares have surged 61.7% over the past year.    General Motors has a projected earnings growth rate of 3.06% for the current year. The company's shares have rallied 19.3% in a year's time.    SPX has an estimated earnings growth rate of 14.5% for the ongoing year. Its shares have moved up 19.1% over the past year.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Lithia Motors, Inc. (LAD): Free Stock Analysis Report   General Motors Company (GM): Free Stock Analysis Report   SPX Corporation (SPXC): Free Stock Analysis Report   Cummins Inc. (CMI): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " Cummins Inc. CMI  recently closed the acquisition of Hydrogenics Corporation, a Canadian fuel cell and hydrogen production technology provider. Notably, Hydrogenics' expertise and innovative approach will help strengthen Cummins' fuel-cell capabilities.",
    "On Jun 28, the company entered into an agreement to acquire the outstanding shares of Hydrogenics for $15 per share in cash. The enterprise value of the deal totaled $290 million. Cummins owns 81% stake in Hydrogenics, while Air Liquide will keep 19%.  makeArticleAd();  Cummins started developing fuel-cell capabilities more than two decades ago. Further, the acquisition of Hydrogenics, with Air Liquide's support, will boost its ability to further innovate hydrogen fuel-cell technologies across commercial markets. Moreover, the latest acquisition is in line with Cummins' strategy to invest in a broader range of clean, fuel-efficient and high-performing products and technologies.    In fact, the company will be able to offer a full, differentiated hydrogen solution to customers by retaining fuel cell and hydrogen generation from electrolysis capabilities.    Hydrogenics will now report under Cummins' Electrified Power Business Segment, which designs and manufactures full electric and hybrid powertrain systems, innovative components and subsystems for commercial markets.    Cummins is focused on enhancing shareholder value through aggressive share repurchases and increasing its dividend payouts. For 2019, the company has set a target to return 75% of full-year operating cash flow to shareholders in forms o f dividends  and share repurchases.    Cummins focuses on introducing innovative products and strategies, such as partnerships in order to deliver higher returns. Besides widening its product portfolio, the company signed separate partnership deals with Hyundai Construction and Isuzu Motors last October. It will jointly develop an electric-powered mini excavator with Hyundai. The Cummins-Isuzu Motors team will discover opportunities in the powertrain area. Further, it has joined forces with Russia's KAMAZ to supply electrified power solutions for KAMAZ's latest line of battery-powered vehicles.",
    " Cummins Inc. Price and Consensus ",
    "       Cummins Inc. price-consensus-chart    |   Cummins Inc. Quote  ",
    " Cummins Inc. price-consensus-chart    |   Cummins Inc. Quote ",
    " Zacks Rank & Key Picks    Cummins currently carries a Zacks Rank #3 (Hold).    Some better-ranked stocks in the Auto-Tires-Trucks  sector are Lithia Motors, Inc. LAD  , General Motors Company GM  , and SPX Corporation SPXC  . While Lithia Motors sports a Zacks Rank #1 (Strong Buy), General Motors and SPX carries a Zacks Rank of 2 (Buy), at present. You can see  the complete list of today's Zacks #1 Rank stocks   here.     Lithia Motors has an expected earnings growth rate of 12.8% for 2019. The company's shares have surged 61.7% over the past year.    General Motors has a projected earnings growth rate of 3.06% for the current year. The company's shares have rallied 19.3% in a year's time.    SPX has an estimated earnings growth rate of 14.5% for the ongoing year. Its shares have moved up 19.1% over the past year.   Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:05:00"
}