{
  "url": "https://www.nasdaq.com/article/zillow-group-prices-senior-notes-aids-financial-flexibility-cm1207334",
  "title": "Zillow Group Prices Senior Notes, Aids Financial Flexibility - Nasdaq.com",
  "text": [
    "  Zillow Group  ZG  recently announced plans to price two principle convertible unsecured senior notes worth $500 million, each, to enhance liquidity. The notes are slated to mature in 2024 and 2026, respectively. The notes will be privately offered to institutional buyers qualifying under Rule 144A of the Securities Act of 1933, as amended. The company will also provide a 30-day option to underwriters of \"2024 Notes\"and \"2026 Notes\" to purchase up to an additional $75 million of common stock, each, respectively. These notes, once placed, will be an unsecured senior liability of Zillow Group. The company will disclose interest rate, conversion rate and other terms after determining the pricing of the offering. However, it has stated that the interest payment will be semi-annual. The offering is subject to customary closing conditions. Zillow Group intends to utilize the net proceeds from the aforementioned offerings to pay the cost of the capped call transactions. It also intends to utilize the remaining of the net proceeds for general corporate purposes, strategic acquisitions and working capital.  Stock Performance  Shares of Zillow Group have gained 4.7% on a year to-date basis, substantially outperforming the industry  's rally of 1.5%.     Cash Position  We believe that the company has a strong balance sheet, which will help it in capitalizing on investment opportunities and pursuing strategic acquisitions, improving prospects. Moreover, the senior notes offering will lower Zillow Group's cost of capital, consequently strengthening balance sheet and supporting growth. The company exhibited an impressive cash position in recently reported second-quarter of fiscal 2019. As of Jun 30, 2019, cash & cash equivalents and short-term investments were more than $1.4 billion compared with over $1.5 billion reported in the previous quarter.  Bottom Line  Zillow Group is working toward growth of emerging marketplaces. The company's focus on robust initiatives including partnerships and product roll outs, which are aimed at making home shopping convenient is a key catalyst. The company regularly adds new features to bolster experience for property managers and consumers. With the combination of machine learning and personalization, the company anticipates to align consumer interest with the listed properties. The company's application that enables agents to create 3D home tours is quintessential in this regard. This enables buyers to narrow down their searches before a personal visit. Moreover, strength in offerings that include Rental Inforum and 'My Agent' bode well. These initiatives are aimed at property managers to make them better understand the preferences of consumers. Zillow Group's growth can be attributed to its Premier Agent Business, new construction marketplaces, and increasing traffic at its mobile apps and websites. However, intense competition from similar online real estate platforms, increasing mortgage interest rates and higher advertising spend remain headwinds. Moreover, spending in product enhancements is likely to hinder margin growth at least in the near term.  Zacks Rank and Key Picks  Zillow Group carries a Zacks Rank #3 (Hold). Some better-ranked stocks in the broader technology sector are Alibaba Group Holding Limited BABA  , Keysight Technologies Inc. KEYS  and Anixter International AXE  . Both the stocks flaunt a Zacks Rank #1 (Strong Buy). You can see   the complete list of today's Zacks #1 Rank stocks   here   . Long-term earnings growth rate for Alibaba, Keysight and Anixter is currently pegged at 28%, 10% and 8%, respectively.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Alibaba Group Holding Limited (BABA): Free Stock Analysis Report   Zillow Group, Inc. (ZG): Free Stock Analysis Report   Keysight Technologies Inc. (KEYS): Free Stock Analysis Report   Anixter International Inc. (AXE): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " Zillow Group  ZG  recently announced plans to price two principle convertible unsecured senior notes worth $500 million, each, to enhance liquidity. The notes are slated to mature in 2024 and 2026, respectively. The notes will be privately offered to institutional buyers qualifying under Rule 144A of the Securities Act of 1933, as amended.",
    "The company will also provide a 30-day option to underwriters of \"2024 Notes\"and \"2026 Notes\" to purchase up to an additional $75 million of common stock, each, respectively. These notes, once placed, will be an unsecured senior liability of Zillow Group.",
    "The company will disclose interest rate, conversion rate and other terms after determining the pricing of the offering. However, it has stated that the interest payment will be semi-annual. The offering is subject to customary closing conditions.",
    "Zillow Group intends to utilize the net proceeds from the aforementioned offerings to pay the cost of the capped call transactions. It also intends to utilize the remaining of the net proceeds for general corporate purposes, strategic acquisitions and working capital.",
    " Stock Performance ",
    "Shares of Zillow Group have gained 4.7% on a year to-date basis, substantially outperforming the industry  's rally of 1.5%.",
    " Cash Position ",
    "We believe that the company has a strong balance sheet, which will help it in capitalizing on investment opportunities and pursuing strategic acquisitions, improving prospects. Moreover, the senior notes offering will lower Zillow Group's cost of capital, consequently strengthening balance sheet and supporting growth.",
    "The company exhibited an impressive cash position in recently reported second-quarter of fiscal 2019. As of Jun 30, 2019, cash & cash equivalents and short-term investments were more than $1.4 billion compared with over $1.5 billion reported in the previous quarter.",
    " Bottom Line ",
    "Zillow Group is working toward growth of emerging marketplaces. The company's focus on robust initiatives including partnerships and product roll outs, which are aimed at making home shopping convenient is a key catalyst.",
    "The company regularly adds new features to bolster experience for property managers and consumers. With the combination of machine learning and personalization, the company anticipates to align consumer interest with the listed properties.",
    "The company's application that enables agents to create 3D home tours is quintessential in this regard. This enables buyers to narrow down their searches before a personal visit.",
    "Moreover, strength in offerings that include Rental Inforum and 'My Agent' bode well. These initiatives are aimed at property managers to make them better understand the preferences of consumers.",
    "Zillow Group's growth can be attributed to its Premier Agent Business, new construction marketplaces, and increasing traffic at its mobile apps and websites.",
    "However, intense competition from similar online real estate platforms, increasing mortgage interest rates and higher advertising spend remain headwinds. Moreover, spending in product enhancements is likely to hinder margin growth at least in the near term.",
    " Zacks Rank and Key Picks ",
    "Zillow Group carries a Zacks Rank #3 (Hold).",
    "Some better-ranked stocks in the broader technology sector are Alibaba Group Holding Limited BABA  , Keysight Technologies Inc. KEYS  and Anixter International AXE  . Both the stocks flaunt a Zacks Rank #1 (Strong Buy). You can see   the complete list of today's Zacks #1 Rank stocks   here   .",
    "Long-term earnings growth rate for Alibaba, Keysight and Anixter is currently pegged at 28%, 10% and 8%, respectively.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:35:00"
}