{
  "url": "https://www.nasdaq.com/article/why-diabetes-stock-insulet-soared-25-in-august-cm1207062",
  "title": "Why Diabetes Stock Insulet Soared 25% in August - Nasdaq.com",
  "text": [
    " What happened Shares of   Insulet    (NASDAQ: PODD)  rocketed 25.4% higher in August, according   to data from      S&P Global Market Intelligence    . The stock has pumped out a gain of 108% in 2019 through Sept.   3, making it one of the year's best-performing medical device   stocks within the broader   healthcare arena    . The Boston-area company is the leader in tubeless insulin pump   technology with its Omnipod pump. Insulet stock's August performance is even more impressive   when you consider that the market had a down month. The   S&P 500,    including dividends, fell 1.6% last month, and has returned 17.5%   so far this year.makeArticleAd();   Image source: Getty Images.  So what We can attribute Insulet stock's strong performance last month   to the company's Aug. 5 release of its   second-quarter results    , which were better than Wall Street and many investors were   expecting, and to management once again increasing full-year 2019   revenue guidance. Shares surged 21.4% on the day following the   release and continued to move somewhat higher throughout the   remainder of the month. In Q2, Insulet's revenue soared 43% year over year to $177.1   million, easily beating the $164 million Wall Street was looking   for. Earnings per share came in at $0.02 -- versus a loss of   $0.03 per share in the year-ago period -- hitting the consensus   estimate on the bull's-eye. Now what For the third quarter, Insulet guided for revenue growth of   about 15% to 20% year over year. And for full-year 2019, it   expects revenue to increase about 24% to 27%, up solidly from its   previous outlook of 18% to 22% growth. The company doesn't   provide earnings guidance.   10 stocks we like better than Insulet       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Insulet wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Beth McKenna      has no position in any of the stocks mentioned. The Motley Fool     recommends Insulet. The Motley Fool has a     disclosure policy      .  ",
    "Shares of   Insulet    (NASDAQ: PODD)  rocketed 25.4% higher in August, according   to data from      S&P Global Market Intelligence    . The stock has pumped out a gain of 108% in 2019 through Sept.   3, making it one of the year's best-performing medical device   stocks within the broader   healthcare arena    .",
    "The Boston-area company is the leader in tubeless insulin pump   technology with its Omnipod pump.",
    "Insulet stock's August performance is even more impressive   when you consider that the market had a down month. The   S&P 500,    including dividends, fell 1.6% last month, and has returned 17.5%   so far this year.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "We can attribute Insulet stock's strong performance last month   to the company's Aug. 5 release of its   second-quarter results    , which were better than Wall Street and many investors were   expecting, and to management once again increasing full-year 2019   revenue guidance. Shares surged 21.4% on the day following the   release and continued to move somewhat higher throughout the   remainder of the month.",
    "In Q2, Insulet's revenue soared 43% year over year to $177.1   million, easily beating the $164 million Wall Street was looking   for. Earnings per share came in at $0.02 -- versus a loss of   $0.03 per share in the year-ago period -- hitting the consensus   estimate on the bull's-eye.",
    "For the third quarter, Insulet guided for revenue growth of   about 15% to 20% year over year. And for full-year 2019, it   expects revenue to increase about 24% to 27%, up solidly from its   previous outlook of 18% to 22% growth. The company doesn't   provide earnings guidance.",
    "  10 stocks we like better than Insulet       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Insulet wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Insulet       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Insulet wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Beth McKenna      has no position in any of the stocks mentioned. The Motley Fool     recommends Insulet. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:30:00"
}