{
  "url": "https://www.nasdaq.com/article/aurora-cannabis-q4-shocker-what-you-need-to-know-cm1210827",
  "title": "Aurora Cannabis' Q4 Shocker: What You Need to Know - Nasdaq.com",
  "text": [
    " Imagine Babe Ruth pointing to the outfield fence before   stepping up to the plate, confidently predicting that a home run   is on the way. The pitch comes. He swings -- and hits a pop-up   that's easily caught by an infielder. What a letdown that would   have been, right? That scenario isn't too terribly different from what   Aurora Cannabis    (NYSE: ACB) just did. In August, the Canadian cannabis producer   provided guidance for its fiscal 2019 fourth   quarter    . It predicted net revenue between $100 million and $107 million   in Canadian dollars ($76 million to $81.3 million). That range   reflected impressive quarter-over-quarter growth of 59%. A home   run. Aurora stepped up to the plate after the market closed   Wednesday to report its actual Q4 results. And the company failed   to hit that predicted home run. Here's what you need to know.makeArticleAd();   Image source: Getty Images.  Overpromising, underdelivering Q4 net revenue was CA$98.9 million. Not only was that lower   than the range the company projected just a few weeks ago, but it   also came in well below the CA$108.3 million expected by   analysts. What happened? Aurora committed the age-old business mistake   of overpromising and underdelivering. In several respects, the company's Q4 top-line results were   very good. Net revenue jumped a whopping 52% over the previous   quarter. That kind of growth possibly would have been well   received had expectations not been set too high. Consumer cannabis net revenue, which reflects sales in the   Canadian adult-use recreational cannabis market, increased 52%   quarter over quarter to CA$44.9 million. Aurora also sold a lot   more cannabis in the wholesale bulk market -- CA$20.1 million in   Q4 versus less than CA$2.1 million in the previous quarter. The   company's medical cannabis net revenue climbed 10% to nearly   CA$29.7 million. But the average selling prices in the consumer and wholesale   bulk markets are much lower than average prices in the medical   cannabis market. As a result, its overall average net selling   price fell from CA$6.40 per gram in the third quarter to CA$5.32   in the fourth quarter. Perhaps the most telling sign of Aurora's challenges is the   company's statement that \"the Canadian consumer channel continues   to experience challenges at the retail level in key markets, and   resolution of this issue is beyond the Company's control.\" In   other words, provinces aren't opening enough retail outlets yet,   causing problems for Aurora and its peers. Chief Corporate Officer Cam Battley also   stated in the company's Q3 conference call    that he expected positive adjusted earnings before interest,   taxes, depreciation, and amortization (EBITDA) in the fourth   quarter. That didn't happen. Aurora instead announced an adjusted   EBITDA loss of CA$11.7 million. What to like While the glaring revenue miss is the big story with Aurora's   Q4 results, there were several things for investors to like with   the company's latest update. The supply constraints of the past   don't appear to be a big issue now. Aurora said that its   facilities currently have an annualized run-rate of more than   150,000 kilograms of cannabis. The company produced 29,034   kilograms of cannabis in the fourth quarter, up from 15,590   kilograms in the prior quarter. Gross margin also improved, rising to 58% in Q4 versus 55% in   the third quarter. This increase reflected continued progress in   reducing its production costs per gram. Despite failing to deliver positive adjusted EBITDA, the   company is tracking in the right direction. Its Q4 adjusted   EBITDA loss of CA$11.7 million was a whole lot better than the   adjusted EBITDA loss of CA$36.6 million in the previous   quarter. More at-bats to come Aurora shouldn't have provided revenue guidance that it wasn't   able to hit. And it shouldn't have talked about delivering   positive adjusted EBITDA if it wasn't fully confident that it   could meet that goal. But the Q4 results weren't horrible from an   objective perspective, putting aside estimates and   predictions. More importantly, the company should be able to continue on   its path to profitability. The Cannabis 2.0 market (referring to   the upcoming legalization of derivatives in Canada) presents new   growth opportunities for Aurora, which plans to launch multiple   new products in December. The company is also evaluating what it   said were \"a number of alternatives to grow Aurora's   presence in the U.S. market.\" Investing in   marijuana stocks    comes with the kinds of ups and downs we're seeing with Aurora.   The company itself stated that \"quarter-to-quarter sales volumes   and revenues may be volatile.\" Its share price could mirror that   volatility. Aurora demonstrated that it's not the Babe Ruth of cannabis.   But there are more at-bats to come.   Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.         And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018. And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution. Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks. Simply click here to get the full story now.  Learn more     Keith Speights      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Imagine Babe Ruth pointing to the outfield fence before   stepping up to the plate, confidently predicting that a home run   is on the way. The pitch comes. He swings -- and hits a pop-up   that's easily caught by an infielder. What a letdown that would   have been, right?",
    "That scenario isn't too terribly different from what   Aurora Cannabis    (NYSE: ACB) just did. In August, the Canadian cannabis producer   provided guidance for its fiscal 2019 fourth   quarter    . It predicted net revenue between $100 million and $107 million   in Canadian dollars ($76 million to $81.3 million). That range   reflected impressive quarter-over-quarter growth of 59%. A home   run.",
    "Aurora stepped up to the plate after the market closed   Wednesday to report its actual Q4 results. And the company failed   to hit that predicted home run. Here's what you need to know.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Q4 net revenue was CA$98.9 million. Not only was that lower   than the range the company projected just a few weeks ago, but it   also came in well below the CA$108.3 million expected by   analysts.",
    "What happened? Aurora committed the age-old business mistake   of overpromising and underdelivering.",
    "In several respects, the company's Q4 top-line results were   very good. Net revenue jumped a whopping 52% over the previous   quarter. That kind of growth possibly would have been well   received had expectations not been set too high.",
    "Consumer cannabis net revenue, which reflects sales in the   Canadian adult-use recreational cannabis market, increased 52%   quarter over quarter to CA$44.9 million. Aurora also sold a lot   more cannabis in the wholesale bulk market -- CA$20.1 million in   Q4 versus less than CA$2.1 million in the previous quarter. The   company's medical cannabis net revenue climbed 10% to nearly   CA$29.7 million.",
    "But the average selling prices in the consumer and wholesale   bulk markets are much lower than average prices in the medical   cannabis market. As a result, its overall average net selling   price fell from CA$6.40 per gram in the third quarter to CA$5.32   in the fourth quarter.",
    "Perhaps the most telling sign of Aurora's challenges is the   company's statement that \"the Canadian consumer channel continues   to experience challenges at the retail level in key markets, and   resolution of this issue is beyond the Company's control.\" In   other words, provinces aren't opening enough retail outlets yet,   causing problems for Aurora and its peers.",
    "Chief Corporate Officer Cam Battley also   stated in the company's Q3 conference call    that he expected positive adjusted earnings before interest,   taxes, depreciation, and amortization (EBITDA) in the fourth   quarter. That didn't happen. Aurora instead announced an adjusted   EBITDA loss of CA$11.7 million.",
    "While the glaring revenue miss is the big story with Aurora's   Q4 results, there were several things for investors to like with   the company's latest update. The supply constraints of the past   don't appear to be a big issue now. Aurora said that its   facilities currently have an annualized run-rate of more than   150,000 kilograms of cannabis. The company produced 29,034   kilograms of cannabis in the fourth quarter, up from 15,590   kilograms in the prior quarter.",
    "Gross margin also improved, rising to 58% in Q4 versus 55% in   the third quarter. This increase reflected continued progress in   reducing its production costs per gram.",
    "Despite failing to deliver positive adjusted EBITDA, the   company is tracking in the right direction. Its Q4 adjusted   EBITDA loss of CA$11.7 million was a whole lot better than the   adjusted EBITDA loss of CA$36.6 million in the previous   quarter.",
    "Aurora shouldn't have provided revenue guidance that it wasn't   able to hit. And it shouldn't have talked about delivering   positive adjusted EBITDA if it wasn't fully confident that it   could meet that goal. But the Q4 results weren't horrible from an   objective perspective, putting aside estimates and   predictions.",
    "More importantly, the company should be able to continue on   its path to profitability. The Cannabis 2.0 market (referring to   the upcoming legalization of derivatives in Canada) presents new   growth opportunities for Aurora, which plans to launch multiple   new products in December. The company is also evaluating what it   said were \"a number of alternatives to grow Aurora's   presence in the U.S. market.\"",
    "Investing in   marijuana stocks    comes with the kinds of ups and downs we're seeing with Aurora.   The company itself stated that \"quarter-to-quarter sales volumes   and revenues may be volatile.\" Its share price could mirror that   volatility.",
    "Aurora demonstrated that it's not the Babe Ruth of cannabis.   But there are more at-bats to come.",
    "  Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.         And make no mistake - it is coming. Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018. And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution. Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks. Simply click here to get the full story now.  Learn more  ",
    " Here's The Marijuana Stock You've Been Waiting For            A little-known Canadian company just unlocked what some experts     think could be the key to profiting off the coming marijuana     boom.        ",
    "And make no mistake - it is coming.",
    "Cannabis legalization is sweeping over North America - 10     states plus Washington, D.C., have all legalized recreational     marijuana over the last few years, and full legalization came     to Canada in October 2018.",
    "And one under-the-radar Canadian company is poised to     explode from this coming marijuana revolution.",
    "Because a game-changing deal just went down between the     Ontario government and this powerhouse company...and you need     to hear this story today if you have even considered investing     in pot stocks.",
    "Simply click here to get the full story now.",
    " Learn more ",
    "  Keith Speights      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:15:00"
}