{
  "url": "https://www.nasdaq.com/article/sensing-a-september-slump-buy-these-6-etfs-cm1207068",
  "title": "Sensing a September Slump? Buy These 6 ETFs - Nasdaq.com",
  "text": [
    " September is historically the worst month of the year for stocks. According to  moneychimp.com  , a consensus carried out from 1950 to 2018 has revealed that September ended up offering positive returns in 31 years and negative returns in 38 years, with an average return of negative 0.62%, which is worse than any other month. This September is no different with trade tensions escalating between the United States and China. China's government finally enacted higher tariffs on Sep 1 on the proportion of goods that only make up \"about  one third of the more than 5,000 product lines  listed in the latest announcement.\" The majority of the duties will be implemented on Dec 15. This move by China came on the heels of the U.S. government's announcement on Aug 1 that it is imposing a 10% tariff on $300 billion worth of Chinese goods. Washington then delayed some of the tariffs on Aug 13 stating that those will be enacted in two tranches  on Sep 1 and Dec 15  . But following China's announcement of retaliation, Trump said that he would \"raise tariffs on $250 billion worth of Chinese exports to  30% from 25% in October  .\" Moreover, tariffs planned on another $300 billion of Chinese goods have been revised to 15% from 10%. All these make it more important to pinpoint ETFs that have the power to navigate such threats.  Utilities Select Sector SPDR Fund XLU  Utilities is considered a safe sector and performs better in a low rate environment that we are witnessing currently. The fund XLU is in fact hovering around a 52-week high (read: 4 Sector ETFs in Focus as US Economy Appears in Late Cycle  ).      Residential Real Estate iShares ETF REZ  This is yet another sector that should perform well in a low rate environment. The underlying FTSE NAREIT All Residential Capped Index of the fund measures the performance of the residential, healthcare and self-storage real estate sectors of the U.S. equity market (read: Here's Why So Many Real Estate ETFs Near 52-Week High  ).  SPDR Gold Shares   GLD   Gold has already been hovering at a multi-year high as the metal acts as a safe-haven asset. If China and the United States fail to strike a proper trade deal in the near term, gold is expected to trade higher in the coming days (read: August ETF Asset Report: Gold Tops  ).  iShares Core Moderate Allocation ETF AOM  The fund tracks the S&P Target Risk Moderate Index, which intends to represent a moderate target risk allocation strategy. It is designed to measure risk-adjusted exposure to a diversified array of financial assets. It invests 61.22% of its portfolio in the fixed-income while 37.86% of its assets go to equity. This kind of multi-asset portfolio also offers enough cushion to the fund in a volatile market.  Aptus Defined Risk ETF   DRSK   The Aptus Defined Risk ETF is an actively-managed strategy fund that seeks income and growth through a hybrid fixed income and equity approach. This is another multi-asset fund that could give investors some benefits in turbulent times.  Consumer Discretionary Select Sector SPDR Fund   XLY   Though this is a cyclical sector and might not do well in the faltering market, a lot of factors may favor this sector. An almost 19-year high consumer confidence level, and last-minute  back-to-school/college   shopping may give the space a boost (read: ETFs to Buy as Americans' Confidence Nears 19-Year High  ).  Want key ETF info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.  Get it free >>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Consumer Discretionary Select Sector SPDR Fund (XLY): ETF Research Reports   Utilities Select Sector SPDR Fund (XLU): ETF Research Reports   SPDR Gold Shares (GLD): ETF Research Reports   iShares Core Moderate Allocation ETF (AOM): ETF Research Reports   iShares Residential Real Estate ETF (REZ): ETF Research Reports   Aptus Defined Risk ETF (DRSK): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    "September is historically the worst month of the year for stocks. According to  moneychimp.com  , a consensus carried out from 1950 to 2018 has revealed that September ended up offering positive returns in 31 years and negative returns in 38 years, with an average return of negative 0.62%, which is worse than any other month.",
    "This September is no different with trade tensions escalating between the United States and China. China's government finally enacted higher tariffs on Sep 1 on the proportion of goods that only make up \"about  one third of the more than 5,000 product lines  listed in the latest announcement.\" The majority of the duties will be implemented on Dec 15.",
    "This move by China came on the heels of the U.S. government's announcement on Aug 1 that it is imposing a 10% tariff on $300 billion worth of Chinese goods. Washington then delayed some of the tariffs on Aug 13 stating that those will be enacted in two tranches  on Sep 1 and Dec 15  .",
    "But following China's announcement of retaliation, Trump said that he would \"raise tariffs on $250 billion worth of Chinese exports to  30% from 25% in October  .\" Moreover, tariffs planned on another $300 billion of Chinese goods have been revised to 15% from 10%.",
    "All these make it more important to pinpoint ETFs that have the power to navigate such threats.",
    " Utilities Select Sector SPDR Fund XLU ",
    "Utilities is considered a safe sector and performs better in a low rate environment that we are witnessing currently. The fund XLU is in fact hovering around a 52-week high (read: 4 Sector ETFs in Focus as US Economy Appears in Late Cycle  ).    ",
    " Residential Real Estate iShares ETF REZ ",
    "This is yet another sector that should perform well in a low rate environment. The underlying FTSE NAREIT All Residential Capped Index of the fund measures the performance of the residential, healthcare and self-storage real estate sectors of the U.S. equity market (read: Here's Why So Many Real Estate ETFs Near 52-Week High  ).",
    " SPDR Gold Shares   GLD  ",
    "Gold has already been hovering at a multi-year high as the metal acts as a safe-haven asset. If China and the United States fail to strike a proper trade deal in the near term, gold is expected to trade higher in the coming days (read: August ETF Asset Report: Gold Tops  ).",
    " iShares Core Moderate Allocation ETF AOM ",
    "The fund tracks the S&P Target Risk Moderate Index, which intends to represent a moderate target risk allocation strategy. It is designed to measure risk-adjusted exposure to a diversified array of financial assets. It invests 61.22% of its portfolio in the fixed-income while 37.86% of its assets go to equity. This kind of multi-asset portfolio also offers enough cushion to the fund in a volatile market.",
    " Aptus Defined Risk ETF   DRSK  ",
    "The Aptus Defined Risk ETF is an actively-managed strategy fund that seeks income and growth through a hybrid fixed income and equity approach. This is another multi-asset fund that could give investors some benefits in turbulent times.",
    " Consumer Discretionary Select Sector SPDR Fund   XLY  ",
    "Though this is a cyclical sector and might not do well in the faltering market, a lot of factors may favor this sector. An almost 19-year high consumer confidence level, and last-minute  back-to-school/college   shopping may give the space a boost (read: ETFs to Buy as Americans' Confidence Nears 19-Year High  ).",
    " Want key ETF info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.  Get it free >> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:00:00"
}