{
  "url": "https://www.nasdaq.com/article/teslas-use-of-individual-driver-data-for-insurance-statebystate-proposition-20190905-00018",
  "title": "Tesla's use of individual driver data for insurance 'state-by-state proposition' - Nasdaq.com",
  "text": [
    "By Tina Bellon",
    "Chicago, Sept 4 (Reuters) - Tesla Inc's  use of individual customer data, such as vehicle camera footage and GPS, to price its new insurance products will depend on drivers' authorization and individual U.S. state laws, a senior company executive said on Wednesday.",
    "\"The data is there, it's all there, cameras in and all around your car, all of the data points are there,\" Matthew  Edmonds, Tesla's Head of Insurance, said at an auto insurance conference in Chicago.",
    "Tesla last week said it was launching an insurance service designed to give drivers in California, its biggest market, lower rates because of safety features on its electric vehicles. ",
    "The company did not name an insurance partner, but the California Department of Insurance website showed Tesla was  licensed as a broker to conduct business on behalf of the State National Insurance Company Inc, a unit of Markel Corp .",
    "Chief Executive Elon Musk has been one of the strongest proponents of the idea that car insurance rates should plummet as driver-assist and self-driving technology become standard.",
    "U.S. insurers say they currently do not have sufficient data to validate auto industry promises of safety benefits from automated driving systems, citing automakers' reluctance to provide detailed information on models sold with those features, a lack of consistent standards, drivers' unpredictable use of the systems and higher repair costs. ",
    "Tesla is one of the few manufacturers whose vehicles are largely standard-equipped with advanced driver assistance features, including cameras monitoring lane keeping and recording vehicle surroundings.",
    "California regulatory insurance filings in May said Tesla's insurance product might use \"direct data feeds with customer permission.\"",
    "But Tesla's insurance website states it uses \"anonymized, aggregate data\" to inform insurance rates, adding that it does not currently use data from individual vehicles, such as GPS or video footage.",
    "Edmonds on Wednesday said the company currently was not using much data beyond regular auto insurance pricing components, which include variables such as a driver's age, years of driving experience, safety record and annual mileage.",
    "He declined to say when the company would consider using additional data to price insurance rates.",
    "Asked what states Tesla would expand its insurance program to next, Edmonds said: \"Find the states where the population is, those will be the states we'll be going to.\""
  ],
  "published_datetime": "2019-09-05 01:02:00"
}