{
  "url": "https://www.nasdaq.com/article/aurora-cannabis-needs-to-keep-its-finger-on-the-marijuana-pulse-cm1207383",
  "title": "Aurora Cannabis Needs to Keep its Finger on the Marijuana Pulse - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Aurora Cannabis (NYSE: ACB ) is coming off a brutal August, the latest in a long line of rough months for the Canadian cannabis company. With each month of struggles, the shares become a little more tempting.",
    "With an annual cannabis output that now exceeds 625,000 kilograms , it's easy to see why some investors may find Aurora stock attractive. The company offers scale in an often fragmented market. It's one of the world's largest cannabis producers and some of its core competencies include industry-leading output and logistical capabilities.",
    "Last month, the company released preliminary fiscal fourth-quarter results , including a forecast of sales of $100 million CAD to $107 million CAD. That's good for a roughly five-fold increase from the year-earlier period and 60% quarter-over-quarter growth. Those headlines temporarily bought ACB stock some goodwill among investors. However, as Aurora stock has often shown , making the good times last is easier said than done.",
    "The company's official quarterly earnings report is due out Sept. 15 and that should be a catalyst, in one way or another, for Aurora Cannabis stock. Management also upped its production outlook to 25,000 kilograms to 30,000 kilograms, above a previous forecast calling for 25,000 kilograms at the high end.",
    "Cowen analyst Vivien Azer noted that these preliminary results imply stronger-than-expected yields, which could help the company approach a cost per gram of less than $1 CAD, or 75 U.S. cents.",
    "Integral to the long-term thesis for Aurora stock is management's ability to find growth channels outside of Canada and the medicinal marijuana market. Those are viable growth opportunities, but they are largely baked into Aurora stock. By some forecasts , medicinal marijuana will see some contraction in the coming years.",
    "Morningstar's Kristoffer Inton said that he believes the medical market will shrink as recreational use is legalized. He also forecasts 20% average annual growth for the next decade, thanks to \"black-market\" consumers moving towards legal use.",
    "That's a perfect segue into talking about the U.S. Cannabis companies and investors are betting that increased U.S. legalization will bring recreational use out of the shadows. While some states have signed off on it, cannabis for medical and recreational purposes is illegal at the federal level in the U.S.",
    "Aurora Cannabis is eyeing the U.S. market in its own way, and acknowledges that a footprint south of it home market \"is nonnegotiable.\" There are plenty of other reasons why ACB stock could get a jolt. The company just needs U.S. policymakers' attitude toward cannabis to loosen up.",
    "\"Not only is the U.S. a larger opportunity, but it has a better economic model,\" GMP Securities analyst Rob Fagan told Barron's. \"In most states, you're allowed to go direct to your customer - from production right up to retail - cashing in on more of the value chain. There are also fewer restrictions on product forms and advertising than in Canada.\"",
    "Unlike some of its rivals, Aurora Cannabis is currently without partners from the tobacco or beverage industries, although the company has admitted Coca-Cola (NYSE: KO ) would make for an appealing partner.",
    "This goes back to Aurora's relationship with activist investor Nelson Peltz . Peltz has famously (and successfully) pushed for change at companies such as Procter & Gamble (NYSE: PG ), Mondelez (NASDAQ: MDLZ ) and Wendy's (NASDAQ: WEN ). However, the relationship with Peltz is something that is also baked into Aurora Cannabis stock. Investors are now demanding something substantive to come of his involvement.",
    "Inton said that Aurora Cannabis is limited in its potential to benefit from new partnerships. This is because of its lack of exposure in the U.S. market.",
    "For ACB stock, the writing is on the wall. The company must make a credible foray into the U.S. and execute on that endeavor, or risk generating dissatisfaction.",
    "The U.S. market remains an \"X factor\" for Canadian cannabis companies. But, the good news is that Aurora Cannabis stock is well below a credible fair value estimate of $9-$10.",
    "Todd Shriber does not own any of the aforementioned securities.",
    "The post Aurora Cannabis Needs to Keep its Finger on the Marijuana Pulse appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:15:21"
}