{
  "url": "https://www.nasdaq.com/article/swiss-welcome-scrutiny-in-handling-libra-cyrptocurrency-20190912-00036",
  "title": "Swiss welcome scrutiny in handling Libra cyrptocurrency - Nasdaq.com",
  "text": [
    "ZURICH, Sept 12 (Reuters) - Switzerland welcomes international scrutiny of the way it oversees the Facebook-led Libra cryptocurrency project and is ready to work with other countries to ensure seamless supervision, the top Swiss financial watchdog said.",
    "Facebook , the world's largest social media network, announced plans in June to launch the new digital currency, but  Geneva-based Libra has come under fire from regulators who fear it could destabilise the global financial system.",
    "The Libra Association said on Wednesday it planned to apply to become a Swiss-licensed payments system, casting the spotlight on how the Swiss Financial market Supervisory Authority (FINMA) handles the matter. ",
    "\"If a financial centre has ambitions, it must be able to live with attention,\" he said in an interview published on Thursday, noting the Swiss embrace of fintech put it in a good place to handle such innovative and ambitious projects.",
    "It was ready to work with other countries taking a keen interest in Libra, as visits from top-level U.S. officials and warnings from the Group of Seven advanced economies have shown. ",
    "\"A project of such a global dimension can be addressed only via international coordination and consultation with other supervisors and regulators,\" Branson said. \"It is illusory to believe a single country can regulate and oversee a project like Libra on its own. The supervision of (big Swiss banks) UBS  or Credit Suisse  also does not take place in complete isolation.\"",
    "Much concern about Libra and other cryptocurrencies centres on the potential of abuse for laundering money or financing crime.",
    "\"Our approach aims to regulate the crypto world in terms of money laundering the same as the conventional financial world. Our requirements here are among the strictest worldwide,\" Branson said.",
    "\"At the same time, new technologies can also bring benefits in the fight against money laundering, for example if traceability of transactions becomes fully available. So there are risks and opportunities.\"",
    "Branson insisted that the Libra project did not choose Switzerland as its base after a \"beauty contest\" to see where it might face the lightest regulatory touch.",
    "\"Our first contact with the initiators took place after the decision for Switzerland had already been made and communicated. That's positive,\" he said."
  ],
  "published_datetime": "2019-09-12 01:53:00"
}