{
  "url": "https://www.nasdaq.com/article/caseys-general-reports-mixed-results-but-remains-optimistic-cm1210315",
  "title": "Casey's General Reports Mixed Results but Remains Optimistic - Nasdaq.com",
  "text": [
    " After a few years of stagnation in its stock,   Casey's General    (NASDAQ: CASY) has given investors something to cheer for. After   reporting   strong progress in price optimization and an   upbeat outlook     in June, shares have risen 25%. The company followed that up with a mixed bag of results for   the first quarter of fiscal 2020 this week. As you'll see, there   were many bright spots and some areas for concern, but management   remained confident that the company would reach its full-year   goals.   Image source: Getty Images.makeArticleAd();   Casey's earnings: The raw numbers  Before diving into the weeds, let's review how Casey's   performed on the headline numbers.  Data source: Casey's General investor relations. EPS =   earnings per share. On the face of it, this is pretty impressive. The company was   able to grow earnings 22% based on just a 1% bump in revenue. But   with Casey's, the story is a bit more complicated. Because fuel   accounts for the lion's share of sales -- but a far lower   percentage of profits -- revenue alone doesn't tell us much. Instead, it's important to monitor how the other two segments   -- groceries and prepared food -- performed, as well. Casey's   lures in customers with gas but makes most of its money on these   other two offerings. Here's how the company performed in all three areas, versus   its stated outlook for the year ahead.  Data source: Casey's General IR. Comps = comparable store   sales. We'll start by focusing on the positive. Fuel comps came in   lower than expected, but Casey's more than made up for it with   the impressive gas margins. In his prepared remarks, CEO Darren   Rebelez heaped praise on the company's new price-optimization   strategy: \"We have gained significant agility to capture   additional fuel margin while maintaining a competitive pricing   structure.\" Even though grocery margins came in below expectations, it   mostly had to do with a $6.6 million inventory adjustment.   Assuming such adjustments are one time in nature, this isn't much   to worry about. Without the charge, margins would have come in at   32.3% -- within management's range. Prepared foods, on the other hand, remain a thorn in the   company's side. Casey's pizza sales were a huge driver for the   stock coming out of the Great Recession. But over the past four   years, management has   continually over promised and under delivered    when it came to this critical category. It's worth noting this has been   a trend in food stocks    , in general, over the same time frame. That said, the pattern of   missing expectations continued, with comps coming in light at   1.6%. As we'll cover in greater detail below, however, Rebelez is   still optimistic. \"We believe the previously launched e-commerce   website and new mobile app, when combined with our future loyalty   program, will significantly enhance the overall guest   experience.\"  What else happened during the quarter?  Here are some other nuggets of note from the company's   release:  With the elevated stock price, Casey's did not make any     share repurchases under the $300 million program that's in     place. Total store count increased by 76 year over year and 15     sequentially, to end the quarter with 2,161 locations. Casey's has a pipeline of 107 new sites, with 35 currently     under construction. Cost-cutting measures continued to to juice returns, with     operating expenses up just 5.7%. If credit card fees are backed     out, operating-expenses growth looked even better, registering     at 2.5%.   Looking ahead  Despite that fact that gas sales are coming in light and   prepared foods are badly missing expectations, management made no   changes to the company's outlook. If the company can keep getting   the gas margins it did this quarter, any shortfall in gallons   sold shouldn't be too big of a problem. What investors should really watch is whether or not   prepared-food comps can come in within the 3% to 6% growth range   by the end of the year. The fiscal year didn't start on the right   foot, but if Casey's can really accomplish this feat, it would be   a very positive sign for Rebelez's tenure -- and the company's   shareholders, in general.   10 stocks we like better than Casey's General     Stores       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Casey's General Stores     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Brian Stoffel      has no position in any of the stocks mentioned. The Motley Fool     recommends Casey's General Stores. The Motley Fool has a     disclosure policy      .  ",
    "After a few years of stagnation in its stock,   Casey's General    (NASDAQ: CASY) has given investors something to cheer for. After   reporting   strong progress in price optimization and an   upbeat outlook     in June, shares have risen 25%.",
    "The company followed that up with a mixed bag of results for   the first quarter of fiscal 2020 this week. As you'll see, there   were many bright spots and some areas for concern, but management   remained confident that the company would reach its full-year   goals.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "Before diving into the weeds, let's review how Casey's   performed on the headline numbers.",
    "Data source: Casey's General investor relations. EPS =   earnings per share.",
    "On the face of it, this is pretty impressive. The company was   able to grow earnings 22% based on just a 1% bump in revenue. But   with Casey's, the story is a bit more complicated. Because fuel   accounts for the lion's share of sales -- but a far lower   percentage of profits -- revenue alone doesn't tell us much.",
    "Instead, it's important to monitor how the other two segments   -- groceries and prepared food -- performed, as well. Casey's   lures in customers with gas but makes most of its money on these   other two offerings.",
    "Here's how the company performed in all three areas, versus   its stated outlook for the year ahead.",
    "Data source: Casey's General IR. Comps = comparable store   sales.",
    "We'll start by focusing on the positive. Fuel comps came in   lower than expected, but Casey's more than made up for it with   the impressive gas margins. In his prepared remarks, CEO Darren   Rebelez heaped praise on the company's new price-optimization   strategy: \"We have gained significant agility to capture   additional fuel margin while maintaining a competitive pricing   structure.\"",
    "Even though grocery margins came in below expectations, it   mostly had to do with a $6.6 million inventory adjustment.   Assuming such adjustments are one time in nature, this isn't much   to worry about. Without the charge, margins would have come in at   32.3% -- within management's range.",
    "Prepared foods, on the other hand, remain a thorn in the   company's side. Casey's pizza sales were a huge driver for the   stock coming out of the Great Recession. But over the past four   years, management has   continually over promised and under delivered    when it came to this critical category.",
    "It's worth noting this has been   a trend in food stocks    , in general, over the same time frame. That said, the pattern of   missing expectations continued, with comps coming in light at   1.6%.",
    "As we'll cover in greater detail below, however, Rebelez is   still optimistic. \"We believe the previously launched e-commerce   website and new mobile app, when combined with our future loyalty   program, will significantly enhance the overall guest   experience.\"",
    "Here are some other nuggets of note from the company's   release:",
    "Despite that fact that gas sales are coming in light and   prepared foods are badly missing expectations, management made no   changes to the company's outlook. If the company can keep getting   the gas margins it did this quarter, any shortfall in gallons   sold shouldn't be too big of a problem.",
    "What investors should really watch is whether or not   prepared-food comps can come in within the 3% to 6% growth range   by the end of the year. The fiscal year didn't start on the right   foot, but if Casey's can really accomplish this feat, it would be   a very positive sign for Rebelez's tenure -- and the company's   shareholders, in general.",
    "  10 stocks we like better than Casey's General     Stores       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Casey's General Stores     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Casey's General     Stores       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Casey's General Stores     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Brian Stoffel      has no position in any of the stocks mentioned. The Motley Fool     recommends Casey's General Stores. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:00:00"
}