{
  "url": "https://www.nasdaq.com/article/gamestop-corp-new-gme-q2-2019-earnings-call-transcript-cm1210295",
  "title": "GameStop Corp New (GME) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   GameStop Corp New    (NYSE: GME)        Q2 2019 Earnings Call       Sep 10, 2019 ,   5:00 p.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Unidentified Speaker  (Starts Abruptly) Thank you. And welcome to GameStop's Second   Quarter Fiscal 2019 Earnings and Conference Call. This conference call will include forward-looking statements,   which are subject to various risks and uncertainties that could   cause actual results to differ materially from expectations. Any   such statements should be considered in conjunction with the   cautionary statements and the safe harbor statement in the   earnings release and risk factors discussed in reports filed with   the SEC. GameStop assumes no obligation to update any of these   forward-looking statements or information. A reconciliation and   other information regarding non-GAAP financial measures discussed   on the call can be found in the earnings release issued earlier   today as well as the Investor Section of our website. With me today are GameStop's Chief Executive Officer, George   Sherman; and Chief Financial Officer, Jim Bell. On today's call,   George will not only discuss some highlights from our second   fiscal quarter, but also share specific details of GameStop's   strategic framework for the future. Jim will then provide more   detail on our financial results and some key expectations for the   remainder of the year and into 2020. Now, I would like to turn the call over to the company's Chief   Executive Officer, George Sherman.  George Sherman    --   Chief Executive Officer  Thank you. Good afternoon, everyone, and thank you for joining   us today on our second quarter       earnings call    . As I mentioned in our last call, I, along with my new   management team, have been moving quickly to assess the business   and develop our strategy to reposition the organization for the   future. Following numerous meetings with stakeholders, from across   every aspect of our business, we have acquired valuable feedback   and data to further reform our direction and believe, we are   formulating the strategic framework and specific initiatives to   achieve our long-term growth and profit objectives. We are committed to taking quick and deliberate actions to   improve the performance of the company and set on the correct   strategic path, fully leveraging our unique position and brand in   the video game industry. I believe that during the call today,   you will hear that we are fully committed to that mission and are   acting with a sense of urgency to address the areas of the   business that are critical to achieving long-term success and   value creation. We recognize that there was a need to rebuild credibility with   the investment community and some of our stakeholders. We plan to   accomplish this by quickly establishing a track record of   delivering on our promises and executing plans for the business   that will support improved financial performance and fuel future   growth over the long-term. You're going to hear a similar message   from Jim Bell regarding clarity of financial metrics and an   appropriate level of transparency for how we hold ourselves   accountable in meeting our objectives. To that end, today we will outline a strategy that includes   both near-term and long-term measurable objectives, which we plan   to track our progress against each quarter. Let's get into the   details of that plan. Our strategic plan is anchored on four key   tenets. One, optimize core business by improving efficiency and   effectiveness in everything we do. Two, create a social and cultural hub of gaming within each   GameStop store and online. Three, build compelling digital   capabilities to reach our customers wherever they want to do   business and give them the full spectrum of content and access to   the products they are looking for. And four, transform our vendor   and partner relationships, unlocking additional high-margin   revenue streams and optimizing the lifetime value of every   customer. Let's take each of these one by one. First, we'll optimize the   core business by driving efficiency and effectiveness across   everything we do. There are several initiatives within this   pillar, but broadly speaking, they include overhead cost   restructuring, inventory management optimization, including   streamlining SKU accounts and pricing and promotion optimization,   and a full review of rationalization of the store footprint   across the globe. As I mentioned, we are moving with a sense of urgency and have   already demonstrated our commitment to doing so with our recent   efforts to rightsize the organization across our corporate   infrastructure and our US store leadership organization. Over the last couple of months, we implemented changes that   require us to make tough, but necessary decisions for the benefit   of our organization moving forward. These changes will drive   efficiencies and serve as a catalyst to rightsizing our cost   structure. That work is continuing, and we are further executing   other ways to optimize operational cost, including restructuring   or exiting unprofitable businesses or markets, and each and every   aspect of our indirect procurement activities. As we told you in June, we are exiting the Simply Mac business   and continue to work toward that divestiture in the near term. We   also embedded thinkgeek.com into the gamestop.com environment to   leverage that existing platform, further streamlining the   organization. As you may know, in June, we hired Chris Homeister as our   Chief Merchandising Officer. Chris has an extensive hardlines and   specifically consumable electronics retail background and has   already developed and implemented several initiatives to improve   the overall productivity of our stores and products. First, we are employing more effective merchandising   practices, including among other things, few rationalization,   which will declutter our stores and provide a better experience   to our customers. The first store set with this evolving strategy   begins next week. Second, we believe that through a more comprehensive pricing   architecture and end-to-end product and pricing life cycle   management, we can drive higher overall product margins. And   third, we are committed to adding and growing high-margin product   categories, which not only work to offset market-driven declines   and pre-owned software sales, but also add to our credibility   with customers as the only retail outlet for the aggregation of   all things video gaming and pop culture. For example, we see further opportunity in expanding our   double-digit growth collectibles category, creating more   exclusive packages with our vendors, expanding our PC gaming   offerings, and evolving our private label business by leveraging   our significant scale and retail expertise. Optimizing our store base for an increasingly digital world is   essential for the future and increasing profit productivity. We   have an expansive and profitable store base, with 95% of our   stores posting four-wall EBITDA positive results. However, we   know we have the opportunity to do even better and expand   profitability by de-densifying our store footprint in some   markets. We are committed to both closing loss-making locations, as   well as maximizing profit productivity from capturing sales and   profit transfer in stores with overlapping trade areas. We   believe that store de-densification will be materially accretive   to the overall business model, and remembering that our average   lease life is only two years, we can approach these strategic   decisions with limited, if any, cost implications. In total, we believe these operating profit improvement   initiatives will substantially exceed the previous management   team's initial $100 million target that was communicated earlier   in the year. We believe the total annualized run rate of our   profit improvement initiatives will be in excess of $200 million   for 2020 and beyond. Moving to the second pillar of our strategy, we are committed   to creating a social and cultural hub of gaming within each   GameStop store, online and within the digital environment. This   is especially important as the video game industry experiences   significant change from the evolving methods in which customers   are consuming video games to the more near-term disruption from   the current console cycle coming to an end. We are and have been   the leading expert in the industry for decades and have the   ability to leverage that position to create an experience that   ignites passion before, during and after each transaction. Not only are we the largest videos sales generator for our   hardware and software partners, we are also the video game   authority in countless neighborhoods around the globe. This is   what makes GameStop unique. There is no other brand better   position to be the aggregator of video game products and content,   including eSports and digital media, with the deep expertise of   our associates to gamers of all demographics worldwide. As part of this strategy, we have begun testing a series of   experiential offerings within the Tulsa, Oklahoma market. Think   of this approach as a live laboratory, which will help us define   and execute the optimum mix of high-margin immersive experiential   gaming content with our existing array of video games and   collectibles products. For example, we will try a   try-before-you-buy experience was up to 12 gaming days,   eSports-focused comparative gaming content delivery, a   collectibles-focused experience, all supporting physical and   digital video gaming accessories transactions. Of note, this is a very controlled and disciplined test that   fits well within our capital expense budget for fiscal 2019, and   any rollout from the test will not be implemented in every store   in the chain. It's still early, and we will share some of these   findings with you as we progress in the coming quarters. While we believe these tests along with our other initiatives   are necessary to define and add new high-growth and high-margin   revenue streams for our business, we remain committed to two   things. One, we are the leading omni-channel video game retailer   and will continue to be. And two, we do not intend to completely   remodel our chain of stores, but rather we expect the results of   these tests will yield a highly profitable store model that will   complement various key markets, further enhancing our already   strong customer engagement as well as evolving our product   offering and position within the gaming industry. Finally, an integral part of being in the social and cultural   hub of gaming is our customer engagement within our loyalty   program. We are exploring ways to expand the PowerUp Rewards   program by enhancing the program's value to our most active   shoppers, while simultaneously driving profitability. Most   importantly, we are redesigning our PowerUp Rewards program,   where among other things, we are testing various recurring   revenues subscription opportunities. Secondly, we are in the   final stages of rolling out a new and improved value proposition   for the paid PowerUp Pro tier which in early test is yielding   favorable results in enrollment and customer frequency. Finally, we've upgraded our customer database management tool   set based on the Salesforce marketing cloud platform. This   integration along with some new agency partnerships will enable a   more sophisticated propensity-driven marketing model at the   one-to-one level, thereby focused on growing customer lifetime   value and ROI. Our third strategic pillar is building a complete and   compelling set of digital capabilities. Digital is not only a   growing aspect of our industry, it's also a large part of who we   are. Today, we attach significantly more digital content to   in-store and online purchases than any other retailer, and we're   focused on evolving further as we build our best-in-class   omni-channel capabilities. Simply, we have to adapt to meet our   customers wherever they want to do business. We must and will be   channel-agnostic. The first component of delivering a best-in-class omni-channel   experience is the new gamestop.com platform that launched in   August. This new online experience delivers highly engaged and   fast online merchandising, new buy or hold and pick up in store   functionality and rich community content. With enhanced   functionality like Apple Pay and integrated PowerUp Rewards   enrollments and improved shopability, this relaunch marks an   important step toward our long-term goal of creating $1 billion   e-commerce business. It also provides our customers with the   omni-channel capabilities that they've come to expect. Our efforts won't end here. Instead, we are currently working   on various capabilities that we believe will add significant   value for our customers. Simply by leveraging existing assets, we   have the opportunity to enrich and monetize data available to us   and create digital exclusives. We recognize and are embracing   digital as an opportunity for GameStop, and we are committed to   supporting our vendor initiatives, both digitally and physically,   including initiatives such as developing capabilities that allow   for or enable a more streamlined embedded digital purchase   process. Finally, the fourth pillar in our strategy, we are in the   early stages of transforming our vendor and partner relationships   to better position us for the future of video gaming. When I   first spoke to you in June, I told you that I believe it was   important for GameStop to transform and evolve to remain a viable   player in our industry, which is undergoing meaningful   technological change. We are committed to doing that, but   recognize that this part of the strategy will take longer to   develop. The good news is two-fold. First, we are advancing very constructive discussions with our   partners and they recognize the value that we bring to them. And   second, both Microsoft and Sony recognize the market and   technology advancement will still require physical disks in the   next gaming console cycle. Our 50,000-plus knowledgeable associates worldwide serve as   the only full-time dedicated sales force in the video game   industry. And the results they drive are meaningful. We attach   significantly more games, content, digital media and related   pop-culture content than any retail outlet for both our hardware   and software partners and in most cases are their number one   volume sales outlets. Our associates bring an enormous amount of value to console   makers, given they are an integral part of their customer   acquisition model. Our partners are actively engaging with us to   evolve the model from a historical transactional model to one   that rewards us across the customer acquisition and lifetime   value spectrum, not simply transactions. As an organization, we are intensely focused on advancing each   of our four strategic tenets and we will continue to update you   on our progress against our goals in the months ahead. Some of   these opportunities will serve to benefit us sooner rather than   later, and some of these initiatives will take time to nurture   and cultivate over the long term. We will be disciplined with our   approach to innovation by focusing on our initiatives that will   benefit the core video game business and leverage our current   portfolio of assets, but not require significantly more capital   growth. In fact, we intend to maintain our historical annual capital   expenditure levels and redirect some of those funds toward these   initiatives. We are out of the diversification business. We will   test and learn before we deploy and our decision-making will be   driven by a disciplined approach to capital allocation. We will   not, under any circumstances bet the farm. As you can tell from my comments, I'm excited about the   opportunity in front of us. It's a tremendous challenge and will   require significant effort on our part, but we are well on our   way. Make no mistake, this transition will take time and our   sales expectations over the next several quarters will reflect   the end of console cycle and the next generation of console   launches by both Sony and Microsoft later for 2020. However, as you can see, our strategic framework is focused   not only on sales, but expanding our gross margin, reducing costs   and optimizing inventory management, all of which will lead to   continued growth of free cash flow of the business, both in the   near term and over the long-term. Before I turn the call over to Jim for our financial review of   the quarter and outlook for the remainder of the year, I want to   take a minute to address some of the misconceptions that I've   heard over my first few months. It's clear to me that market   sentiment regarding our core business is not fully reflective of   our intrinsic value. There are likely several things driving   that, many of which we are currently addressing. But what I do   know is that we have tremendous assets that have driven and can   continue to drive meaningful shareholder value and cash returns.   We believe those assets are being discounted by a market that is   focused solely on a short-term view and mistakes of prior   management, such as failed diversification investment   decisions. In our view, our current sales performance reflects the   natural end of console cycle that will rebound with console   launches later in 2020. However, while we believe strongly in the   value creation opportunity of our initiatives, this management   team is committed to being a good steward of capital and being   disciplined and highly strategic in terms of any potential   investments, as well as returning excess capital to shareholders.   We have a strong and improving balance sheet and cash flows, a   highly profitable store base, a very resilient brand that   operates from a position of strength in the industry. In closing, we have a tremendous chance to shape the future of   GameStop in this evolving and dynamic industry as the leading   provider of rich video gaming products, content and expertise   across all purchasing channels. Our team is committed to tackling   the challenges in front of us and we are confident that we are   positioning the business to deliver strong results, particularly   with the next console cycle on the horizon. As we evolve our   business model over that same timeframe, we'll be better equipped   to drive increased profitability when the industry cycle turns   and consoles launch in 2020. I'd now like to turn the call over to Jim for a recap of the   quarter and our outlook on key business metrics. Thank you.  James Bell    --   Executive Vice President and Chief Financial Officer  Thank you, George, and good afternoon, everyone. It's great to   be with you here today. I, like George, was drawn to GameStop by   the enormous potential of this business. GameStop's strong brand   positioning and engagement with the large passionate customer   base has the leading authority in all things video games, along   with the opportunity to be part of a leadership team, driving   innovation and transformation, make this an exciting and pivotal   time to be at GameStop. My initial observations are very much aligned with George's   and the other members of our senior leadership team. We have   quickly joined forces to take definitive actions on things that   needed to be done, such as exiting unprofitable businesses,   rightsizing our cost structure, applying deep retail expertise to   elevate the overall efficacy of our operations and setting the   stage for developing new revenue streams for the future of the   business, particularly as the video game industry continues to   evolve. However, as George shared, we are not done and have a lot of   work in front of us. But we are acting with a sense of urgency,   making tough but necessary decisions and moving forward with the   disciplined approach to deploying these strategies, which we   believe will position GameStop to maximize shareholder value. We are committed to providing you as much transparency as   possible and updating you as we progress through the   transformation of the business, which is specifically intended to   restore credibility among the investment community. Now, I would like to shift to a recap of the second quarter   results. From the top line perspective, total sales declined   $215.4 million, or 14.3% as compared to the second quarter of   2018. The sales decline was comprised of an 11.6% comparable   store sales decline, a 130 basis points related to 195 store   closures since the second quarter last year and 140 basis points   of negative foreign exchange impact. While not up to our expectations, these results are generally   in line with declines across the video game industry and   indicative of sales volumes at this point in the console cycle.   As such, the primary driver of the sales decline was new hardware   sales, which was down 41% year-over-year. However, as you know, we are focused on growing other product   lines that are important to our gamer community. Our collectibles   business is a great example. It continues to positively expand,   posting a 21% year-over-year increase in the second quarter,   exceeding our expectations and marking the 15th consecutive   quarter of growth with 14 out of the 15 in double digits. Software sales declined 5.3% with declines across most   categories, slightly offset by growth in Nintendo Switch software   and the release of the current year title in the Madden NFL   franchise toward the end of the quarter. In line with the current   stage of the console cycle, our pre-owned video game business was   down 17.5%, with consistent declines across both hardware and   software. It is worth noting that within pre-owned hardware, we   continue to see strong demand for the Nintendo Switch, but a   solid sales increase on this platform was more than offset by   declines in the other consoles as we await next generation   launches later in 2020. Overall, gross margins declined by 30 basis points to 31%,   primarily driven by markdown activity related to the wind down of   our thinkgeek.com business. Excluding the effects of this   transition, overall margins for the quarter would have been   31.4%, reflecting a 10 basis point expansion. As reported, SG&A for the second quarter was $459 million,   compared to $442 million a year ago. The increase was driven by   $37 million in one-time transformation, severance, and other   charges associated with our GameStop Reboot profit improvement   initiatives. After adjusting for these one-time charges, SG&A   expenses declined by $19.2 million or 4.3%, reflecting just the   beginning of the impact of our organizational changes as we   implemented them late in or subsequent in the quarter. During the quarter, we incurred a non-cash, non-operating   goodwill impairment charge of $364 million related to a decline   in the company share price. We reported an operating loss from   continuing operations of $447 million, which included the   goodwill impairment and the other $37 million in one-time charges   previously noted. Excluding these items, we reported an adjusted   operating loss of $46 million compared to operating earnings of   $1.5 million last year. Our effective tax rate for the quarter was 8.8% due to the   partial deductibility of the impairment charge. Excluding the   effect of the impairment and other charges, our effective tax   rate was 39.4%, which was impacted by certain discrete items   recorded in the quarter and the mix o   f earnings    across the jurisdictions in which we operate. Second quarter adjusted loss per diluted share, excluding the   impact of asset impairment charges and other items was $0.32   compared to $0.10 in the prior year period. We ended the quarter   with $707 million of total cash and liquidity, comprised of $424   million in cash and $283 million in net availability under our   revolving line of credit, which is an increase of $20 million   from the prior year. We ended the quarter with long-term debt of $419.1 million   versus $819.2 million at the end of the second quarter of 2018.   And as we continue to execute against our objective to   significantly improve inventory management, we ended the quarter   with inventory of $949 million, a 16% decline from the second   quarter last year, significantly improving inventory management   and in particular, increasing our inventory turns is a major   initiative and we believe it provides an opportunity to   materially improve the already strong cash flow of our   business. From a capital allocation perspective, during the quarter, we   had $23 million of capital expenditures, bringing the   year-to-date total to $41 million. We are projecting our   full-year capital expenditures to be between $90 million and $95   million, reflecting a reduction to our historical CapEx   levels. Additionally, we repurchased $62.4 million or 12 million   shares through our modified Dutch auction. We also reduced   outstanding debt by $51 million, bringing the year-to-date total   reduction in debt to $404 million. We remain committed to   returning excess capital to shareholders when appropriate, and   have approximately $237 million remaining under the existing   share repurchase authorization. We will be balanced in our approach as we consider additional   share repurchases, debt reductions, and responsibly investing in   the business. With the second quarter behind us and results that   admittedly were below what we would want, particularly on the top   line, I want to share with you how we are approaching the   remainder of fiscal 2019. As you know, the video game business is cyclical and generally   driven by the launch of consoles as well as some seasonality,   given the historically strong title launches that for the most   part occur in the second half of the year in the holiday season.   We are approaching the end of the current console cycle with   next-generation consoles slated to be available in late 2020. And   as such, we expect our year-over-year sales to be down over the   next three quarters or four quarters, reflecting the end of that   cycle. Compounding this negative impact on sales is the fact that   console makers have confirmed to launch earlier than they have in   the past. We anticipate that this will lead to much lighter title   slate through the rest of 2019 and early 2020, given the end of   the cycle timing for the current consoles. As a result, at this   time, we expect a percentage decline of comparable same-store   sales for 2019 to be in the low-teens, which includes a difficult   comparable sales challenge from last year as we are up against   blockbuster titles like Red Dead Redemption 2, 2018's number one   volume title, without a comparable launch in 2019. While we expect the current top line trend to continue through   the first half of 2020, we remain focused on the strategic   initiatives George outlined, which we believe will position us   for long-term profit and cash flow expansion. As a result, our   results over the coming few quarters will not be sales-driven,   but we believe will reflect the strengthening of our core   business with expanding margins, disciplined expense management   and capital expenditures, and finally, strong and growing free   cash flow. In that light, we expect the overall annualized run   rate of our profit improvement initiatives to be over $200   million in 2021, as we execute on them throughout the rest of   2019 and through 2020. An important evolution for any retailer is the optimization of   its portfolio. We are no different. After years of growth, both   organic and inorganic, we maintain a very profitable store base   with over 95% of our more than 5,700 worldwide stores posting   four-wall positive EBITDA. While that is an impressive statistic,   we have a clear opportunity to improve our overall profitability   by de-densifying our chain. That work is well under way. We are on track to close between 180 underperforming stores   and 200 underperforming stores globally by the end of this fiscal   year. And while these closures were more opportunistic, we are   applying a more definitive analytic approach, including profit   levels and sales transferability that we expect will yield a much   larger tranche of closures over the coming 12 months to 24   months. We believe these actions will significantly add to our   profit improvement run rate with little to no cash expense, as   our average lease life is approximately two years. In addition to optimizing our store portfolio, we are   continuing to evaluate strategic and operational alternatives for   certain unprofitable operating subsidiaries or business units,   primarily within our international segments. We will provide more   information on that work in the future. Historically, there is a fair amount of seasonality in our   business and our working capital throughout any fiscal year. In   that light, after adjusting for the timing of certain invoice   payments related to holiday 2018 inventory that were paid after   the end of the fiscal year last year, we expect our adjusted free   cash flow for fiscal 2019 to be in the $225 million to $250   million range. Finally, given my earlier comments related to our sales   outlook for both the industry and our business, we expect   adjusted diluted earnings per share for fiscal 2019 to be in the   $1.15 to $1.30 range. In closing, I will reiterate that we fully expect sales across   the industry and in our business to be relatively soft for the   coming few quarters. However, we are not willing to relinquish   our market share leadership in the space, which is driven by our   unique positioning. We are not a transactional retailer, but in   fact, the only aggregator of the best and exclusive new and   pre-owned video game products, compelling digital content,   including access to eSports media and the leading industry   publication in Game Informer and the largest group of foremost   gaming experts, our store associates, all of which serve one of   the largest and most engaged customer databases in retail today.   We look forward to keeping you updated as we progress against our   strategic initiatives over the coming few quarters. And with that, I will turn it over to the operator to open the   line to any questions that you may have. Questions and Answers:  Operator  Thank you. [Operator Instructions] We will now take our first   question from Steph Wissink of Jefferies. Please go ahead.  Stephanie Wissink    --   Jefferies -- Analyst  Good afternoon [Phonetic], everyone. I mean, I want to focus   on three areas if we can. George, my first question is for you is   on initiative number four, transforming your vendor partnerships.   I'm wondering if you can talk a little bit about some of the   incremental or additional high-margin revenue streams that you   see in that specific agenda item? Can you just give us a sneak   peek at some of those things that you might be looking at? And then my second question is you spotlighted collectibles as   one of the areas of outperformance. I think you mentioned 14   quarters or 15 quarters of double-digit comp growth. Can you talk   a little bit more about how that range of products has evolved,   how the ThinkGeek business has evolved? How you're thinking about   collectibles as a core driver under some of the new initiatives   that you described at the beginning of the call? Thank you.  George Sherman    --   Chief Executive Officer  Yeah. Thanks, Steph. I think starting off with your question   on the transforming vendor partner relationships as that covers a   very broad spectrum, I think first and foremost, we never really   have truly negotiated as a global company, and that's certainly   part of our focus going forward. We're looking at the full   spectrum of opportunities with our partners. I think that   includes new revenue streams, and I think that includes things   like digital exclusives, physical exclusives just as we've done   in the past. When we talk about high-margin categories, we are referring to   other categories as well like private label. We find on a global   basis that the US private label penetration is lower than our   other operating businesses. And that there's an opportunity there   to go ahead and drive more of that, and we certainly look at   categories that we think that we've been missing for a while like   PC gaming. Kind of transitioning into collectibles, clearly, that's a   high-margin category for us as well. It's been successful. I   think there's been a level of trial and error along the way with   collectibles because it was new to us. I'd say that our view as   to where success lies in collectibles has become much more   focused and we're able to kind of hone in, in those areas. So   it's one that we intend to grow. It's one that we see continued   double-digit growth ahead. It's one that we see as a means of   attracting new customers in the gaming, which is very, very   important for our vendor partners is bringing new folks into   gaming for the first time as very often collectibles customers   are not necessarily core gamers.  Stephanie Wissink    --   Jefferies -- Analyst  Thank you.  George Sherman    --   Chief Executive Officer  Thank you. Good luck tomorrow with your trading day for the   Bahamas by the way. Thanks.  Stephanie Wissink    --   Jefferies -- Analyst  Thank you.  Operator  Our next question comes from Joe Feldman of Telsey Advisory   Group. Please go ahead.  Joe Feldman    --   Telsey Advisory Group -- Analyst  Yeah. Hi, guys. I wanted to understand that -- you made a   comment about digital subscription model for games. Can you give   a little more color on that, and like kind of what you're   thinking on that front?  George Sherman    --   Chief Executive Officer  Joe, I don't recall the comment on digital subscription. It's   clearly something that some of our partners are getting into. And   as we collaborate with them, it's important to them, it's   important to us and we certainly see the sale of digital   subscriptions as part of our future on their behalf, but no more   specifics in that right now.  Joe Feldman    --   Telsey Advisory Group -- Analyst  Got it. All right. Sorry, I may have misheard it. I thought I   heard subscription associated with digital. So, I apologize on   that. With regard to the collectibles growth that you guys have   had over the past few years, it's just been great. But how much   of it is an increasing penetration of collectibles whether in the   store, or just adding more SKUs versus driving incremental demand   in that category?  George Sherman    --   Chief Executive Officer  Yeah. It's actually more about incremental demand. I mean, in   fact, we're thinking about, as we go forward, George talked about   SKU rationalization. This is an area that we have an opportunity   to be more efficient and effective with the inventory within   collectibles. So if we think about the SKU base across that, it's   more about rationalizing the numbers of SKUs and letting those   that are highly productive continue to be highly productive and   penetrate from a demand perspective.  Joe Feldman    --   Telsey Advisory Group -- Analyst  Got it. Thanks. And then if I could just sneak maybe one more   in. You talked about being more formulaic about the approach to   store closures in the future. Can you share a little more thought   on, like, do you guys have a number in mind? Or do you have a   rough estimate of what you think you might need to close? Or is   it still little early for that?  George Sherman    --   Chief Executive Officer  I think we're rapidly developing a point of view on that and   we haven't disclosed that. And we will share more with you in the   future. But suffice it to say, we are taking a very specific   approach that looks at, if you think about this business over   multiple years, the inorganic or acquisition growth of this   business created opportunities in certain markets where we have   quite a dense footprint and where we have stores with -- in   overlapping trade areas or that are overlapping within a trade   area. That de-densification gives us the opportunity for   transferability, regardless of whether or not we are loss making,   one of those two stores, for example, might be loss making. And   so that's really how we're approaching it. That's the analytic   that we're applying. That's why we think about it not as a binary   function of loss-making stores versus non-loss making stores. But   more importantly, in total, as we rationalize the chain, how can   it fully be accretive to -- for bottom line performance.  Joe Feldman    --   Telsey Advisory Group -- Analyst  Yeah. That makes a lot of sense. Thanks for sharing that. I'll   see you. Thank you.  George Sherman    --   Chief Executive Officer  Thanks a lot, Joe.  Operator  [Operator Instructions] Our next question comes to us from Ben   Schachter of Macquarie. Please go ahead.  Ben Schachter    --   Macquarie Group -- Analyst  Yeah. Can we talk about, at a high-level, the shift to   digital, and then kind of how it impacts your business? So a few   questions on that. One, when you think about the next cycle, what   percentage of total game do you think are going to be sold   physically versus digital and what your share might look like in   that? Two, how do you expect to participate in digital? How will   that evolve for you guys versus what it is today? And then three, around the used business, what does that look   like as we move more to digital? And then somewhat separately,   you talked about the social cultural hub. I think it's an   interesting thought there. And can you talk about how eSports   might play into that and how you might use the store footprint to   participate there? Thanks.  George Sherman    --   Chief Executive Officer  Yeah. Thanks, Ben. Let me start off with the question around   the next cycle and the -- it's a mix between physical and digital   games. Our assumption is that, they'll launch in both formats   with the new cycle just as they do now. And our assumption is   that we'll have a piece of both businesses. Obviously, we have a   very, very significant share when it comes to physical games.   Physical games are still a significant portion of the overall   gaming industry today. And as we have noted in our -- in the   script, we attached at a significantly higher level on digital   gaming than most of the competitive set. We want to make it easier. We want to make it more so. I think   it's fair to say that, historically, we probably had a preference   for physical games versus digital games. And we've been clear to   say both internally and externally that we're going to be   agnostic. And it has to be the customer's choice as to which   manner we sell. So, we will focus on making the digital sales   process easier, more streamlined, more embedded, and we'll push   to make sure that we have that approach. If you think of a   try-before-you-buy type scenario as one of the tests that we   talked about in Tulsa, it's that customers' choice as to which   manner they want to buy a game, physical or digital. Yeah. As for pre-owned, we think pre-owned is following very   similar trends as new physical games are right now. While the   category is down, there is no debate about that. It is following   the same pattern as we see on the new gaming side of the   business. Meaning specifically, that our sales around the Switch   are our best performers within pre-owned games and that the other   two versions are feeling more of the sales pinch right now. We   would expect that to continue by the way in the new gaming   cycle. I think when you think of the new consoles, there are a couple   of things that are pretty significant. One is, backward   compatibility. The other is the fact that, both new devices will   have a disk drive on them. So certainly, I think when that   becomes widely understood that we'll see a bit of a -- another   bite to the apple in terms of pre-owned gaming as that will be   certainly alive and well for years to come.  Ben Schachter    --   Macquarie Group -- Analyst  Any thoughts on eSports and how that's going to impact the   social cultural hub initiative?  James Bell    --   Executive Vice President and Chief Financial Officer  Yeah. eSports is something that we've got involved with. We   have a partnership with Complexity Gaming. And in fact, we have   the naming rights for their training center here in Dallas. We   also have a partnership with team Envy. So we moved closer and   closer. We think that it will be a valuable, first of all,   content. So the ability to get content from these facilities,   from these teams that we can share with our best customers, that   we can share with our in-store gamers. And I mean, certainly, I think we've looked down the road and   if there is significant gaming activity in stores, there's a   stream-up capability as well. So, we certainly see an opportunity   to partner and have the -- our version of the little league's   going on in stores or the minor league's going on in stores that   could over time lead to a connection with those professional   sports businesses.  Operator  Our next question comes from Ray Stochel of Consumer Edge   Research. Please go ahead.  Ray Stochel    --   Consumer Edge Research -- Analyst  Great. Thanks for taking my question. You guys had mentioned   that you looked at a bunch of data with your stakeholders. Do you   guys have a broad sense of some KPIs? So, what I'd be looking for   would be lifetime value, but other KPIs would be helpful as well   of your customers versus the lifetime value or other KPIs of   customers acquired from Walmart, Target, Amazon or Best Buy,   especially for Sony and Microsoft? And then my follow-up question to that would be more on store   count. Has there been a change in the economics of reverse   cannibalization or recapture now with e-commerce? And is your new   e-commerce site positioned more effectively to recapture   consumers, whether that be the new -- the consumer purchasing new   or the consumer purchasing pre-owned? Thanks.  George Sherman    --   Chief Executive Officer  Yeah. Thanks Ray. I think on the first question, as it applies   to the data that we -- in our understanding of our customer base,   we've done more and more assuring of that with our vendor   partners than -- and it's been mutual. So, I think certainly   that's one of our competitive advantages, is that it's a pretty   well known fact among our partner community that we over indexed   with customers. We have a higher digital attach rate, customers who buy   physical games for us buy more games overall, customers who buy   from us buy more accessories overall. So in virtually every   category of the business, whether it be digital, physical games   or accessories, you see a higher attachment rate at a GameStop   store, no question about it. So, that is certainly something that   we are proud of and certainly data that we share. And again, as   it applies to lifetime value, we have more of a cross exchange   going out with our vendor partners than we probably have in the   past. Yeah, on the website, I think, couple of things jump to mind.   First and foremost, among the new capabilities is buy online,   pickup in store. It is a very common in retail, obviously, and I   see it was a bit of a disadvantage for us. You could hold online,   buy in store, but not buy online, pickup in store. We think that   will be a significant growth category for us going forward. We   also have what we think is pretty unique, is the ship to home   capability at every store in our fleet. So, when you talk about supply, it's not just two distribution   centers, it's virtually every store in our company can service as   one as well and get product quickly to a customer. Shopability is   better, ease of navigation. It was a bit cumbersome to buy, for   instances, softlines in our prior site. It was clunky when it   came to buying by size, that's now been fixed and this community   aspect of it as well that we think is pretty different.  Ray Stochel    --   Consumer Edge Research -- Analyst  Great. Thanks, again.  George Sherman    --   Chief Executive Officer  Thanks.  Operator  [Operator Instructions] Our next question comes from Seth   Sigman of Credit Suisse. Please go ahead.  Lavesh Hemnani    --   Credit Suisse -- Analyst  Hi. This is Lavesh Hemnani on for Seth. Thanks for taking our   questions. So firstly, to start off with the pre-owned business,   I think last quarter you spoke of some changes in the business   stream that you were looking at testing some models to enhance   the value proposition. I mean, could you give us some results of   the test and frame the magnitude of the margin reset that you may   see like in 2H and beyond?  George Sherman    --   Chief Executive Officer  Yeah. We've had a couple of tests that we are not quite ready   to speak the results on, and this applies to both pre-owned as   well as to our loyalty customer base and the new PowerUp offer.   So they are early on. We're seeing some initial good success. I   will say that the biggest change that we have made that's now   done is it applies to pre-own gaming, is to unify the gaming   business under our single merchant. So in the past, it's been   fragmented across the pre-owned merchant, a new game merchant and   now we own the business across the spectrum including pricing   optimization. So, that's been the biggest change that's done.   There's a couple of things that are, I'd say, just too early for   us to comment on.  Lavesh Hemnani    --   Credit Suisse -- Analyst  Got it. So, just a follow-up on the cost initiatives. So   regarding the profit improvement plan that you guys highlighted,   how do we think about the timeline? When should it start showing   up? I mean, are we still supposed see some sort of benefit in the   back half or like toward the end of 4Q and then we see the   ramping up through [Phonetic] the next year?  George Sherman    --   Chief Executive Officer  Yeah. Our initiative -- our profit initiative is, you can   think of almost effectively as a 50-50 split between cost   reduction and areas like margin improvement. Obviously, the cost   reduction is going to happen faster. And as Jim mentioned in his   comments, most of what we did here recently happened at the late   portion or subsequent to the end of Q2. So, it's all very new,   but it is now in effect. We think of that, call it $100 million   of cost reduction opportunity has been roughly 40% complete now.   And that's a combination of structural changes that we made, as   well as some indirect procurement initiatives that have taken   hold. So, that gives us a level of confidence again to commit to   a $200 million number because we made very, very good progress on   one of the key tracks to get there.  Lavesh Hemnani    --   Credit Suisse -- Analyst  Got it. And just if I can just squeeze one more and really   quickly here. So regarding some of the initiatives within the   store, you guys spoke about rationalizing the collectibles   assortment within the store. I mean apart from that, are there   any other store resets that you are working on and that you could   elaborate on?  George Sherman    --   Chief Executive Officer  Yeah. I'd say generally speaking, we mentioned that we are a   week away from a reset in the store. And that's not the end   product. It's a step in the right direction. It's what the team   did a remarkable job on with about six weeks to get things done.   So, you're going to see some SKU reduction. You're going to see,   I'd say better pairing by ecosystem, meaning when you look at the   assortment within the Sony, Nintendo and Microsoft world that are   more logical, there's more accessories pulled in together,   there's a bit more private label, there's a bit more attach areas   that are part of it. And it's a bit cleaner on the collectibles   side of the business as well. And as I mentioned to Steph on her comments, we would be much   more focused in terms of where we know collectibles works. And   there are categories. We have a remarkable relationship with   Funko and we've been enormously successful with the pops   business. It's a big part of our collectibles for us. So, I think   you're going to see a step in the right direction, but it's not   in any -- in respect to finished product. It's the best effort in   a very short period of time.  Lavesh Hemnani    --   Credit Suisse -- Analyst  Got it. Thank you so much.  Operator  That's all the time we have for questions. At this time, I   will turn the conference back to George Sherman for any   additional or closing remarks. Please go ahead.  George Sherman    --   Chief Executive Officer  Yeah. Thank you. And thanks to everyone for joining us today   on our call. We appreciate your interest in GameStop as always. I   have to say, coming off of our preholiday store leadership   conference in Nashville just a couple of weeks ago, I want to   give a shout out to our store teams, in particular, our store   managers, and really the entire team overall. I mean it's a   wildly enthusiastic group. It's obvious that they are ready to   execute under new direction. They are passionate about moving us   forward as quickly as possible, and we have a great team that's   ready to win. I want to thank them for their hard work ahead of   the important holiday season. Thank you all.  Operator  [Operator Closing Remarks]  Duration: 49 minutes  Call participants:  Unidentified Speaker   George Sherman    --   Chief Executive Officer   James Bell    --   Executive Vice President and Chief Financial Officer   Stephanie Wissink    --   Jefferies -- Analyst   Joe Feldman    --   Telsey Advisory Group -- Analyst   Ben Schachter    --   Macquarie Group -- Analyst   Ray Stochel    --   Consumer Edge Research -- Analyst   Lavesh Hemnani    --   Credit Suisse -- Analyst   More GME analysis   All earnings call transcripts        10 stocks we like better than GameStop     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and GameStop wasn't   one of them! That's right -- they think these 10 stocks   are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     owns shares of GameStop. The Motley Fool has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " GameStop Corp New    (NYSE: GME)        Q2 2019 Earnings Call       Sep 10, 2019 ,   5:00 p.m. ET ",
    " Unidentified Speaker ",
    "(Starts Abruptly) Thank you. And welcome to GameStop's Second   Quarter Fiscal 2019 Earnings and Conference Call.",
    "This conference call will include forward-looking statements,   which are subject to various risks and uncertainties that could   cause actual results to differ materially from expectations. Any   such statements should be considered in conjunction with the   cautionary statements and the safe harbor statement in the   earnings release and risk factors discussed in reports filed with   the SEC. GameStop assumes no obligation to update any of these   forward-looking statements or information. A reconciliation and   other information regarding non-GAAP financial measures discussed   on the call can be found in the earnings release issued earlier   today as well as the Investor Section of our website.",
    "With me today are GameStop's Chief Executive Officer, George   Sherman; and Chief Financial Officer, Jim Bell. On today's call,   George will not only discuss some highlights from our second   fiscal quarter, but also share specific details of GameStop's   strategic framework for the future. Jim will then provide more   detail on our financial results and some key expectations for the   remainder of the year and into 2020.",
    "Now, I would like to turn the call over to the company's Chief   Executive Officer, George Sherman.",
    " George Sherman    --   Chief Executive Officer ",
    "Thank you. Good afternoon, everyone, and thank you for joining   us today on our second quarter       earnings call    . As I mentioned in our last call, I, along with my new   management team, have been moving quickly to assess the business   and develop our strategy to reposition the organization for the   future.",
    "Following numerous meetings with stakeholders, from across   every aspect of our business, we have acquired valuable feedback   and data to further reform our direction and believe, we are   formulating the strategic framework and specific initiatives to   achieve our long-term growth and profit objectives.",
    "We are committed to taking quick and deliberate actions to   improve the performance of the company and set on the correct   strategic path, fully leveraging our unique position and brand in   the video game industry. I believe that during the call today,   you will hear that we are fully committed to that mission and are   acting with a sense of urgency to address the areas of the   business that are critical to achieving long-term success and   value creation.",
    "We recognize that there was a need to rebuild credibility with   the investment community and some of our stakeholders. We plan to   accomplish this by quickly establishing a track record of   delivering on our promises and executing plans for the business   that will support improved financial performance and fuel future   growth over the long-term. You're going to hear a similar message   from Jim Bell regarding clarity of financial metrics and an   appropriate level of transparency for how we hold ourselves   accountable in meeting our objectives.",
    "To that end, today we will outline a strategy that includes   both near-term and long-term measurable objectives, which we plan   to track our progress against each quarter. Let's get into the   details of that plan. Our strategic plan is anchored on four key   tenets. One, optimize core business by improving efficiency and   effectiveness in everything we do.",
    "Two, create a social and cultural hub of gaming within each   GameStop store and online. Three, build compelling digital   capabilities to reach our customers wherever they want to do   business and give them the full spectrum of content and access to   the products they are looking for. And four, transform our vendor   and partner relationships, unlocking additional high-margin   revenue streams and optimizing the lifetime value of every   customer.",
    "Let's take each of these one by one. First, we'll optimize the   core business by driving efficiency and effectiveness across   everything we do. There are several initiatives within this   pillar, but broadly speaking, they include overhead cost   restructuring, inventory management optimization, including   streamlining SKU accounts and pricing and promotion optimization,   and a full review of rationalization of the store footprint   across the globe.",
    "As I mentioned, we are moving with a sense of urgency and have   already demonstrated our commitment to doing so with our recent   efforts to rightsize the organization across our corporate   infrastructure and our US store leadership organization.",
    "Over the last couple of months, we implemented changes that   require us to make tough, but necessary decisions for the benefit   of our organization moving forward. These changes will drive   efficiencies and serve as a catalyst to rightsizing our cost   structure. That work is continuing, and we are further executing   other ways to optimize operational cost, including restructuring   or exiting unprofitable businesses or markets, and each and every   aspect of our indirect procurement activities.",
    "As we told you in June, we are exiting the Simply Mac business   and continue to work toward that divestiture in the near term. We   also embedded thinkgeek.com into the gamestop.com environment to   leverage that existing platform, further streamlining the   organization.",
    "As you may know, in June, we hired Chris Homeister as our   Chief Merchandising Officer. Chris has an extensive hardlines and   specifically consumable electronics retail background and has   already developed and implemented several initiatives to improve   the overall productivity of our stores and products.",
    "First, we are employing more effective merchandising   practices, including among other things, few rationalization,   which will declutter our stores and provide a better experience   to our customers. The first store set with this evolving strategy   begins next week.",
    "Second, we believe that through a more comprehensive pricing   architecture and end-to-end product and pricing life cycle   management, we can drive higher overall product margins. And   third, we are committed to adding and growing high-margin product   categories, which not only work to offset market-driven declines   and pre-owned software sales, but also add to our credibility   with customers as the only retail outlet for the aggregation of   all things video gaming and pop culture.",
    "For example, we see further opportunity in expanding our   double-digit growth collectibles category, creating more   exclusive packages with our vendors, expanding our PC gaming   offerings, and evolving our private label business by leveraging   our significant scale and retail expertise.",
    "Optimizing our store base for an increasingly digital world is   essential for the future and increasing profit productivity. We   have an expansive and profitable store base, with 95% of our   stores posting four-wall EBITDA positive results. However, we   know we have the opportunity to do even better and expand   profitability by de-densifying our store footprint in some   markets.",
    "We are committed to both closing loss-making locations, as   well as maximizing profit productivity from capturing sales and   profit transfer in stores with overlapping trade areas. We   believe that store de-densification will be materially accretive   to the overall business model, and remembering that our average   lease life is only two years, we can approach these strategic   decisions with limited, if any, cost implications.",
    "In total, we believe these operating profit improvement   initiatives will substantially exceed the previous management   team's initial $100 million target that was communicated earlier   in the year. We believe the total annualized run rate of our   profit improvement initiatives will be in excess of $200 million   for 2020 and beyond.",
    "Moving to the second pillar of our strategy, we are committed   to creating a social and cultural hub of gaming within each   GameStop store, online and within the digital environment. This   is especially important as the video game industry experiences   significant change from the evolving methods in which customers   are consuming video games to the more near-term disruption from   the current console cycle coming to an end. We are and have been   the leading expert in the industry for decades and have the   ability to leverage that position to create an experience that   ignites passion before, during and after each transaction.",
    "Not only are we the largest videos sales generator for our   hardware and software partners, we are also the video game   authority in countless neighborhoods around the globe. This is   what makes GameStop unique. There is no other brand better   position to be the aggregator of video game products and content,   including eSports and digital media, with the deep expertise of   our associates to gamers of all demographics worldwide.",
    "As part of this strategy, we have begun testing a series of   experiential offerings within the Tulsa, Oklahoma market. Think   of this approach as a live laboratory, which will help us define   and execute the optimum mix of high-margin immersive experiential   gaming content with our existing array of video games and   collectibles products. For example, we will try a   try-before-you-buy experience was up to 12 gaming days,   eSports-focused comparative gaming content delivery, a   collectibles-focused experience, all supporting physical and   digital video gaming accessories transactions.",
    "Of note, this is a very controlled and disciplined test that   fits well within our capital expense budget for fiscal 2019, and   any rollout from the test will not be implemented in every store   in the chain. It's still early, and we will share some of these   findings with you as we progress in the coming quarters.",
    "While we believe these tests along with our other initiatives   are necessary to define and add new high-growth and high-margin   revenue streams for our business, we remain committed to two   things. One, we are the leading omni-channel video game retailer   and will continue to be. And two, we do not intend to completely   remodel our chain of stores, but rather we expect the results of   these tests will yield a highly profitable store model that will   complement various key markets, further enhancing our already   strong customer engagement as well as evolving our product   offering and position within the gaming industry.",
    "Finally, an integral part of being in the social and cultural   hub of gaming is our customer engagement within our loyalty   program. We are exploring ways to expand the PowerUp Rewards   program by enhancing the program's value to our most active   shoppers, while simultaneously driving profitability. Most   importantly, we are redesigning our PowerUp Rewards program,   where among other things, we are testing various recurring   revenues subscription opportunities. Secondly, we are in the   final stages of rolling out a new and improved value proposition   for the paid PowerUp Pro tier which in early test is yielding   favorable results in enrollment and customer frequency.",
    "Finally, we've upgraded our customer database management tool   set based on the Salesforce marketing cloud platform. This   integration along with some new agency partnerships will enable a   more sophisticated propensity-driven marketing model at the   one-to-one level, thereby focused on growing customer lifetime   value and ROI.",
    "Our third strategic pillar is building a complete and   compelling set of digital capabilities. Digital is not only a   growing aspect of our industry, it's also a large part of who we   are. Today, we attach significantly more digital content to   in-store and online purchases than any other retailer, and we're   focused on evolving further as we build our best-in-class   omni-channel capabilities. Simply, we have to adapt to meet our   customers wherever they want to do business. We must and will be   channel-agnostic.",
    "The first component of delivering a best-in-class omni-channel   experience is the new gamestop.com platform that launched in   August. This new online experience delivers highly engaged and   fast online merchandising, new buy or hold and pick up in store   functionality and rich community content. With enhanced   functionality like Apple Pay and integrated PowerUp Rewards   enrollments and improved shopability, this relaunch marks an   important step toward our long-term goal of creating $1 billion   e-commerce business. It also provides our customers with the   omni-channel capabilities that they've come to expect.",
    "Our efforts won't end here. Instead, we are currently working   on various capabilities that we believe will add significant   value for our customers. Simply by leveraging existing assets, we   have the opportunity to enrich and monetize data available to us   and create digital exclusives. We recognize and are embracing   digital as an opportunity for GameStop, and we are committed to   supporting our vendor initiatives, both digitally and physically,   including initiatives such as developing capabilities that allow   for or enable a more streamlined embedded digital purchase   process.",
    "Finally, the fourth pillar in our strategy, we are in the   early stages of transforming our vendor and partner relationships   to better position us for the future of video gaming. When I   first spoke to you in June, I told you that I believe it was   important for GameStop to transform and evolve to remain a viable   player in our industry, which is undergoing meaningful   technological change. We are committed to doing that, but   recognize that this part of the strategy will take longer to   develop. The good news is two-fold.",
    "First, we are advancing very constructive discussions with our   partners and they recognize the value that we bring to them. And   second, both Microsoft and Sony recognize the market and   technology advancement will still require physical disks in the   next gaming console cycle.",
    "Our 50,000-plus knowledgeable associates worldwide serve as   the only full-time dedicated sales force in the video game   industry. And the results they drive are meaningful. We attach   significantly more games, content, digital media and related   pop-culture content than any retail outlet for both our hardware   and software partners and in most cases are their number one   volume sales outlets.",
    "Our associates bring an enormous amount of value to console   makers, given they are an integral part of their customer   acquisition model. Our partners are actively engaging with us to   evolve the model from a historical transactional model to one   that rewards us across the customer acquisition and lifetime   value spectrum, not simply transactions.",
    "As an organization, we are intensely focused on advancing each   of our four strategic tenets and we will continue to update you   on our progress against our goals in the months ahead. Some of   these opportunities will serve to benefit us sooner rather than   later, and some of these initiatives will take time to nurture   and cultivate over the long term. We will be disciplined with our   approach to innovation by focusing on our initiatives that will   benefit the core video game business and leverage our current   portfolio of assets, but not require significantly more capital   growth.",
    "In fact, we intend to maintain our historical annual capital   expenditure levels and redirect some of those funds toward these   initiatives. We are out of the diversification business. We will   test and learn before we deploy and our decision-making will be   driven by a disciplined approach to capital allocation. We will   not, under any circumstances bet the farm.",
    "As you can tell from my comments, I'm excited about the   opportunity in front of us. It's a tremendous challenge and will   require significant effort on our part, but we are well on our   way. Make no mistake, this transition will take time and our   sales expectations over the next several quarters will reflect   the end of console cycle and the next generation of console   launches by both Sony and Microsoft later for 2020.",
    "However, as you can see, our strategic framework is focused   not only on sales, but expanding our gross margin, reducing costs   and optimizing inventory management, all of which will lead to   continued growth of free cash flow of the business, both in the   near term and over the long-term.",
    "Before I turn the call over to Jim for our financial review of   the quarter and outlook for the remainder of the year, I want to   take a minute to address some of the misconceptions that I've   heard over my first few months. It's clear to me that market   sentiment regarding our core business is not fully reflective of   our intrinsic value. There are likely several things driving   that, many of which we are currently addressing. But what I do   know is that we have tremendous assets that have driven and can   continue to drive meaningful shareholder value and cash returns.   We believe those assets are being discounted by a market that is   focused solely on a short-term view and mistakes of prior   management, such as failed diversification investment   decisions.",
    "In our view, our current sales performance reflects the   natural end of console cycle that will rebound with console   launches later in 2020. However, while we believe strongly in the   value creation opportunity of our initiatives, this management   team is committed to being a good steward of capital and being   disciplined and highly strategic in terms of any potential   investments, as well as returning excess capital to shareholders.   We have a strong and improving balance sheet and cash flows, a   highly profitable store base, a very resilient brand that   operates from a position of strength in the industry.",
    "In closing, we have a tremendous chance to shape the future of   GameStop in this evolving and dynamic industry as the leading   provider of rich video gaming products, content and expertise   across all purchasing channels. Our team is committed to tackling   the challenges in front of us and we are confident that we are   positioning the business to deliver strong results, particularly   with the next console cycle on the horizon. As we evolve our   business model over that same timeframe, we'll be better equipped   to drive increased profitability when the industry cycle turns   and consoles launch in 2020.",
    "I'd now like to turn the call over to Jim for a recap of the   quarter and our outlook on key business metrics. Thank you.",
    " James Bell    --   Executive Vice President and Chief Financial Officer ",
    "Thank you, George, and good afternoon, everyone. It's great to   be with you here today. I, like George, was drawn to GameStop by   the enormous potential of this business. GameStop's strong brand   positioning and engagement with the large passionate customer   base has the leading authority in all things video games, along   with the opportunity to be part of a leadership team, driving   innovation and transformation, make this an exciting and pivotal   time to be at GameStop.",
    "My initial observations are very much aligned with George's   and the other members of our senior leadership team. We have   quickly joined forces to take definitive actions on things that   needed to be done, such as exiting unprofitable businesses,   rightsizing our cost structure, applying deep retail expertise to   elevate the overall efficacy of our operations and setting the   stage for developing new revenue streams for the future of the   business, particularly as the video game industry continues to   evolve.",
    "However, as George shared, we are not done and have a lot of   work in front of us. But we are acting with a sense of urgency,   making tough but necessary decisions and moving forward with the   disciplined approach to deploying these strategies, which we   believe will position GameStop to maximize shareholder value.",
    "We are committed to providing you as much transparency as   possible and updating you as we progress through the   transformation of the business, which is specifically intended to   restore credibility among the investment community.",
    "Now, I would like to shift to a recap of the second quarter   results. From the top line perspective, total sales declined   $215.4 million, or 14.3% as compared to the second quarter of   2018. The sales decline was comprised of an 11.6% comparable   store sales decline, a 130 basis points related to 195 store   closures since the second quarter last year and 140 basis points   of negative foreign exchange impact.",
    "While not up to our expectations, these results are generally   in line with declines across the video game industry and   indicative of sales volumes at this point in the console cycle.   As such, the primary driver of the sales decline was new hardware   sales, which was down 41% year-over-year.",
    "However, as you know, we are focused on growing other product   lines that are important to our gamer community. Our collectibles   business is a great example. It continues to positively expand,   posting a 21% year-over-year increase in the second quarter,   exceeding our expectations and marking the 15th consecutive   quarter of growth with 14 out of the 15 in double digits.",
    "Software sales declined 5.3% with declines across most   categories, slightly offset by growth in Nintendo Switch software   and the release of the current year title in the Madden NFL   franchise toward the end of the quarter. In line with the current   stage of the console cycle, our pre-owned video game business was   down 17.5%, with consistent declines across both hardware and   software. It is worth noting that within pre-owned hardware, we   continue to see strong demand for the Nintendo Switch, but a   solid sales increase on this platform was more than offset by   declines in the other consoles as we await next generation   launches later in 2020.",
    "Overall, gross margins declined by 30 basis points to 31%,   primarily driven by markdown activity related to the wind down of   our thinkgeek.com business. Excluding the effects of this   transition, overall margins for the quarter would have been   31.4%, reflecting a 10 basis point expansion.",
    "As reported, SG&A for the second quarter was $459 million,   compared to $442 million a year ago. The increase was driven by   $37 million in one-time transformation, severance, and other   charges associated with our GameStop Reboot profit improvement   initiatives. After adjusting for these one-time charges, SG&A   expenses declined by $19.2 million or 4.3%, reflecting just the   beginning of the impact of our organizational changes as we   implemented them late in or subsequent in the quarter.",
    "During the quarter, we incurred a non-cash, non-operating   goodwill impairment charge of $364 million related to a decline   in the company share price. We reported an operating loss from   continuing operations of $447 million, which included the   goodwill impairment and the other $37 million in one-time charges   previously noted. Excluding these items, we reported an adjusted   operating loss of $46 million compared to operating earnings of   $1.5 million last year.",
    "Our effective tax rate for the quarter was 8.8% due to the   partial deductibility of the impairment charge. Excluding the   effect of the impairment and other charges, our effective tax   rate was 39.4%, which was impacted by certain discrete items   recorded in the quarter and the mix o   f earnings    across the jurisdictions in which we operate.",
    "Second quarter adjusted loss per diluted share, excluding the   impact of asset impairment charges and other items was $0.32   compared to $0.10 in the prior year period. We ended the quarter   with $707 million of total cash and liquidity, comprised of $424   million in cash and $283 million in net availability under our   revolving line of credit, which is an increase of $20 million   from the prior year.",
    "We ended the quarter with long-term debt of $419.1 million   versus $819.2 million at the end of the second quarter of 2018.   And as we continue to execute against our objective to   significantly improve inventory management, we ended the quarter   with inventory of $949 million, a 16% decline from the second   quarter last year, significantly improving inventory management   and in particular, increasing our inventory turns is a major   initiative and we believe it provides an opportunity to   materially improve the already strong cash flow of our   business.",
    "From a capital allocation perspective, during the quarter, we   had $23 million of capital expenditures, bringing the   year-to-date total to $41 million. We are projecting our   full-year capital expenditures to be between $90 million and $95   million, reflecting a reduction to our historical CapEx   levels.",
    "Additionally, we repurchased $62.4 million or 12 million   shares through our modified Dutch auction. We also reduced   outstanding debt by $51 million, bringing the year-to-date total   reduction in debt to $404 million. We remain committed to   returning excess capital to shareholders when appropriate, and   have approximately $237 million remaining under the existing   share repurchase authorization.",
    "We will be balanced in our approach as we consider additional   share repurchases, debt reductions, and responsibly investing in   the business. With the second quarter behind us and results that   admittedly were below what we would want, particularly on the top   line, I want to share with you how we are approaching the   remainder of fiscal 2019.",
    "As you know, the video game business is cyclical and generally   driven by the launch of consoles as well as some seasonality,   given the historically strong title launches that for the most   part occur in the second half of the year in the holiday season.   We are approaching the end of the current console cycle with   next-generation consoles slated to be available in late 2020. And   as such, we expect our year-over-year sales to be down over the   next three quarters or four quarters, reflecting the end of that   cycle.",
    "Compounding this negative impact on sales is the fact that   console makers have confirmed to launch earlier than they have in   the past. We anticipate that this will lead to much lighter title   slate through the rest of 2019 and early 2020, given the end of   the cycle timing for the current consoles. As a result, at this   time, we expect a percentage decline of comparable same-store   sales for 2019 to be in the low-teens, which includes a difficult   comparable sales challenge from last year as we are up against   blockbuster titles like Red Dead Redemption 2, 2018's number one   volume title, without a comparable launch in 2019.",
    "While we expect the current top line trend to continue through   the first half of 2020, we remain focused on the strategic   initiatives George outlined, which we believe will position us   for long-term profit and cash flow expansion. As a result, our   results over the coming few quarters will not be sales-driven,   but we believe will reflect the strengthening of our core   business with expanding margins, disciplined expense management   and capital expenditures, and finally, strong and growing free   cash flow. In that light, we expect the overall annualized run   rate of our profit improvement initiatives to be over $200   million in 2021, as we execute on them throughout the rest of   2019 and through 2020.",
    "An important evolution for any retailer is the optimization of   its portfolio. We are no different. After years of growth, both   organic and inorganic, we maintain a very profitable store base   with over 95% of our more than 5,700 worldwide stores posting   four-wall positive EBITDA. While that is an impressive statistic,   we have a clear opportunity to improve our overall profitability   by de-densifying our chain. That work is well under way.",
    "We are on track to close between 180 underperforming stores   and 200 underperforming stores globally by the end of this fiscal   year. And while these closures were more opportunistic, we are   applying a more definitive analytic approach, including profit   levels and sales transferability that we expect will yield a much   larger tranche of closures over the coming 12 months to 24   months. We believe these actions will significantly add to our   profit improvement run rate with little to no cash expense, as   our average lease life is approximately two years.",
    "In addition to optimizing our store portfolio, we are   continuing to evaluate strategic and operational alternatives for   certain unprofitable operating subsidiaries or business units,   primarily within our international segments. We will provide more   information on that work in the future.",
    "Historically, there is a fair amount of seasonality in our   business and our working capital throughout any fiscal year. In   that light, after adjusting for the timing of certain invoice   payments related to holiday 2018 inventory that were paid after   the end of the fiscal year last year, we expect our adjusted free   cash flow for fiscal 2019 to be in the $225 million to $250   million range.",
    "Finally, given my earlier comments related to our sales   outlook for both the industry and our business, we expect   adjusted diluted earnings per share for fiscal 2019 to be in the   $1.15 to $1.30 range.",
    "In closing, I will reiterate that we fully expect sales across   the industry and in our business to be relatively soft for the   coming few quarters. However, we are not willing to relinquish   our market share leadership in the space, which is driven by our   unique positioning. We are not a transactional retailer, but in   fact, the only aggregator of the best and exclusive new and   pre-owned video game products, compelling digital content,   including access to eSports media and the leading industry   publication in Game Informer and the largest group of foremost   gaming experts, our store associates, all of which serve one of   the largest and most engaged customer databases in retail today.   We look forward to keeping you updated as we progress against our   strategic initiatives over the coming few quarters.",
    "And with that, I will turn it over to the operator to open the   line to any questions that you may have.",
    " Operator ",
    "Thank you. [Operator Instructions] We will now take our first   question from Steph Wissink of Jefferies. Please go ahead.",
    " Stephanie Wissink    --   Jefferies -- Analyst ",
    "Good afternoon [Phonetic], everyone. I mean, I want to focus   on three areas if we can. George, my first question is for you is   on initiative number four, transforming your vendor partnerships.   I'm wondering if you can talk a little bit about some of the   incremental or additional high-margin revenue streams that you   see in that specific agenda item? Can you just give us a sneak   peek at some of those things that you might be looking at?",
    "And then my second question is you spotlighted collectibles as   one of the areas of outperformance. I think you mentioned 14   quarters or 15 quarters of double-digit comp growth. Can you talk   a little bit more about how that range of products has evolved,   how the ThinkGeek business has evolved? How you're thinking about   collectibles as a core driver under some of the new initiatives   that you described at the beginning of the call? Thank you.",
    " George Sherman    --   Chief Executive Officer ",
    "Yeah. Thanks, Steph. I think starting off with your question   on the transforming vendor partner relationships as that covers a   very broad spectrum, I think first and foremost, we never really   have truly negotiated as a global company, and that's certainly   part of our focus going forward. We're looking at the full   spectrum of opportunities with our partners. I think that   includes new revenue streams, and I think that includes things   like digital exclusives, physical exclusives just as we've done   in the past.",
    "When we talk about high-margin categories, we are referring to   other categories as well like private label. We find on a global   basis that the US private label penetration is lower than our   other operating businesses. And that there's an opportunity there   to go ahead and drive more of that, and we certainly look at   categories that we think that we've been missing for a while like   PC gaming.",
    "Kind of transitioning into collectibles, clearly, that's a   high-margin category for us as well. It's been successful. I   think there's been a level of trial and error along the way with   collectibles because it was new to us. I'd say that our view as   to where success lies in collectibles has become much more   focused and we're able to kind of hone in, in those areas. So   it's one that we intend to grow. It's one that we see continued   double-digit growth ahead. It's one that we see as a means of   attracting new customers in the gaming, which is very, very   important for our vendor partners is bringing new folks into   gaming for the first time as very often collectibles customers   are not necessarily core gamers.",
    " Stephanie Wissink    --   Jefferies -- Analyst ",
    "Thank you.",
    " George Sherman    --   Chief Executive Officer ",
    "Thank you. Good luck tomorrow with your trading day for the   Bahamas by the way. Thanks.",
    " Stephanie Wissink    --   Jefferies -- Analyst ",
    "Thank you.",
    " Operator ",
    "Our next question comes from Joe Feldman of Telsey Advisory   Group. Please go ahead.",
    " Joe Feldman    --   Telsey Advisory Group -- Analyst ",
    "Yeah. Hi, guys. I wanted to understand that -- you made a   comment about digital subscription model for games. Can you give   a little more color on that, and like kind of what you're   thinking on that front?",
    " George Sherman    --   Chief Executive Officer ",
    "Joe, I don't recall the comment on digital subscription. It's   clearly something that some of our partners are getting into. And   as we collaborate with them, it's important to them, it's   important to us and we certainly see the sale of digital   subscriptions as part of our future on their behalf, but no more   specifics in that right now.",
    " Joe Feldman    --   Telsey Advisory Group -- Analyst ",
    "Got it. All right. Sorry, I may have misheard it. I thought I   heard subscription associated with digital. So, I apologize on   that. With regard to the collectibles growth that you guys have   had over the past few years, it's just been great. But how much   of it is an increasing penetration of collectibles whether in the   store, or just adding more SKUs versus driving incremental demand   in that category?",
    " George Sherman    --   Chief Executive Officer ",
    "Yeah. It's actually more about incremental demand. I mean, in   fact, we're thinking about, as we go forward, George talked about   SKU rationalization. This is an area that we have an opportunity   to be more efficient and effective with the inventory within   collectibles. So if we think about the SKU base across that, it's   more about rationalizing the numbers of SKUs and letting those   that are highly productive continue to be highly productive and   penetrate from a demand perspective.",
    " Joe Feldman    --   Telsey Advisory Group -- Analyst ",
    "Got it. Thanks. And then if I could just sneak maybe one more   in. You talked about being more formulaic about the approach to   store closures in the future. Can you share a little more thought   on, like, do you guys have a number in mind? Or do you have a   rough estimate of what you think you might need to close? Or is   it still little early for that?",
    " George Sherman    --   Chief Executive Officer ",
    "I think we're rapidly developing a point of view on that and   we haven't disclosed that. And we will share more with you in the   future. But suffice it to say, we are taking a very specific   approach that looks at, if you think about this business over   multiple years, the inorganic or acquisition growth of this   business created opportunities in certain markets where we have   quite a dense footprint and where we have stores with -- in   overlapping trade areas or that are overlapping within a trade   area. That de-densification gives us the opportunity for   transferability, regardless of whether or not we are loss making,   one of those two stores, for example, might be loss making. And   so that's really how we're approaching it. That's the analytic   that we're applying. That's why we think about it not as a binary   function of loss-making stores versus non-loss making stores. But   more importantly, in total, as we rationalize the chain, how can   it fully be accretive to -- for bottom line performance.",
    " Joe Feldman    --   Telsey Advisory Group -- Analyst ",
    "Yeah. That makes a lot of sense. Thanks for sharing that. I'll   see you. Thank you.",
    " George Sherman    --   Chief Executive Officer ",
    "Thanks a lot, Joe.",
    " Operator ",
    "[Operator Instructions] Our next question comes to us from Ben   Schachter of Macquarie. Please go ahead.",
    " Ben Schachter    --   Macquarie Group -- Analyst ",
    "Yeah. Can we talk about, at a high-level, the shift to   digital, and then kind of how it impacts your business? So a few   questions on that. One, when you think about the next cycle, what   percentage of total game do you think are going to be sold   physically versus digital and what your share might look like in   that? Two, how do you expect to participate in digital? How will   that evolve for you guys versus what it is today?",
    "And then three, around the used business, what does that look   like as we move more to digital? And then somewhat separately,   you talked about the social cultural hub. I think it's an   interesting thought there. And can you talk about how eSports   might play into that and how you might use the store footprint to   participate there? Thanks.",
    " George Sherman    --   Chief Executive Officer ",
    "Yeah. Thanks, Ben. Let me start off with the question around   the next cycle and the -- it's a mix between physical and digital   games. Our assumption is that, they'll launch in both formats   with the new cycle just as they do now. And our assumption is   that we'll have a piece of both businesses. Obviously, we have a   very, very significant share when it comes to physical games.   Physical games are still a significant portion of the overall   gaming industry today. And as we have noted in our -- in the   script, we attached at a significantly higher level on digital   gaming than most of the competitive set.",
    "We want to make it easier. We want to make it more so. I think   it's fair to say that, historically, we probably had a preference   for physical games versus digital games. And we've been clear to   say both internally and externally that we're going to be   agnostic. And it has to be the customer's choice as to which   manner we sell. So, we will focus on making the digital sales   process easier, more streamlined, more embedded, and we'll push   to make sure that we have that approach. If you think of a   try-before-you-buy type scenario as one of the tests that we   talked about in Tulsa, it's that customers' choice as to which   manner they want to buy a game, physical or digital.",
    "Yeah. As for pre-owned, we think pre-owned is following very   similar trends as new physical games are right now. While the   category is down, there is no debate about that. It is following   the same pattern as we see on the new gaming side of the   business. Meaning specifically, that our sales around the Switch   are our best performers within pre-owned games and that the other   two versions are feeling more of the sales pinch right now. We   would expect that to continue by the way in the new gaming   cycle.",
    "I think when you think of the new consoles, there are a couple   of things that are pretty significant. One is, backward   compatibility. The other is the fact that, both new devices will   have a disk drive on them. So certainly, I think when that   becomes widely understood that we'll see a bit of a -- another   bite to the apple in terms of pre-owned gaming as that will be   certainly alive and well for years to come.",
    " Ben Schachter    --   Macquarie Group -- Analyst ",
    "Any thoughts on eSports and how that's going to impact the   social cultural hub initiative?",
    " James Bell    --   Executive Vice President and Chief Financial Officer ",
    "Yeah. eSports is something that we've got involved with. We   have a partnership with Complexity Gaming. And in fact, we have   the naming rights for their training center here in Dallas. We   also have a partnership with team Envy. So we moved closer and   closer. We think that it will be a valuable, first of all,   content. So the ability to get content from these facilities,   from these teams that we can share with our best customers, that   we can share with our in-store gamers.",
    "And I mean, certainly, I think we've looked down the road and   if there is significant gaming activity in stores, there's a   stream-up capability as well. So, we certainly see an opportunity   to partner and have the -- our version of the little league's   going on in stores or the minor league's going on in stores that   could over time lead to a connection with those professional   sports businesses.",
    " Operator ",
    "Our next question comes from Ray Stochel of Consumer Edge   Research. Please go ahead.",
    " Ray Stochel    --   Consumer Edge Research -- Analyst ",
    "Great. Thanks for taking my question. You guys had mentioned   that you looked at a bunch of data with your stakeholders. Do you   guys have a broad sense of some KPIs? So, what I'd be looking for   would be lifetime value, but other KPIs would be helpful as well   of your customers versus the lifetime value or other KPIs of   customers acquired from Walmart, Target, Amazon or Best Buy,   especially for Sony and Microsoft?",
    "And then my follow-up question to that would be more on store   count. Has there been a change in the economics of reverse   cannibalization or recapture now with e-commerce? And is your new   e-commerce site positioned more effectively to recapture   consumers, whether that be the new -- the consumer purchasing new   or the consumer purchasing pre-owned? Thanks.",
    " George Sherman    --   Chief Executive Officer ",
    "Yeah. Thanks Ray. I think on the first question, as it applies   to the data that we -- in our understanding of our customer base,   we've done more and more assuring of that with our vendor   partners than -- and it's been mutual. So, I think certainly   that's one of our competitive advantages, is that it's a pretty   well known fact among our partner community that we over indexed   with customers.",
    "We have a higher digital attach rate, customers who buy   physical games for us buy more games overall, customers who buy   from us buy more accessories overall. So in virtually every   category of the business, whether it be digital, physical games   or accessories, you see a higher attachment rate at a GameStop   store, no question about it. So, that is certainly something that   we are proud of and certainly data that we share. And again, as   it applies to lifetime value, we have more of a cross exchange   going out with our vendor partners than we probably have in the   past.",
    "Yeah, on the website, I think, couple of things jump to mind.   First and foremost, among the new capabilities is buy online,   pickup in store. It is a very common in retail, obviously, and I   see it was a bit of a disadvantage for us. You could hold online,   buy in store, but not buy online, pickup in store. We think that   will be a significant growth category for us going forward. We   also have what we think is pretty unique, is the ship to home   capability at every store in our fleet.",
    "So, when you talk about supply, it's not just two distribution   centers, it's virtually every store in our company can service as   one as well and get product quickly to a customer. Shopability is   better, ease of navigation. It was a bit cumbersome to buy, for   instances, softlines in our prior site. It was clunky when it   came to buying by size, that's now been fixed and this community   aspect of it as well that we think is pretty different.",
    " Ray Stochel    --   Consumer Edge Research -- Analyst ",
    "Great. Thanks, again.",
    " George Sherman    --   Chief Executive Officer ",
    "Thanks.",
    " Operator ",
    "[Operator Instructions] Our next question comes from Seth   Sigman of Credit Suisse. Please go ahead.",
    " Lavesh Hemnani    --   Credit Suisse -- Analyst ",
    "Hi. This is Lavesh Hemnani on for Seth. Thanks for taking our   questions. So firstly, to start off with the pre-owned business,   I think last quarter you spoke of some changes in the business   stream that you were looking at testing some models to enhance   the value proposition. I mean, could you give us some results of   the test and frame the magnitude of the margin reset that you may   see like in 2H and beyond?",
    " George Sherman    --   Chief Executive Officer ",
    "Yeah. We've had a couple of tests that we are not quite ready   to speak the results on, and this applies to both pre-owned as   well as to our loyalty customer base and the new PowerUp offer.   So they are early on. We're seeing some initial good success. I   will say that the biggest change that we have made that's now   done is it applies to pre-own gaming, is to unify the gaming   business under our single merchant. So in the past, it's been   fragmented across the pre-owned merchant, a new game merchant and   now we own the business across the spectrum including pricing   optimization. So, that's been the biggest change that's done.   There's a couple of things that are, I'd say, just too early for   us to comment on.",
    " Lavesh Hemnani    --   Credit Suisse -- Analyst ",
    "Got it. So, just a follow-up on the cost initiatives. So   regarding the profit improvement plan that you guys highlighted,   how do we think about the timeline? When should it start showing   up? I mean, are we still supposed see some sort of benefit in the   back half or like toward the end of 4Q and then we see the   ramping up through [Phonetic] the next year?",
    " George Sherman    --   Chief Executive Officer ",
    "Yeah. Our initiative -- our profit initiative is, you can   think of almost effectively as a 50-50 split between cost   reduction and areas like margin improvement. Obviously, the cost   reduction is going to happen faster. And as Jim mentioned in his   comments, most of what we did here recently happened at the late   portion or subsequent to the end of Q2. So, it's all very new,   but it is now in effect. We think of that, call it $100 million   of cost reduction opportunity has been roughly 40% complete now.   And that's a combination of structural changes that we made, as   well as some indirect procurement initiatives that have taken   hold. So, that gives us a level of confidence again to commit to   a $200 million number because we made very, very good progress on   one of the key tracks to get there.",
    " Lavesh Hemnani    --   Credit Suisse -- Analyst ",
    "Got it. And just if I can just squeeze one more and really   quickly here. So regarding some of the initiatives within the   store, you guys spoke about rationalizing the collectibles   assortment within the store. I mean apart from that, are there   any other store resets that you are working on and that you could   elaborate on?",
    " George Sherman    --   Chief Executive Officer ",
    "Yeah. I'd say generally speaking, we mentioned that we are a   week away from a reset in the store. And that's not the end   product. It's a step in the right direction. It's what the team   did a remarkable job on with about six weeks to get things done.   So, you're going to see some SKU reduction. You're going to see,   I'd say better pairing by ecosystem, meaning when you look at the   assortment within the Sony, Nintendo and Microsoft world that are   more logical, there's more accessories pulled in together,   there's a bit more private label, there's a bit more attach areas   that are part of it. And it's a bit cleaner on the collectibles   side of the business as well.",
    "And as I mentioned to Steph on her comments, we would be much   more focused in terms of where we know collectibles works. And   there are categories. We have a remarkable relationship with   Funko and we've been enormously successful with the pops   business. It's a big part of our collectibles for us. So, I think   you're going to see a step in the right direction, but it's not   in any -- in respect to finished product. It's the best effort in   a very short period of time.",
    " Lavesh Hemnani    --   Credit Suisse -- Analyst ",
    "Got it. Thank you so much.",
    " Operator ",
    "That's all the time we have for questions. At this time, I   will turn the conference back to George Sherman for any   additional or closing remarks. Please go ahead.",
    " George Sherman    --   Chief Executive Officer ",
    "Yeah. Thank you. And thanks to everyone for joining us today   on our call. We appreciate your interest in GameStop as always. I   have to say, coming off of our preholiday store leadership   conference in Nashville just a couple of weeks ago, I want to   give a shout out to our store teams, in particular, our store   managers, and really the entire team overall. I mean it's a   wildly enthusiastic group. It's obvious that they are ready to   execute under new direction. They are passionate about moving us   forward as quickly as possible, and we have a great team that's   ready to win. I want to thank them for their hard work ahead of   the important holiday season. Thank you all.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 49 minutes ",
    " Unidentified Speaker ",
    " George Sherman    --   Chief Executive Officer ",
    " James Bell    --   Executive Vice President and Chief Financial Officer ",
    " Stephanie Wissink    --   Jefferies -- Analyst ",
    " Joe Feldman    --   Telsey Advisory Group -- Analyst ",
    " Ben Schachter    --   Macquarie Group -- Analyst ",
    " Ray Stochel    --   Consumer Edge Research -- Analyst ",
    " Lavesh Hemnani    --   Credit Suisse -- Analyst ",
    " More GME analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than GameStop     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and GameStop wasn't   one of them! That's right -- they think these 10 stocks   are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     owns shares of GameStop. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:23:13"
}