{
  "url": "https://www.nasdaq.com/article/near-term-outlook-appears-bleak-for-steel-producers-stocks-cm1206553",
  "title": "Near-Term Outlook Appears Bleak for Steel Producers' Stocks - Nasdaq.com",
  "text": [
    "The Zacks Steel Producers industry consists of producers of a wide range of steel products for a number of end-use industries including automotive, construction, appliance, container, industrial machinery, transportation, and oil and gas. These products include hot-rolled and cold-rolled coils and sheets, hot-dipped and galvanized coils and sheets, reinforcing bars, billets, wire rods, strip mill plates, standard and line pipe, and mechanical tubing products.",
    "Here are the industry's three major themes:",
    "Zacks Industry Rank Indicates Dim Prospects",
    "The Zacks Steel Producers industry is part of the broader Zacks Basic Materials sector. It carries a Zacks Industry Rank #172, which places it at the bottom 33% of more than 250 Zacks industries.\r\n The group's Zacks Industry Rank , which is basically the average of the Zacks Rank of all the member stocks, indicates a gloomy near term. Our research shows that the top 50% of the Zacks-ranked industries outperforms the bottom 50% by a factor of more than 2 to 1.\r\n The industry's position in the bottom 50% of the Zacks-ranked industries is a result of negative earnings outlook for the constituent companies in aggregate. Looking at the aggregate earnings estimate revisions, it appears that analysts are pessimistic about this group's earnings growth potential. Over the past year, the industry's earnings estimate for the current year has gone down 61.1%.\r\n Before we present a few steel producers stocks that you may want to consider for your portfolio, let's take a look at the industry's recent stock market performance and current valuation.Industry Lags S&P 500 & Sector\r\n The Zacks Steel Producers industry has lagged both the Zacks S&P 500 composite and the broader Zacks Basic Materials Sector over the past year.\r\n The industry has declined 36.5% over this period compared with the S&P 500's decline of 0.5% and broader sector's decline of 16.2%.One-Year Price Performance",
    "Industry's Current Valuation\r\n On the basis of trailing 12-month enterprise value-to EBITDA (EV/EBITDA) ratio, which is a commonly used multiple for valuing steel stocks, the industry is currently trading at 5.65X, below the S&P 500's 10.89X and the sector's 8.68X.\r\n Over the past five years, the industry has traded as high as 9.56X, as low as 5.15X and at the median of 7.60X, as the chart below shows.Enterprise Value/EBITDA (EV/EBITDA) Ratio",
    "Enterprise Value/EBITDA (EV/EBITDA) Ratio",
    "Bottom Line\r\n The steel producers industry remains hamstrung by sustained overcapacity, driven by continued growth in Chinese production. Sino-U.S. trade tensions also pose as headwinds to the industry. A weakening Chinese economy amid trade war has triggered a slowdown in steel demand in China. Falling U.S. steel prices are also hurting American steel producers.\r\n Here, we present one stock sporting a Zacks Rank #1 (Strong Buy) and two stocks carrying a Zacks Rank #2 (Buy) that are well positioned to gain amid the prevailing challenges. There is also another stock with a Zacks Rank #3 (Hold) that investors may currently hold on to. You can see the complete list of today's Zacks #1 Rank stocks here .L.B. Foster Company (FSTR): The Pennsylvania-based company, sporting a Zacks Rank #1, has an expected earnings growth of 86.3% for the current year. The consensus EPS estimate has moved 12.4% higher for the current year, over the last 60 days.Price and Consensus: FSTR",
    "Commercial Metals Company (CMC): The Texas-based company currently carries a Zacks Rank #2. It has an expected earnings growth of 36.9% for the current year. The company delivered an average positive earnings surprise of 8.3% in the trailing four quarters. The consensus EPS estimate has moved 1% higher for the current year, over the last 60 days.Price and Consensus: CMC",
    "Shiloh Industries, Inc. (SHLO): The consensus EPS estimate for this Ohio-based company has moved 50% higher for the current year, over the last 60 days. The stock, carrying a Zacks Rank #2, has also delivered an average positive earnings surprise of 535.4% in the trailing four quarters.Price and Consensus: SHLO",
    "Nucor Corporation (NUE): The North Carolina-based company, carrying a Zacks Rank #3, delivered an average positive earnings surprise of 2.6% in the trailing four quarters. The company also has an estimated long-term earnings growth rate of 12%, higher than the industry average of 7.5%.Price and Consensus: NUE",
    "Legalizing THIS Could Be Even Bigger than Marijuana\r\n Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.\r\n Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.See these 5 \"sin stocks\" now >>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 06:49:00"
}