{
  "url": "https://www.nasdaq.com/article/the-zacks-analyst-blog-highlights-att-thermo-fisher-schwab-veeva-and-pvh-cm1207210",
  "title": "The Zacks Analyst Blog Highlights: AT&T, Thermo Fisher, Schwab, Veeva and PVH - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL -September 4, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: AT&T T  , Thermo Fisher TMO  , Schwab SCHW  , Veeva Systems VEEV  and PVH Corp. PVH  .  Here are highlights from Tuesday's Analyst Blog:    Top Stock Reports for AT&T, Thermo Fisher and     Schwab   The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features updated research reports on 16 major stocks, including AT&T, Thermo Fisher and Schwab. These research reports have been hand-picked from roughly 70 reports published by our analyst team today. You can see    all of    today's research reports here     >>>     AT&T  's shares have gained +10.7% over the past year, outperforming the Zacks Wireless National industry's increase of +7.7%. AT&T is improving critical services that support Public Safety and first responders using the FirstNet communications platform. The wireless carrier's LTE network reaches more than 400 million people in North America. It aims to deploy a standards-based, nationwide mobile 5G network in early 2020. AT&T's 5G Evolution technology is live in more than 200 markets, and is expected to reach more than 400 markets by the end of 2019. It is on track to achieve its target of 2.5x debt-to-EBITDA range by 2019. However, the Zacks analyst thinks the company is witnessing a steady decline in linear TV subscribers and legacy services. Its wireline division is facing loss in access line due to competitive pressure from Voice over Internet Protocol service providers. As the company tries to woo customers with discounts, freebies and cash credits, margin pressures tend to soar. (You can    read the full research report on AT&T here     >>>    ). Shares of Thermo Fisher  have outperformed the Zacks Medical Instruments industry in the past three months (+7.1% vs. +5.6%). The Zacks analyst thinks Thermo Fisher has recently been demonstrating strength in all end markets categorized by customer type or geography. In the second quarter, the company registered solid international performance with growth in Europe and Asia-Pacific including China. A series of product launches aided its performance. The company's recent purchase of Brammer Bio in the field of Gene and Cell Therapy is a major positive. Thermo Fisher's Specialty Diagnostics business, even in the face of the divestment of its anatomical pathology unit, holds immense potential. The company's raised 2019 guidance looks encouraging. On the flip side, Thermo Fisher's operating segments are getting impacted by unfavorable business mix. Competitive headwinds and escalating costs pose threat. (You can    read the full research report on Thermo Fisher here     >>>    ).  Schwab  's shares have underperformed the Zacks Investment Brokers industry over the past six months, declining -16.2% vs. -7.5%. However, the Zacks analyst thinks the company has a decen t earnings  surprise history. Its earnings have surpassed expectations in three of the trailing four quarters. The company's planned acquisition of USAA's Investment Management Company, efforts to strengthen trading business and improvement in operating efficiency bode well for the future. Additionally, the company's steady capital deployment actions are commendable and are expected to continue to enhance shareholder value. Nevertheless, a dismal rate scenario remains a major concern for the company and will likely hamper margin and top-line growth in the upcoming quarters. Rising operating expenses (mainly related to compensation costs and regulatory charges) are likely to hurt bottom-line growth to some extent. (You can    read the full research report on Schwab here     >>>    ). Other noteworthy reports we are featuring today include Veeva Systems and PVH Corp.  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>    Media Contact Zacks Investment Research 800-767-3771 ext. 9339     support@zacks.com      http://www.zacks.com  Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Veeva Systems Inc. (VEEV): Free Stock Analysis Report   AT&T Inc. (T): Free Stock Analysis Report   Thermo Fisher Scientific Inc. (TMO): Free Stock Analysis Report   The Charles Schwab Corporation (SCHW): Free Stock Analysis Report   PVH Corp. (PVH): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " For Immediate Release ",
    "Chicago, IL -September 4, 2019 - Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: AT&T T  , Thermo Fisher TMO  , Schwab SCHW  , Veeva Systems VEEV  and PVH Corp. PVH  .",
    " Here are highlights from Tuesday's Analyst Blog: ",
    "  Top Stock Reports for AT&T, Thermo Fisher and     Schwab  ",
    "The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features updated research reports on 16 major stocks, including AT&T, Thermo Fisher and Schwab. These research reports have been hand-picked from roughly 70 reports published by our analyst team today.",
    "You can see    all of    today's research reports here     >>>   ",
    " AT&T  's shares have gained +10.7% over the past year, outperforming the Zacks Wireless National industry's increase of +7.7%. AT&T is improving critical services that support Public Safety and first responders using the FirstNet communications platform.",
    "The wireless carrier's LTE network reaches more than 400 million people in North America. It aims to deploy a standards-based, nationwide mobile 5G network in early 2020. AT&T's 5G Evolution technology is live in more than 200 markets, and is expected to reach more than 400 markets by the end of 2019. It is on track to achieve its target of 2.5x debt-to-EBITDA range by 2019.",
    "However, the Zacks analyst thinks the company is witnessing a steady decline in linear TV subscribers and legacy services. Its wireline division is facing loss in access line due to competitive pressure from Voice over Internet Protocol service providers. As the company tries to woo customers with discounts, freebies and cash credits, margin pressures tend to soar.",
    "(You can    read the full research report on AT&T here     >>>    ).",
    "Shares of Thermo Fisher  have outperformed the Zacks Medical Instruments industry in the past three months (+7.1% vs. +5.6%). The Zacks analyst thinks Thermo Fisher has recently been demonstrating strength in all end markets categorized by customer type or geography. In the second quarter, the company registered solid international performance with growth in Europe and Asia-Pacific including China.",
    "A series of product launches aided its performance. The company's recent purchase of Brammer Bio in the field of Gene and Cell Therapy is a major positive. Thermo Fisher's Specialty Diagnostics business, even in the face of the divestment of its anatomical pathology unit, holds immense potential.",
    "The company's raised 2019 guidance looks encouraging. On the flip side, Thermo Fisher's operating segments are getting impacted by unfavorable business mix. Competitive headwinds and escalating costs pose threat.",
    "(You can    read the full research report on Thermo Fisher here     >>>    ).",
    " Schwab  's shares have underperformed the Zacks Investment Brokers industry over the past six months, declining -16.2% vs. -7.5%. However, the Zacks analyst thinks the company has a decen t earnings  surprise history. Its earnings have surpassed expectations in three of the trailing four quarters.",
    "The company's planned acquisition of USAA's Investment Management Company, efforts to strengthen trading business and improvement in operating efficiency bode well for the future. Additionally, the company's steady capital deployment actions are commendable and are expected to continue to enhance shareholder value.",
    "Nevertheless, a dismal rate scenario remains a major concern for the company and will likely hamper margin and top-line growth in the upcoming quarters. Rising operating expenses (mainly related to compensation costs and regulatory charges) are likely to hurt bottom-line growth to some extent.",
    "(You can    read the full research report on Schwab here     >>>    ).",
    "Other noteworthy reports we are featuring today include Veeva Systems and PVH Corp.",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "   See these 5 \"sin stocks\" now >>   ",
    "Media Contact",
    "Zacks Investment Research",
    "800-767-3771 ext. 9339",
    "    support@zacks.com ",
    "    http://www.zacks.com ",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss .  This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:12:00"
}