{
  "url": "https://www.nasdaq.com/article/why-international-flavors-fragrances-stock-fell-238-last-month-cm1210391",
  "title": "Why International Flavors & Fragrances Stock Fell 23.8% Last Month - Nasdaq.com",
  "text": [
    "Shares of International Flavors & Fragrances (NYSE: IFF) sank 23.8% in August, according to data from S&P Global Market Intelligence . The company reported second-quarter earnings on Aug. 5, and the results for the period and revised guidance prompted a substantial sell-off for the stock despite news that its quarterly dividend had been raised from $0.73 to $0.75.",
    "Data source: IFF  by YCharts.",
    "Second-quarter revenue rose roughly 40% year over year to hit $1.29 billion (including the contribution from the company's acquisition of the Israel-based Frutarom), which fell just short of the average analyst revenue target of $1.3 billion. Accounting for the combination of the businesses and adjusting to a constant-currency basis, sales rose roughly 1% compared to the prior-year period. Non- GAAP (adjusted) earnings per share fell 21.7% year over year to come in at $1.30, missing the average analyst estimate's target for per-share earnings of $1.61.",
    "Image source: Getty Images.",
    "The company's scent segment managed to increase adjusted sales roughly 4% and profits by roughly 19%. However, an adjusted sales decline of 1% and rising cost of goods translated to a 6% decline for the profitability of the company's taste segment.",
    "In addition to the bottom-line miss, the company also made downward revisions to its full-year sales and earnings outlook. Management now expects sales to come in between $5.15 billion and $5.25 billion, down from the original guidance for annual revenue between $5.2 billion and $5.3 billion. Adjusted earnings per share are now expected to be between $4.95 and $5.05, down from the original target range of between $4.90 and $5.10.",
    "International Flavors & Fragrances stock has regained some ground in September, with shares trading up roughly 12.9% in the month so far. Shares have advanced following a presentation from the company at the Barclays Global Consumer Staples Conference on Sept. 5.",
    "Data source: IFF  by YCharts.",
    "The company's chairman and chief executive officer Andreas Fibig and executive vice president and chief financial officer Richard O'Leary participated in a presentation at the Barclays event and used the occasion to highlight progress on the integration of Frutarom -- which it acquired in a $7.1 billion deal that closed last October. Sales growth for Frutarom recently dropped to 4%, but management reaffirmed expectations for mid-single-digit growth over the long term and expects performance to be closer to that range in the second half of this year and in next year.",
    "Shares trade at roughly 20 times this year's expected earnings and have a dividend yield of approximately 2.4%.",
    "10 stocks we like better than International Flavors & Fragrances\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and International Flavors & Fragrances wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Keith Noonan has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:53:00"
}