{
  "url": "https://www.nasdaq.com/article/argentinas-peso-under-scrutiny-following-capital-controls-as-us-markets-reopen-20190903-00530",
  "title": "Argentina's peso under scrutiny following capital controls, as U.S. markets reopen - Nasdaq.com",
  "text": [
    "LONDON/BUENOS AIRES, Sept 3 (Reuters) - Investors are bracing to see how Argentine assets fare on Tuesday as U.S. markets reopen after a holiday weekend and Latin America's third largest economy marks its second day under new currency controls.",
    "The pounding of Argentina's bonds eased in Europe after they fell to record lows on Monday and there were tentative gains in some foreign-traded bank shares, as investors waited for Wall Street's first reaction to Buenos Aires' imposition of capital controls over the weekend.",
    "Frankfurt-listed American Depositary Receipts (ADR) of Grupo Financiero Galicia  were up almost 1%, having tumbled 9.15% on Monday, but Banco Macro SA's ADRs slipped again. Brokers were quoting marginally higher prices for Argentina's badly mauled sovereign debt in Europe.",
    "The peso closed 0.88% stronger in official markets on Monday, but ended 0.79% weaker in the black market at 63.5 per dollar, a divergence underscoring mistrust of the official price.",
    "On Sunday, the government authorized the central bank to restrict purchases of dollars as it burns through its reserves to prop up the peso. The currency controls were a 180-degree turn for President Mauricio Macri, a free-markets advocate who abolished capital controls after he came to power in 2015.",
    "It was the government's latest attempt to stabilize the peso, which has lost 28% of its value since opposition presidential candidate Alberto Fernandez emerged as the clear front-runner in the Aug. 11 primary election.",
    "Fernandez and his running mate, former President Cristina Fernandez de Kirchner, are considered a riskier prospect by investors, who fear Argentina could return to the interventionist policies of her former government.",
    "On Monday, central bank president Guido Sandleris called Argentina's financial system \"strong\" and said the bank would adhere to its strict monetary policy, despite the currency restrictions. ",
    "Sandleris, speaking at a press conference, said the bank was in talks with the IMF to \"redefine\" the goals for September under its $57 billion financing agreement."
  ],
  "published_datetime": "2019-09-03 08:21:00"
}