{
  "url": "https://www.nasdaq.com/article/exxon-agrees-4-bln-sale-of-norway-oil-and-gas-assets-20190905-00820",
  "title": "Exxon agrees $4 bln sale of Norway oil and gas assets - Nasdaq.com",
  "text": [
    "By Ron Bousso and Shadia Nasralla",
    "LONDON/ ABERDEEN, Scotland, Sept 5 (Reuters) - Exxon Mobil  has agreed to sell its Norwegian oil and gas assets for up to $4 billion, ending its production in a country where it started operations more than a century ago, three sources familiar with the matter said on Thursday.",
    "U.S. oil major Exxon said in June it was looking to sell its Norwegian upstream portfolio, which comprises minority stakes in more than 20 fields, operated by local producer Equinor  and Anglo-Dutch oil major Royal Dutch Shell .",
    "Shares in Exxon, the world's biggest publicly traded oil company, rose 1.7% to a session high in New York after Reuters reported a sale had been agreed.",
    "The Irving, Texas-based company has held talks in recent weeks with a number of interested parties including Oslo-listed companies Equinor, Aker BP , and DNO , Stockholm-listed Lundin Petroleum  as well as Var Energi, backed by Italy's Eni , and private equity firm Hitech Vision, industry sources said.",
    "Equinor, Lundin and DNO were not immediately available to comment. Var declined to comment.",
    "The three sources said that Exxon had closed the sale process in recent days with one buyer after agreeing on the terms of a sale.",
    "Exxon hired investment bank Jefferies to run the sale process, banking sources told Reuters last month. ",
    "Jefferies declined to comment.",
    "In 2017, Exxon's net production from fields off Norway was around 170,000 barrels of oil equivalent per day, according to its website.",
    "The sale, if approved by regulators and completed, comes after Exxon focused in recent years on growing its onshore U.S. shale production, particularly in the Permian basin, as well as developing huge oil discoveries in Guyana.",
    "Oslo-based consultancy Rystad Energy said in a note in June that as of Jan 1, 2019, Exxon held 530 million barrels of oil equivalent on the Norwegian Continental Shelf. ",
    "\"The profile is mature and declining, but nevertheless sizeable in terms of current production. A portfolio generating high cash flow and with limited tax balances, given the Norwegian fiscal regime with 90% nominal tax relief on investment, will be highly attractive for any E&P company without sufficient revenue,\" Rystad analyst Simon Sjothun said.",
    "Exxon is also considering selling its assets in the British North Sea after more than 50 years, industry sources told Reuters last month."
  ],
  "published_datetime": "2019-09-05 12:02:00"
}