{
  "url": "https://www.nasdaq.com/article/the-smart-debt-repayment-plan-for-couples-cm1210693",
  "title": "The Smart Debt Repayment Plan for Couples - Nasdaq.com",
  "text": [
    "       Do you and your partner both owe money? Here's how you can tackle   your debt together as a team.  It's very common in this day and age for both people entering into a relationship to carry at least some debt. This could be student loan debt, credit card debt, personal loan debt, or other types of consumer loans. Many couples also take on debt together, often to buy a house or accomplish other joint financial goals. When you find yourself in a situation where you both owe money, you'll have to decide how to tackle the debt as a couple. This can be easier said than done, especially if your debt balances are big. But taking the three steps described below can help you to find a debt repayment plan that works for both partners.makeArticleAd();   Image source: Getty Images  1. Consider combining your efforts to repay debt ASAP If you are married, considering marriage or in a committed relationship, you and your partner will need to have a serious conversation about debt. You need to decide whether you each want to work on debt payoff separately or whether repaying your debts is something you'll do together. There are some significant benefits to teaming up. For example, if you have a lot of high-interest consumer debt, you could apply for a joint personal loan  to consolidate and refinance that debt. If one spouse has better credit than the other, you could potentially get approved for a loan at a very favorable rate and make debt paydown much less expensive. If you team up and work on jointly paying off all the debt you each owe, you can also prioritize paying off high-interest debt first. Ideally, by combining your finances and putting as much extra money as possible towards debt with the highest interest rate, you could get that debt paid down ASAP and save yourselves a fortune. There are some downsides and risks to working together on debt repayment, of course. If your relationship ends, you may end up feeling you wasted money on helping your spouse or partner to repay their debt. That's especially true if you had your own loans to pay, but instead put a lot of your earnings towards retiring your partner's debt. And if you get a joint loan, you risk becoming legally responsible for your partner's debt -- even in the event of a divorce or if your partner passes away. Only you can decide if the risks outweigh the benefits. However, you can mitigate those risks with a life insurance policy and with a prenuptial agreement or cohabitation contract  that addresses how assets and debts would be divided if you split up. Just be aware, though, that if you take out a joint loan, creditors could still try to collect from you, even if your divorce or separation agreement says your spouse or partner is the one responsible for making payments. 2. Set joint goals for debt payoff Regardless of whether you combine your debt repayment efforts, it is still a good idea to set joint goals for paying off debt. That's because your partner's debt will affect you even if your finances are kept largely separate. Your partner's debt will affect the amount of spare cash he or she has, and impact other financial goals such as buying a home. Both partners should disclose their debt before moving in together, getting married, or otherwise merging their lives in a serious way. If you've already passed those milestones without a discussion about debt, you need to have this conversation ASAP. You should also decide together whether you want to pay extra towards your debt and what your payoff goals are. Get on the same page, because if one of you wants to pay a lot of extra money to creditors to become debt-free ASAP and the other plans to keep using credit cards  and carrying a balance forever, this is inevitably going to lead to big problems. Setting joint goals for debt payoff not only helps you to make sure you're both committed to debt freedom, but it can also help you both to remain accountable and ultimately be more effective at debt paydown. If you know your partner is counting on you to get that card paid off by the end of the year, you're far less likely to skip an extra payment and splurge than you might be if you had no one to answer to. 3. Be realistic about how debt affects your shared financial life Finally, it's important to really recognize how the debt you each have is going to affect what you're able to do financially. If you're planning for early retirement but your spouse has hundreds of thousands of dollars in student loans and will need to work until his or her 80s, this is going to be a big issue if you don't address it. Your partner's commitment to debt payoff may also mean you need to live in a cheaper apartment, can't take big vacations, or have to put off having kids. You should talk about the impact your debt is going to have when you set your payoff plan because this will help you to decide just what you'll need to sacrifice to get your debt paid off on the schedule you both agree you need. Working together can help make debt payoff easier Whether you combine your finances and team up to pay off high-interest debt first or you simply support each other in your separate efforts to pay down debt, it's important that you treat debt as a problem that affects both of your financial lives. If you make a joint commitment to address your debt ASAP, you'll hopefully be free of your financial burdens sooner rather than later and will be able to team up to accomplish other, more fun, financial goals. Our #1 cash back pick has a surprise bonus This may be the perfect cash back card  ! That's because it packs in $1,148 of value. Cardholders can earn up to 5% cash back, double rewards in the first year, and avoid interest well into 2020. With such a deep bench of perks you'll wonder how this card packs in a $0 annual fee. Best yet, you can apply and get a decision in two minutes. Learn more  with our in-depth review.  The Motley Fool owns and recommends MasterCard and Visa, and recommends American Express. We're firm believers in the Golden Rule. If we wouldn't recommend an offer to a close family member, we wouldn't recommend it on The Ascent either. Our number one goal is helping people find the best offers to improve their finances. That is why editorial opinions are ours alone and have not been previously reviewed, approved, or endorsed by included advertisers. Editorial content from The Ascent is separate from The Motley Fool editorial content and is created by a different analyst team.",
    "      Do you and your partner both owe money? Here's how you can tackle   your debt together as a team. ",
    "It's very common in this day and age for both people entering into a relationship to carry at least some debt. This could be student loan debt, credit card debt, personal loan debt, or other types of consumer loans. Many couples also take on debt together, often to buy a house or accomplish other joint financial goals.",
    "When you find yourself in a situation where you both owe money, you'll have to decide how to tackle the debt as a couple. This can be easier said than done, especially if your debt balances are big. But taking the three steps described below can help you to find a debt repayment plan that works for both partners.",
    "  Image source: Getty Images ",
    "Image source: Getty Images",
    "If you are married, considering marriage or in a committed relationship, you and your partner will need to have a serious conversation about debt. You need to decide whether you each want to work on debt payoff separately or whether repaying your debts is something you'll do together.",
    "There are some significant benefits to teaming up. For example, if you have a lot of high-interest consumer debt, you could apply for a joint personal loan  to consolidate and refinance that debt. If one spouse has better credit than the other, you could potentially get approved for a loan at a very favorable rate and make debt paydown much less expensive.",
    "If you team up and work on jointly paying off all the debt you each owe, you can also prioritize paying off high-interest debt first. Ideally, by combining your finances and putting as much extra money as possible towards debt with the highest interest rate, you could get that debt paid down ASAP and save yourselves a fortune.",
    "There are some downsides and risks to working together on debt repayment, of course. If your relationship ends, you may end up feeling you wasted money on helping your spouse or partner to repay their debt. That's especially true if you had your own loans to pay, but instead put a lot of your earnings towards retiring your partner's debt. And if you get a joint loan, you risk becoming legally responsible for your partner's debt -- even in the event of a divorce or if your partner passes away.",
    "Only you can decide if the risks outweigh the benefits. However, you can mitigate those risks with a life insurance policy and with a prenuptial agreement or cohabitation contract  that addresses how assets and debts would be divided if you split up. Just be aware, though, that if you take out a joint loan, creditors could still try to collect from you, even if your divorce or separation agreement says your spouse or partner is the one responsible for making payments.",
    "Regardless of whether you combine your debt repayment efforts, it is still a good idea to set joint goals for paying off debt. That's because your partner's debt will affect you even if your finances are kept largely separate. Your partner's debt will affect the amount of spare cash he or she has, and impact other financial goals such as buying a home.",
    "Both partners should disclose their debt before moving in together, getting married, or otherwise merging their lives in a serious way. If you've already passed those milestones without a discussion about debt, you need to have this conversation ASAP.",
    "You should also decide together whether you want to pay extra towards your debt and what your payoff goals are. Get on the same page, because if one of you wants to pay a lot of extra money to creditors to become debt-free ASAP and the other plans to keep using credit cards  and carrying a balance forever, this is inevitably going to lead to big problems.",
    "Setting joint goals for debt payoff not only helps you to make sure you're both committed to debt freedom, but it can also help you both to remain accountable and ultimately be more effective at debt paydown. If you know your partner is counting on you to get that card paid off by the end of the year, you're far less likely to skip an extra payment and splurge than you might be if you had no one to answer to.",
    "Finally, it's important to really recognize how the debt you each have is going to affect what you're able to do financially. If you're planning for early retirement but your spouse has hundreds of thousands of dollars in student loans and will need to work until his or her 80s, this is going to be a big issue if you don't address it.",
    "Your partner's commitment to debt payoff may also mean you need to live in a cheaper apartment, can't take big vacations, or have to put off having kids. You should talk about the impact your debt is going to have when you set your payoff plan because this will help you to decide just what you'll need to sacrifice to get your debt paid off on the schedule you both agree you need.",
    "Whether you combine your finances and team up to pay off high-interest debt first or you simply support each other in your separate efforts to pay down debt, it's important that you treat debt as a problem that affects both of your financial lives.",
    "If you make a joint commitment to address your debt ASAP, you'll hopefully be free of your financial burdens sooner rather than later and will be able to team up to accomplish other, more fun, financial goals.",
    "This may be the perfect cash back card  ! That's because it packs in $1,148 of value. Cardholders can earn up to 5% cash back, double rewards in the first year, and avoid interest well into 2020. With such a deep bench of perks you'll wonder how this card packs in a $0 annual fee. Best yet, you can apply and get a decision in two minutes. Learn more  with our in-depth review.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:00:00"
}