{
  "url": "https://www.nasdaq.com/article/phillips-66-psxp-to-pay-back-term-loan-with-notes-offering-cm1207191",
  "title": "Phillips 66 (PSXP) to Pay Back Term Loan With Notes Offering - Nasdaq.com",
  "text": [
    "  Phillips 66 Partners LP PSXP  recently announced the pricing of unsecured senior notes, carrying a total aggregate principal amount of $900 million. The master limited partnership anticipates the offering of the notes to close on Sep 6, 2019, awaiting customary closing conditions. Of the total principal, the partnership has priced $600 million senior notes at 99.781% of par. The notes will likely mature by 2029 and is expected to carry an interest rate of 3.150%. The remaining $300 million aggregate principal amount of senior notes is priced at 99.763% of par. Phillips 66 Partners, formed by Phillips 66 PSX  , added that the notes will mature on 2024 and will carry an interest rate of 2.450%.  Notably, the net proceeds from the unsecured senior notes' public offering will be utilized by Phillips 66 Partners for general partnership purposes that include investing in upcoming organic growth projects and major acquisitions. A part of the total net proceeds will be allocated to repay senior unsecured term loan with $400 million principal amount and senior notes with $300 million principal - carrying an interest rate of 2.646% and set to mature on February 2020. Headquartered in Houston, TX, Phillips 66 Partners owns midstream infrastructures that primarily include pipelines and terminals for transporting as well as storing crude oil, natural gas liquids and refined petroleum products. Currently, the partnership carries a Zacks Rank #3 (Hold). Some better-ranked players in the energy space include World Fuel Services Corporation INT  and Delek Logistics Partners LP DKL  . Both the stocks carry a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .   World Fuel beat the Zacks Consensus Estimate in each of the trailing four quarters, the average positive earnings surprise being 16.4%. Delek Logistics is likely to see earnings growth of 4.9% through 2019.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.  See 7 breakthrough stocks now>>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Phillips 66 Partners LP (PSXP): Free Stock Analysis Report   Delek Logistics Partners, L.P. (DKL): Free Stock Analysis Report   World Fuel Services Corporation (INT): Free Stock Analysis Report   Phillips 66 (PSX): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Phillips 66 Partners LP PSXP  recently announced the pricing of unsecured senior notes, carrying a total aggregate principal amount of $900 million. The master limited partnership anticipates the offering of the notes to close on Sep 6, 2019, awaiting customary closing conditions.",
    "Of the total principal, the partnership has priced $600 million senior notes at 99.781% of par. The notes will likely mature by 2029 and is expected to carry an interest rate of 3.150%.",
    "The remaining $300 million aggregate principal amount of senior notes is priced at 99.763% of par. Phillips 66 Partners, formed by Phillips 66 PSX  , added that the notes will mature on 2024 and will carry an interest rate of 2.450%. ",
    "Notably, the net proceeds from the unsecured senior notes' public offering will be utilized by Phillips 66 Partners for general partnership purposes that include investing in upcoming organic growth projects and major acquisitions. A part of the total net proceeds will be allocated to repay senior unsecured term loan with $400 million principal amount and senior notes with $300 million principal - carrying an interest rate of 2.646% and set to mature on February 2020.",
    "Headquartered in Houston, TX, Phillips 66 Partners owns midstream infrastructures that primarily include pipelines and terminals for transporting as well as storing crude oil, natural gas liquids and refined petroleum products.",
    "Currently, the partnership carries a Zacks Rank #3 (Hold). Some better-ranked players in the energy space include World Fuel Services Corporation INT  and Delek Logistics Partners LP DKL  . Both the stocks carry a Zacks Rank #2 (Buy). You can see   the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .  ",
    "World Fuel beat the Zacks Consensus Estimate in each of the trailing four quarters, the average positive earnings surprise being 16.4%.",
    "Delek Logistics is likely to see earnings growth of 4.9% through 2019.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    " See 7 breakthrough stocks now>> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:25:00"
}