{
  "url": "https://www.nasdaq.com/article/4-key-questions-for-gilead-sciences-new-ceo-cm1210302",
  "title": "4 Key Questions for Gilead Sciences' New CEO - Nasdaq.com",
  "text": [
    " Investors reacted positively overall to   Gilead Sciences    ' (NASDAQ: GILD) announcement earlier this year that Dan O'Day   would be the big biotech's next CEO. O'Day claims a solid track   record at   Roche    , most previously serving as CEO of Roche Pharmaceuticals. After joining Gilead in March, O'Day has already begun to make   his mark on the company's direction. He sat down at the Morgan   Stanley Global Healthcare Conference on Tuesday to talk about   that direction. Here are four questions O'Day answered that are   key to where Gilead is headed.   Image source: Getty Images.makeArticleAd();  1. Is oncology a core therapeutic area for Gilead? It might be surprising that one of the first questions for   O'Day was about Gilead's commitment to oncology. After all, the   company acquired Kite Pharma in 2017 and now stands as a leader   in cancer cell therapy. O'Day also has experience in oncology   from his Roche days. But nearly all of the big drugmakers are already competing in   the oncology market. These companies have a lot more experience   in cancer research than Gilead does. It's a fair question to ask   O'Day if Gilead's buyout of Kite is a one-off sideline deal or if   the company plans to really throw its efforts into establishing a   major presence in oncology. O'Day flatly declared that he's \"fully committed to cell   therapy.\" He said that it's an area where Gilead would remain a   leader and that the biotech would pursue using cell therapy to   target other types of cancer, including solid tumors. Reading between the lines, though, it sounds like Gilead will   probably be very cautious about moving into other approaches to   cancer treatment. O'Day acknowledged that he's \"sobered by   the level of investment required\" to compete in the oncology   market, noting that there are \"a lot of smart people\" at big   companies in the arena. 2. Will Gilead throw in the towel on HIV after Biktarvy? Another perhaps surprising question for O'Day related to   Gilead's HIV franchise. The company rose to success on the back   of a string of HIV drugs. But could Gilead throw in the towel on   HIV after Biktarvy loses patent exclusivity? Last year at the   Morgan Stanley conference, former CEO John Milligan said that   Biktarvy would   probably be the last HIV pill from Gilead    . O'Day was more upbeat. He emphasized that Gilead \"hasn't taken   its eyes off the ball\" with respect to HIV at all. For one thing,   O'Day thinks there's a lot more to do with Biktarvy, which   doesn't lose patent protection until 2033. He also mentioned the   tremendous potential for pre-exposure prophylaxis (PrEP), where   Gilead has penetrated only 20% of the market. More importantly, though, Gilead still has two unmet goals   with respect to HIV: a long-acting therapy and a cure for the   disease. O'Day said that the company remains committed to both   goals, stating that he is \"very bullish about the durability of   the HIV business at Gilead\" over the short, medium, and long   term. 3. How can Gilead compete in a crowded inflammation   market? Gilead has high hopes for filgotinib in treating inflammatory   diseases. The company announced in July that it plans to file for   U.S. approval of the drug this year. Gilead hasn't marketed an   inflammation drug before. It's about to jump into a crowded and   highly competitive market. Can the biotech be successful? O'Day admitted that his \"eyes are wide open on this one.\" It   is a brand-new therapeutic area for Gilead and an area, like   oncology, with several big players that dominate the market.   However, he said that his confidence in filgotinib's ability to   succeed stems from its great efficacy and tolerability. O'Day   acknowledged that Gilead wouldn't have been able to overcome \"a   marginal product profile\" but should be able to win with   filgotinib's strong profile. While Gilead will submit for regulatory approval of filgotinib   in rheumatoid arthritis first, O'Day said that he's excited the   most about the potential for the drug in treating inflammatory   bowel disease (IBD). But he also thinks that   Gilead's close relationship with   Galapagos      will enable the company to break through efficacy barriers   in treating rheumatoid arthritis through combination therapies.   O'Day's view is that \"filgotinib is kind of an anchor, a way of   getting in\" to more effectively addressing rheumatoid   arthritis. 4. Is NASH still a major area of focus? Gilead hasn't had much success so far with its nonalcoholic   steatohepatitis (NASH) program. Lead NASH candidate selonsertib   flopped in late-stage clinical studies    . Could NASH be an area that Gilead could abandon? O'Day's reply to this question was a nuanced one. He first   stated that Gilead is committed to its current NASH programs,   which include FXR agonist cilofexor and ACC inhibitor   firsocostat. He also said that he likes that Gilead is targeting   a disease with a really high unmet medical need and has the   opportunity to be best in class at treating NASH. However, he seemed to hedge a bit by stating that the   biotech's current testing of combination therapies \"will be   telling as to where our strategy goes from here.\" O'Day said that   depending on the outcomes of these clinical studies, Gilead would   either \"accelerate or regroup.\" Good answers  Investing in biotech stocks    comes with some level of uncertainty. That's because the world in   which biotechs like Gilead operate isn't always black and white.   Sometimes, the right answer to a question about what's next is:   \"It depends.\" That's basically how Dan O'Day answered the   question about the company's NASH efforts. And it was a good   answer. Actually, I think that all of O'Day's answers were good ones.   My view is that it's a smart move for Gilead to be very selective   about what it does next in the oncology space. The company is   leading in cell therapy, so building on that lead makes sense   instead of venturing into new territory. I agree with O'Day's optimism about the prospects for   filgotinib. My take is that the biotech's close alignment with   Galapagos should pay off over the long run. As for the HIV question, Dan O'Day's answer really didn't   differ from what Gilead executives have been saying for quite a   while. His bullishness about the company's HIV dominance appears   to be warranted, in my view. O'Day will no doubt reveal more over   time about the direction he plans to take Gilead, but so far I   think he's making the right moves.   10 stocks we like better than Gilead Sciences       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Gilead Sciences wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Keith Speights      owns shares of Gilead Sciences. The Motley Fool owns shares of     and recommends Gilead Sciences. The Motley Fool has a     disclosure policy      .  ",
    "Investors reacted positively overall to   Gilead Sciences    ' (NASDAQ: GILD) announcement earlier this year that Dan O'Day   would be the big biotech's next CEO. O'Day claims a solid track   record at   Roche    , most previously serving as CEO of Roche Pharmaceuticals.",
    "After joining Gilead in March, O'Day has already begun to make   his mark on the company's direction. He sat down at the Morgan   Stanley Global Healthcare Conference on Tuesday to talk about   that direction. Here are four questions O'Day answered that are   key to where Gilead is headed.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "It might be surprising that one of the first questions for   O'Day was about Gilead's commitment to oncology. After all, the   company acquired Kite Pharma in 2017 and now stands as a leader   in cancer cell therapy. O'Day also has experience in oncology   from his Roche days.",
    "But nearly all of the big drugmakers are already competing in   the oncology market. These companies have a lot more experience   in cancer research than Gilead does. It's a fair question to ask   O'Day if Gilead's buyout of Kite is a one-off sideline deal or if   the company plans to really throw its efforts into establishing a   major presence in oncology.",
    "O'Day flatly declared that he's \"fully committed to cell   therapy.\" He said that it's an area where Gilead would remain a   leader and that the biotech would pursue using cell therapy to   target other types of cancer, including solid tumors.",
    "Reading between the lines, though, it sounds like Gilead will   probably be very cautious about moving into other approaches to   cancer treatment. O'Day acknowledged that he's \"sobered by   the level of investment required\" to compete in the oncology   market, noting that there are \"a lot of smart people\" at big   companies in the arena.",
    "Another perhaps surprising question for O'Day related to   Gilead's HIV franchise. The company rose to success on the back   of a string of HIV drugs. But could Gilead throw in the towel on   HIV after Biktarvy loses patent exclusivity? Last year at the   Morgan Stanley conference, former CEO John Milligan said that   Biktarvy would   probably be the last HIV pill from Gilead    .",
    "O'Day was more upbeat. He emphasized that Gilead \"hasn't taken   its eyes off the ball\" with respect to HIV at all. For one thing,   O'Day thinks there's a lot more to do with Biktarvy, which   doesn't lose patent protection until 2033. He also mentioned the   tremendous potential for pre-exposure prophylaxis (PrEP), where   Gilead has penetrated only 20% of the market.",
    "More importantly, though, Gilead still has two unmet goals   with respect to HIV: a long-acting therapy and a cure for the   disease. O'Day said that the company remains committed to both   goals, stating that he is \"very bullish about the durability of   the HIV business at Gilead\" over the short, medium, and long   term.",
    "Gilead has high hopes for filgotinib in treating inflammatory   diseases. The company announced in July that it plans to file for   U.S. approval of the drug this year. Gilead hasn't marketed an   inflammation drug before. It's about to jump into a crowded and   highly competitive market. Can the biotech be successful?",
    "O'Day admitted that his \"eyes are wide open on this one.\" It   is a brand-new therapeutic area for Gilead and an area, like   oncology, with several big players that dominate the market.   However, he said that his confidence in filgotinib's ability to   succeed stems from its great efficacy and tolerability. O'Day   acknowledged that Gilead wouldn't have been able to overcome \"a   marginal product profile\" but should be able to win with   filgotinib's strong profile.",
    "While Gilead will submit for regulatory approval of filgotinib   in rheumatoid arthritis first, O'Day said that he's excited the   most about the potential for the drug in treating inflammatory   bowel disease (IBD). But he also thinks that   Gilead's close relationship with   Galapagos      will enable the company to break through efficacy barriers   in treating rheumatoid arthritis through combination therapies.   O'Day's view is that \"filgotinib is kind of an anchor, a way of   getting in\" to more effectively addressing rheumatoid   arthritis.",
    "Gilead hasn't had much success so far with its nonalcoholic   steatohepatitis (NASH) program. Lead NASH candidate selonsertib   flopped in late-stage clinical studies    . Could NASH be an area that Gilead could abandon?",
    "O'Day's reply to this question was a nuanced one. He first   stated that Gilead is committed to its current NASH programs,   which include FXR agonist cilofexor and ACC inhibitor   firsocostat. He also said that he likes that Gilead is targeting   a disease with a really high unmet medical need and has the   opportunity to be best in class at treating NASH.",
    "However, he seemed to hedge a bit by stating that the   biotech's current testing of combination therapies \"will be   telling as to where our strategy goes from here.\" O'Day said that   depending on the outcomes of these clinical studies, Gilead would   either \"accelerate or regroup.\"",
    " Investing in biotech stocks    comes with some level of uncertainty. That's because the world in   which biotechs like Gilead operate isn't always black and white.   Sometimes, the right answer to a question about what's next is:   \"It depends.\" That's basically how Dan O'Day answered the   question about the company's NASH efforts. And it was a good   answer.",
    "Actually, I think that all of O'Day's answers were good ones.   My view is that it's a smart move for Gilead to be very selective   about what it does next in the oncology space. The company is   leading in cell therapy, so building on that lead makes sense   instead of venturing into new territory.",
    "I agree with O'Day's optimism about the prospects for   filgotinib. My take is that the biotech's close alignment with   Galapagos should pay off over the long run.",
    "As for the HIV question, Dan O'Day's answer really didn't   differ from what Gilead executives have been saying for quite a   while. His bullishness about the company's HIV dominance appears   to be warranted, in my view. O'Day will no doubt reveal more over   time about the direction he plans to take Gilead, but so far I   think he's making the right moves.",
    "  10 stocks we like better than Gilead Sciences       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Gilead Sciences wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Gilead Sciences       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Gilead Sciences wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Keith Speights      owns shares of Gilead Sciences. The Motley Fool owns shares of     and recommends Gilead Sciences. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:15:00"
}