{
  "url": "https://www.nasdaq.com/article/colombia-rebels-new-offensive-brings-back-bad-memories-for-businesses-20190904-00878",
  "title": "Colombia rebels' new offensive brings back bad memories for businesses - Nasdaq.com",
  "text": [
    "By Nelson Bocanegra",
    "BOGOTA, Sept 4 (Reuters) - When Colombian businessman Christian Ulloa heard that former members of the FARC rebels had rejected a peace deal with the government and launched a new offensive, he could not help but feel alarm.",
    "Two decades ago, Ulloa's father was held captive for seven months by the Revolutionary Armed Forces of Colombia (FARC), a Marxist rebel group that financed itself through kidnapping, extortion of businesses and drug trafficking.",
    "The offensive - which drew condemnation from other former fighters and the FARC's new political party - could give pause to investors who have begun to look to Latin America's fourth-largest economy as a stable destination for capital, according to industry groups and analysts.",
    "The energy and agriculture sectors - which operate in rural places that often lack state presence - could in particular face security risks.",
    "\"It creates some uncertainty, some insecurity and some fear towards the future,\" said Ulloa, who runs his family's civil engineering consultancy, which advises oil, gas and infrastructure companies.",
    "Some 13,000 ex-guerrillas are involved in a reintegration process, but it has been troubled by delays in payments to fund businesses for ex-fighters, plus the killing of dozens of ex-rebels and right-wing President Ivan Duque's unsuccessful attempts to toughen the terms of the deal.",
    "The former commander Luciano Marin, known by his nom de guerre Ivan Marquez, announced the return to arms in a video on Thursday and said his group would no longer use kidnappings as a financing tool, but would tax multinationals and illegal economic activity.",
    "Marquez - one of the negotiators of the 2016 peace deal - did not specify what kind of illegal activity would be taxed. Before the peace deal the FARC regularly denied participating in drug trafficking, saying that it merely levied duties on traffickers.",
    "The breakaway armed group will seek dialogue with business owners, ranchers, merchants and wealthy individuals to secure contributions to \"the progress of communities,\" Marquez added, without providing further details.",
    "It was not immediately possible to contact the dissident FARC group for further comment.",
    "Some business leaders are confident the dissidents pose no major threat but said investors are watching cautiously nevertheless.",
    "Juan Camilo Narino, the head of the Colombian Mining Association, said Duque's government would be able to contain small groups of dissidents.",
    "\"If you look back a decade, one of the biggest worries for the private sector was insecurity because of these groups. It's not like that now,\" Narino said.",
    "\"But without a doubt these are incidents, messages, which investors will note and based on which they'll make future decisions.\"",
    "Dissident FARC rebels who reject the deal are unlikely to affect security in large urban areas, strategic consulting firm Control Risks said, but the guerrillas will likely stage attacks against energy infrastructure in rural areas.",
    "\"The new FARC is particularly likely to target mining and oil companies, especially fracking activity,\" it added.",
    "State-run Ecopetrol , the country's largest oil company, suffers frequent pipeline bombings which authorities attribute to the leftist National Liberation Army (ELN) rebels - with whom the dissidents in the video said they would seek alliances.",
    "Two FARC dissident fighters were recently convicted for an attack on Continental Gold Inc  that killed three employees last year. ",
    "Dissident rebel forces number some 2,300, according to the military, with some based in areas important to the oil, gas and mining industries. Not all dissidents are under the command of the group of former FARC commanders.",
    "The dissidents' request for dialogue with business is \"surely them looking to coerce in terms of extortion, in terms of kidnapping,\" said Jorge Enrique Bedoya, the head of the Colombian Agricultural Society.",
    "\"The important thing is to back the government, back public institutions to fight against any criminal presence that is presented by these bandits and maintain investor confidence,\" he said.",
    "The government says dissidents are unlikely to affect investor confidence or the economy, which the International Monetary Fund says will have one of the highest growth figures in the region this year. ",
    "\"There are deeper reasons for the investment dynamic in a country,\" Commerce, Industry and Tourism Minister Jose Manuel Restrepo told journalists last week. \"Reasons related to monetary policy or fiscal policy, with the opportunities there are in an economy.\"",
    "But despite government reassurance, some investors remain cautious.",
    "\"You can't overestimate the capacity of these criminals in the face of a firm government and a committed armed forces,\" said Colombian Ranching Association President Jose Felix Lafaurie. \"But you can't underestimate them either.\""
  ],
  "published_datetime": "2019-09-04 12:26:00"
}