{
  "url": "https://www.nasdaq.com/article/after-hours-oracle-whiffs-on-q1-revenue-apple-a-trillionaire-once-again-cm1210830",
  "title": "After Hours: Oracle Whiffs on Q1 Revenue, Apple a Trillionaire Once Again - Nasdaq.com",
  "text": [
    " Compared to the previous two days, the after-hours scene   tonight is relatively calm. Yet as always there are a few   developments moving the needle for certain companies. These are taking place mainly with   tech stocks    , in particular   Oracle    (NYSE: ORCL) and   Apple    (NASDAQ: AAPL) . Here is what's happening lately with these two   giants.   Apple CEO Tim Cook during the company's September 2019     event. Image source: Apple.makeArticleAd();  Oracle Q1: Revenue miss, CEO hiatus  Oracle   report    ed its first set of fiscal 2020 results after the closing bell   today. The database king also had some news about one of its top   executives. The company's Q1 revenue came in at $9.22 billion, which was   marginally higher than what it made in the same quarter last   year.   Non-GAAP    (adjusted) net income was $2.76 billion, or $0.81 per share. That   was shy of the $2.85 billion ($0.71) the company netted in Q1   2019. That bottom-line figure met analyst expectations. Those   prognosticators, however, were collectively anticipating $9.29   billion in revenue. Oracle pointed to the earnings-per-share growth as a   particular bright spot for it during the quarter, and said it   expected the trend to continue. \"As our low margin hardware   businesses continue to get smaller, while our higher margin cloud   business continues to get bigger, we expect Oracle's operating   margins, earnings per share and free cash flow all to grow,\" the   company wrote in the earnings release. Additionally, Oracle said its board of directors has lifted   the authorization for share buybacks by $15 billion. Finally, the company said its co-CEO Mark Hurd is taking a   leave of absence for what it described as \"health related   reasons.\" It did not elaborate. Hurd will be replaced during his   absence by Larry Ellison, Oracle's high-profile founder and CTO,   and the other CEO, Safra Catz. In spite of the revenue disappointment, Oracle remains a very   strong performer in its corner of the tech industry. Investors   don't seem too spooked by the recent performance -- perhaps   they're somewhat comforted by the big increase in share   repurchase authorization. Oracle stock is trading down only   slightly this evening. Apple maintains trillion-dollar market cap Apple, which rejoined the Trillionaire's Club today when its   market capitalization reached that lofty number, is adding to it   this evening. The company's shares are up slightly in   after-market action. Although this is not the first time Apple has crossed the $1   trillion mark, today marks the first time in 2019 the stock has   traded so richly. Not coincidentally, the boost in the share   price comes after the company's latest product unveiling, in   which it announced relatively bargain prices for its upcoming   iPhone 11 line. This is being seen by many as a smart move to   combat softening unit sales. Additionally, investors seem pleased at the pricing of another   product that's bound to find an audience -- the company's   Apple TV+ streaming service    . The $4.99-per-month price point makes it competitive with the   likes of streaming leader   Netflix    and   Walt Disney    , a recent but powerful entrant in the segment. Some also have   high hopes for the similarly priced Apple Arcade gaming   subscription service. Of course, these are new ventures and it remains to be seen   just how much of an audience Apple can hook with them. Judging by   the stock's recent jumps, the market is confident that the   company can rope in subscribers.   10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Eric Volkman      owns shares of Walt Disney. The Motley Fool owns shares of and     recommends Apple, Netflix, and Walt Disney. The Motley Fool has     the following options: long January 2021 $60 calls on Walt     Disney, short October 2019 $125 calls on Walt Disney, short     January 2020 $155 calls on Apple, long January 2020 $150 calls     on Apple, short January 2020 $155 calls on Apple, and long     January 2020 $150 calls on Apple. The Motley Fool has a     disclosure policy      .  ",
    "Compared to the previous two days, the after-hours scene   tonight is relatively calm. Yet as always there are a few   developments moving the needle for certain companies.",
    "These are taking place mainly with   tech stocks    , in particular   Oracle    (NYSE: ORCL) and   Apple    (NASDAQ: AAPL) . Here is what's happening lately with these two   giants.",
    "  Apple CEO Tim Cook during the company's September 2019     event. Image source: Apple.makeArticleAd(); ",
    "Apple CEO Tim Cook during the company's September 2019     event. Image source: Apple.",
    " Oracle   report    ed its first set of fiscal 2020 results after the closing bell   today. The database king also had some news about one of its top   executives.",
    "The company's Q1 revenue came in at $9.22 billion, which was   marginally higher than what it made in the same quarter last   year.   Non-GAAP    (adjusted) net income was $2.76 billion, or $0.81 per share. That   was shy of the $2.85 billion ($0.71) the company netted in Q1   2019.",
    "That bottom-line figure met analyst expectations. Those   prognosticators, however, were collectively anticipating $9.29   billion in revenue.",
    "Oracle pointed to the earnings-per-share growth as a   particular bright spot for it during the quarter, and said it   expected the trend to continue. \"As our low margin hardware   businesses continue to get smaller, while our higher margin cloud   business continues to get bigger, we expect Oracle's operating   margins, earnings per share and free cash flow all to grow,\" the   company wrote in the earnings release.",
    "Additionally, Oracle said its board of directors has lifted   the authorization for share buybacks by $15 billion.",
    "Finally, the company said its co-CEO Mark Hurd is taking a   leave of absence for what it described as \"health related   reasons.\" It did not elaborate. Hurd will be replaced during his   absence by Larry Ellison, Oracle's high-profile founder and CTO,   and the other CEO, Safra Catz.",
    "In spite of the revenue disappointment, Oracle remains a very   strong performer in its corner of the tech industry. Investors   don't seem too spooked by the recent performance -- perhaps   they're somewhat comforted by the big increase in share   repurchase authorization. Oracle stock is trading down only   slightly this evening.",
    "Apple, which rejoined the Trillionaire's Club today when its   market capitalization reached that lofty number, is adding to it   this evening. The company's shares are up slightly in   after-market action.",
    "Although this is not the first time Apple has crossed the $1   trillion mark, today marks the first time in 2019 the stock has   traded so richly. Not coincidentally, the boost in the share   price comes after the company's latest product unveiling, in   which it announced relatively bargain prices for its upcoming   iPhone 11 line. This is being seen by many as a smart move to   combat softening unit sales.",
    "Additionally, investors seem pleased at the pricing of another   product that's bound to find an audience -- the company's   Apple TV+ streaming service    . The $4.99-per-month price point makes it competitive with the   likes of streaming leader   Netflix    and   Walt Disney    , a recent but powerful entrant in the segment. Some also have   high hopes for the similarly priced Apple Arcade gaming   subscription service.",
    "Of course, these are new ventures and it remains to be seen   just how much of an audience Apple can hook with them. Judging by   the stock's recent jumps, the market is confident that the   company can rope in subscribers.",
    "  10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Apple       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Apple wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Eric Volkman      owns shares of Walt Disney. The Motley Fool owns shares of and     recommends Apple, Netflix, and Walt Disney. The Motley Fool has     the following options: long January 2021 $60 calls on Walt     Disney, short October 2019 $125 calls on Walt Disney, short     January 2020 $155 calls on Apple, long January 2020 $150 calls     on Apple, short January 2020 $155 calls on Apple, and long     January 2020 $150 calls on Apple. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:28:00"
}