{
  "url": "https://www.nasdaq.com/article/south-african-drugmaker-aspen-lowers-debt-shares-jump-20190903-00536",
  "title": "South African drugmaker Aspen lowers debt, shares jump - Nasdaq.com",
  "text": [
    "JOHANNESBURG, Sept 3 (Reuters) - Aspen Pharmacare Holdings Ltd  said on Tuesday its debt as of June 30 had fallen below 40 billion rand ($2.63 billion) and that levels were safely below a covenant threshold, sending shares in the South African drugmaker up more than 9%.",
    "The firm, which has a market value of 35 billion rand, built up debt as it shifted from being a mainly generics business in a few countries into a multinational with specialist therapies, including for thrombosis.",
    "Aspen's debt stood at 53.5 billion rand at the end of 2018, more than six times than in 2013, when it went on an acquisition spree, snapping up blood-clot treatment brands, a manufacturing plant from GlaxoSmithKline  and the rights to anaesthetics from AstraZeneca .",
    "Its shares have tumbled nearly 70% since September 2018, when the company said it was selling its infant formula business.",
    "The leverage ratio, which assesses the ability of a firm to meet its financial obligations, is expected to end between 3.60x and 3.70x against a covenant threshold of 4.0x, it said in a trading statement.",
    "Aspen shares jumped nearly 14% after its trading statement to a level last seen on Aug.5, before paring gains to trade 9.68% firmer at 84.27 rand as of 1339 GMT.",
    "Aspen, which operates in Europe, said reported revenue for the year ended June 30 would either be flat or rise 2%, while on constant exchange rates revenue is expected to be flat or decline by 3% when it reports its annual results on Sept. 11.",
    "The largest pharmaceutical company in Africa said it performed a rigorous impairment testing of tangible and intangible asset values once again, resulting in total impairments of 3 billion rand.",
    "\"Contributing factors to these impairments are expected pressure on the oncology portfolio in Europe and the restructuring of certain production facilities to align these with production process improvements and expected future manufacturing requirements,\" it said.",
    "Normalised headline earnings per share from continuing operations is seen falling between 5% and 9% from a restated 1,518.5 cents. ",
    "($1 = 15.2369 rand)"
  ],
  "published_datetime": "2019-09-03 08:28:00"
}