{
  "url": "https://www.nasdaq.com/article/why-target-tgt-is-a-great-dividend-stock-right-now-cm1210476",
  "title": "Why Target (TGT) is a Great Dividend Stock Right Now - Nasdaq.com",
  "text": [
    " Whether it's through stocks, bonds, ETFs, or other types of securities, all investors love seeing their portfolios score big returns. But when you're an income investor, your primary focus is generating consistent cash flow from each of your liquid investments. While cash flow can come from bond interest or interest from other types of investments, income investors hone in on dividends. A dividend is that coveted distribution of a company's earnings paid out to shareholders, and investors often view it by its dividend yield, a metric that measures the dividend as a percent of the current stock price. Many academic studies show tha t dividends  make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.  Target in Focus  Target (TGT) is headquartered in Minneapolis, and is in the Retail-Wholesale sector. The stock has seen a price change of 64.67% since the start of the year. The retailer is paying out a dividend of $0.66 per share at the moment, with a dividend yield of 2.43% compared to the Retail - Discount Stores industry's yield of 0.82% and the S&P 500's yield of 1.9%. Looking at dividend growth, the company's current annualized dividend of $2.64 is up 4.8% from last year. Target has increased its dividend 5 times on a year-over-year basis over the last 5 years for an average annual increase of 6.39%. Any future dividend growth will depend on both earnings growth and the company's payout ratio; a payout ratio is the proportion of a firm's annual earnings per share that it pays out as a dividend. Target's current payout ratio is 43%, meaning it paid out 43% of its trailing 12-month EPS as dividend. Earnings growth looks solid for TGT for this fiscal year. The Zacks Consensus Estimate for 2019 is $6.13 per share, with earnings expected to increase 13.73% from the year ago period.  Bottom Line  Investors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. However, not all companies offer a quarterly payout. Big, established firms that have more secure profits are often seen as the best dividend options, but it's fairly uncommon to see high-growth businesses or tech start-ups offer their stockholders a dividend. Income investors must be conscious of the fact that high-yielding stocks tend to struggle during periods of rising interest rates. With that in mind, TGT presents a compelling investment opportunity; it's not only an attractive dividend play, but the stock also boasts a strong Zacks Rank of #2 (Buy).   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Target Corporation (TGT): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Whether it's through stocks, bonds, ETFs, or other types of securities, all investors love seeing their portfolios score big returns. But when you're an income investor, your primary focus is generating consistent cash flow from each of your liquid investments.",
    "While cash flow can come from bond interest or interest from other types of investments, income investors hone in on dividends. A dividend is that coveted distribution of a company's earnings paid out to shareholders, and investors often view it by its dividend yield, a metric that measures the dividend as a percent of the current stock price. Many academic studies show tha t dividends  make up large portions of long-term returns, and in many cases, dividend contributions surpass one-third of total returns.",
    " Target in Focus ",
    "Target (TGT) is headquartered in Minneapolis, and is in the Retail-Wholesale sector. The stock has seen a price change of 64.67% since the start of the year. The retailer is paying out a dividend of $0.66 per share at the moment, with a dividend yield of 2.43% compared to the Retail - Discount Stores industry's yield of 0.82% and the S&P 500's yield of 1.9%.",
    "Looking at dividend growth, the company's current annualized dividend of $2.64 is up 4.8% from last year. Target has increased its dividend 5 times on a year-over-year basis over the last 5 years for an average annual increase of 6.39%. Any future dividend growth will depend on both earnings growth and the company's payout ratio; a payout ratio is the proportion of a firm's annual earnings per share that it pays out as a dividend. Target's current payout ratio is 43%, meaning it paid out 43% of its trailing 12-month EPS as dividend.",
    "Earnings growth looks solid for TGT for this fiscal year. The Zacks Consensus Estimate for 2019 is $6.13 per share, with earnings expected to increase 13.73% from the year ago period.",
    " Bottom Line ",
    "Investors like dividends for many reasons; they greatly improve stock investing profits, decrease overall portfolio risk, and carry tax advantages, among others. However, not all companies offer a quarterly payout.",
    "Big, established firms that have more secure profits are often seen as the best dividend options, but it's fairly uncommon to see high-growth businesses or tech start-ups offer their stockholders a dividend. Income investors must be conscious of the fact that high-yielding stocks tend to struggle during periods of rising interest rates. With that in mind, TGT presents a compelling investment opportunity; it's not only an attractive dividend play, but the stock also boasts a strong Zacks Rank of #2 (Buy).",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:15:10"
}