{
  "url": "https://www.nasdaq.com/article/why-appian-stock-skyrocketed-51-in-august-cm1207087",
  "title": "Why Appian Stock Skyrocketed 51% in August - Nasdaq.com",
  "text": [
    " What happened  Appian    (NASDAQ: APPN)  stock soared 51.4% in August, according to   data from   S&P Global Market Intelligence    . Shares of the low-code software development platform provider   have gained 114% in 2019 through Sept. 3, making it one of this   year's best-performing   software-as-a-service    (SaaS) stocks. The   S&P 500    , including dividends, fell 1.6% last month and has returned   17.5% so far this year.   Image source: Getty Images.makeArticleAd();  So what We can attribute Appian stock's robust August performance   largely to the company's Aug. 8 release of   second-quarter results    that pleased investors. Shares popped 19% the next day and   tacked on about 38% in the six-day period following the   release. The recen   t earnings    release likely brought Appian to the attention of new investors,   as the Virginia-based company only went public two years ago. In the second quarter, Appian's total revenue grew 12% year   over year to $66.9 million, led by subscription revenue's 41%   jump to $38 million. Professional revenue, which comprises the   bulk of the remaining revenue, only grew 3%, but this   lower-margin revenue is \"lumpy\" from quarter to quarter.   GAAP    (generally accepted accounting principles) net loss was $9.4   million, or $0.15 per share, compared with a net loss of $11   million, or $0.18 per share, in the year-ago period.        Adjusted for one-time items, the net loss contracted to $6.6   million, or $0.10 per share, from $8.8 million, or $0.14 per   share, in the second quarter of last year. Wall Street was expecting Appian to post an adjusted loss of   $0.17 per share on revenue of $63.5 million, so the company   comfortably beat the consensus estimates for both the top and   bottom lines. Now what For the third quarter, Appian guided for total revenue of $65   million to $65.5 million, representing growth of 18% to 19% year   over year. Furthermore, it expects subscription revenue to come   in between $38.8 million and $39 million, or grow about 32% to   33%. The company forecasts an adjusted net loss per   share of $0.16 to $0.15. Management also raised its full-year 2019 revenue projection   and slightly lowered its bottom-line outlook. It now expects:  Revenue of $260.5 million to $262.5 million, or growth of     15% to 16% year over year. Its previous guidance was for     revenue between $255 million and $258 million. An adjusted loss per share between $0.55 and $0.51, which     compares with an adjusted loss per share of $0.54 in 2018. Its     previous outlook was for an adjusted loss per share of $0.55 to     $0.50.    Find out why Appian is one of the 10 best stocks to buy now  Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* Tom and David just revealed their ten top stock picks for     investors to buy right now. Appian     is on the list      -- but there are nine others you may be overlooking.  Click here to get access to the full       list!     *Stock Advisor returns as of June 1, 2019       Beth McKenna      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Appian. The Motley Fool has a     disclosure policy      .  ",
    " Appian    (NASDAQ: APPN)  stock soared 51.4% in August, according to   data from   S&P Global Market Intelligence    . Shares of the low-code software development platform provider   have gained 114% in 2019 through Sept. 3, making it one of this   year's best-performing   software-as-a-service    (SaaS) stocks.",
    "The   S&P 500    , including dividends, fell 1.6% last month and has returned   17.5% so far this year.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "We can attribute Appian stock's robust August performance   largely to the company's Aug. 8 release of   second-quarter results    that pleased investors. Shares popped 19% the next day and   tacked on about 38% in the six-day period following the   release.",
    "The recen   t earnings    release likely brought Appian to the attention of new investors,   as the Virginia-based company only went public two years ago.",
    "In the second quarter, Appian's total revenue grew 12% year   over year to $66.9 million, led by subscription revenue's 41%   jump to $38 million. Professional revenue, which comprises the   bulk of the remaining revenue, only grew 3%, but this   lower-margin revenue is \"lumpy\" from quarter to quarter.   GAAP    (generally accepted accounting principles) net loss was $9.4   million, or $0.15 per share, compared with a net loss of $11   million, or $0.18 per share, in the year-ago period.        Adjusted for one-time items, the net loss contracted to $6.6   million, or $0.10 per share, from $8.8 million, or $0.14 per   share, in the second quarter of last year.",
    "Wall Street was expecting Appian to post an adjusted loss of   $0.17 per share on revenue of $63.5 million, so the company   comfortably beat the consensus estimates for both the top and   bottom lines.",
    "For the third quarter, Appian guided for total revenue of $65   million to $65.5 million, representing growth of 18% to 19% year   over year. Furthermore, it expects subscription revenue to come   in between $38.8 million and $39 million, or grow about 32% to   33%. The company forecasts an adjusted net loss per   share of $0.16 to $0.15.",
    "Management also raised its full-year 2019 revenue projection   and slightly lowered its bottom-line outlook. It now expects:",
    "  Find out why Appian is one of the 10 best stocks to buy now  Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* Tom and David just revealed their ten top stock picks for     investors to buy right now. Appian     is on the list      -- but there are nine others you may be overlooking.  Click here to get access to the full       list!     *Stock Advisor returns as of June 1, 2019    ",
    " Find out why Appian is one of the 10 best stocks to buy now ",
    "Motley Fool co-founders Tom and David Gardner have spent     more than a decade beating the market. After all, the     newsletter they have run for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "Tom and David just revealed their ten top stock picks for     investors to buy right now. Appian     is on the list      -- but there are nine others you may be overlooking.",
    " Click here to get access to the full       list! ",
    " *Stock Advisor returns as of June 1, 2019 ",
    "  Beth McKenna      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Appian. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:15:00"
}