{
  "url": "https://www.nasdaq.com/article/oil-prices-slip-after-surprise-build-in-us-inventories-20190904-01209",
  "title": "Oil prices slip after surprise build in U.S. inventories - Nasdaq.com",
  "text": [
    "TOKYO, Sept 5 (Reuters) - Oil prices fell on Thursday, giving up some of the strong gains of the previous session, after an industry report showed U.S. crude stockpiles rose last week, against analyst expectations of a decline.",
    "Brent crude was down 18 cents, or 0.3%, at $60.52 a barrel by 0040 GMT. On Wednesday, Brent rose 4.2 percent.",
    "West Texas Intermediate (WTI) was down 23 cents, or 0.4%, at $56.03 a barrel, having risen 4.3% the previous session, the biggest percentage gain in nearly two months.",
    "Crude inventories rose by 401,000 barrels in the week ended Aug. 30 to 429.1 million, compared with analysts' expectations for a decrease of 2.5 million barrels.",
    "Crude stocks at the Cushing, Oklahoma, delivery hub fell by 238,000 barrels, while refinery crude runs fell by 306,000 barrels per day, API said.",
    "Oil prices surged on Wednesday after a survey showed that activity in China's services sector expanded at the fastest pace in three months in August as new orders rose. ",
    "China is the world's second-largest oil consumer and largest importer.",
    "But as evidence mounts that the trade war between the United States and China is hitting economies worldwide, oil demand growth expectations have been trimmed.",
    "BP Plc's  Chief Financial Officer Brian Gilvary told Reuters that global oil demand is expected to grow by less than 1 million barrels per day in 2019 as consumption slows. ",
    "U.S. President Donald Trump also warned on Tuesday he would be \"tougher\" on Beijing if he wins a second term should trade talks drag on, adding to fears of a possible U.S. recession. ",
    "Still, supply looks set to stay constrained as Russian officials and sources from the Organization of the Petroleum Exporting Countries (OPEC) indicated the countries remain committed to an agreement to rein in production to support prices. "
  ],
  "published_datetime": "2019-09-04 08:53:00"
}