{
  "url": "https://www.nasdaq.com/article/3-top-e-commerce-stocks-to-buy-right-now-cm1206881",
  "title": "3 Top E-Commerce Stocks to Buy Right Now - Nasdaq.com",
  "text": [
    "Many high-growth e-commerce stocks recently tumbled on fears about the trade war and the inversion of the yield curve signaling a possible recession. But a handful of e-commerce stocks still have plenty of room to run in this difficult market. Today, three of our Motley Fool contributors will highlight JD.com (NASDAQ: JD) , Wayfair (NYSE: W) , and Splunk (NASDAQ: SPLK) -- companies that deserve to go higher despite the near-term macro challenges.",
    "Leo Sun(JD.com): JD is the largest direct retailer and second largest e-commerce player in China after Alibaba (NYSE: BABA) . Unlike Alibaba, JD takes on inventories and runs its own fulfillment and logistics services. That business model is more capital-intensive than Alibaba's, but it's better shielded from counterfeit products.",
    "Image source: Getty Images.",
    "JD seemed to be in deep trouble last year, as its growth accelerated, its costs rose, and it struggled to remain profitable. A rape allegation against CEO Richard Liu and the escalating trade war exacerbated the pain.",
    "The criminal charges against Liu were eventually dropped, and JD's latest quarter indicates that the e-tailer has finally turned a corner . JD's second-quarter revenue rose 23% annually, marking its strongest growth in three quarters. It expects that momentum to continue with 20% to 24% growth in the third quarter.",
    "Much of that growth was fueled by higher demand for higher-ticket items like electronics and home appliances -- indicating that consumer spending in China remains robust in the shadow of the trade war. JD's adjusted net profit also surged more than sevenfold as JD Logistics' gross margin hit the break-even point for the first time ever. JD is also providing logistics to other companies as a third-party service, which will diversify its revenue streams beyond its core commerce business.",
    "It also expects to remain consistently profitable for the year with a net profit margin of 1.4% to 1.7%. That's a big improvement from previous years, and indicates that economies of scale are kicking in -- which will make it tough for smaller rivals to compete while staying profitable. Despite all that good news, JD still trades at less than one time this year's sales -- so it could rebound quickly if investors develop an appetite for Chinese stocks again.",
    "Demitri Kalogeropoulos(Wayfair) : Home furnishings specialist Wayfair has seen its stock return to roughly market-return levels after having nearly doubled at one point in 2019. Not much about the business story has changed in that time, though, which means investors are simply getting a better deal today.",
    "Sure, Wayfair is no closer to achieving profitability. Instead, net losses ballooned over the first half of the year and are expected to jump again in the hiring buildup before the key holiday season. But look closer and you'll see gathering evidence o f earnings strength. Advertising spending is falling as a percentage of sales, repeat-customer orders are hitting new highs, and Wayfair's active customer base is barreling toward 20 million shoppers.",
    "CEO Niraj Shah and his team issued a conservative outlook  for the third quarter. That caution, plus spiking volatility in the broader market, helped push shares down in recent weeks despite the company reporting its fifth straight quarter of surprisingly strong growth in August. As a result, investors who believe management's target of robust profitability is achievable over the long term might want to buy shares of Wayfair as it lines up another year of market share gains.",
    "Steve Symington(Splunk): I'll admit that Splunk isn't exactly a pure play in e-commerce. But it boasts more than 18,000 enterprise customers -- including 92 members of the Fortune 100 -- that use its industry leading operational-intelligence platform to create actionable insights from their unstructured machined data. So it should come as no surprise that Splunk helps many of them massively improve their e-commerce and customer-experience efforts.",
    "Consider Domino's Pizza (NYSE: DPZ) , which Splunk says has long used its software \"to support its entire e-commerce environment.\" That includes everything from digging into previously difficult-to-process log files and troubleshooting issues, to providing invaluable feedback to support the pizza chain's web developers and marketing teams.",
    "Image source: Getty Images.",
    "Lucky for investors today, Splunk shares recently pulled back hard even though the company absolutely smashed analysts' estimates for revenue and earnings in its most recent quarter, then raised its full-year revenue guidance. The culprit for its drop? Splunk also significantly lowered its full-year cash flow targets , citing its faster-than-expected shift away from perceptual licenses and toward a cloud-based, renewable-term license model.",
    "But make no mistake: While the timing of Splunk's cash collections is being affected in the near term, investors should be applauding the momentum that its underlying business is showing. As Splunk's renewable cloud offerings continue to gain steam, it should mean higher gross margins and more predictable revenue streams over the long term.",
    "For patient investors willing to buy now and watch that shift continue to play out, I think Splunk stock is currently one of the most compelling values the market has to offer.",
    "10 stocks we like better than Splunk\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Splunk wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Demitrios Kalogeropoulos has no position in any of the stocks mentioned. Leo Sun owns shares of JD.com. Steve Symington has no position in any of the stocks mentioned. The Motley Fool owns shares of and recommends JD.com, Splunk, and Wayfair. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:00:00"
}