{
  "url": "https://www.nasdaq.com/article/validea-john-neff-strategy-daily-upgrade-report-952019-cm1207696",
  "title": "Validea John Neff Strategy Daily Upgrade Report - 9/5/2019 - Nasdaq.com",
  "text": [
    "The following are today's upgrades for Validea's Low PE Investor model based on the published strategy of John Neff . This strategy looks for firms with persisten t earnings growth that trade at a discount relative to their earnings growth and dividend yield.",
    "GREAT WESTERN BANCORP INC ( GWB ) is a small-cap value stock in the Regional Banks industry. The rating according to our strategy based on John Neff changed from 60% to 79% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Great Western Bancorp, Inc. is a full-service regional bank holding company. The Company is the holding company of the Great Western Bank (the Bank). As of September 30, 2016, the Company served customers through 173 branches in various markets in Arizona, Colorado, Iowa, Kansas, Minnesota, Missouri, Nebraska, North Dakota and South Dakota. The Company focuses on business and agribusiness banking, complemented by retail banking and wealth management services. The Company's loan portfolio consists primarily of business loans, consisting of commercial and industrial loans (C&I), commercial real estate loans and agribusiness loans. The Company offers its business banking customers a focused range of financial products designed to meet the specific needs of their businesses, including loans, lines of credit, cash management services, online business deposit and wire transfer services, in addition to non-interest-bearing demand deposit and savings accounts, and corporate credit cards.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "SMARTFINANCIAL INC ( SMBK ) is a small-cap value stock in the Regional Banks industry. The rating according to our strategy based on John Neff changed from 62% to 81% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: SmartFinancial, Inc., formerly Cornerstone Bancshares, Inc., is a bank holding company. The Company operates through its SmartBank subsidiary (The Bank). The principal business of the Bank consists of attracting deposits from the public and investing those funds, together with funds generated from operations and from principal and interest payments on loans. It offers commercial real estate-mortgage, consumer real estate-mortgage, construction and land development, commercial and industrial, and consumer and other loans. The Bank's investment portfolio consists of Federal agency bonds, mortgage-backed securities, and state and municipal securities. The Bank provides a range of deposit services to businesses and individuals, including non-interest bearing checking accounts, interest bearing checking accounts, savings accounts, money market accounts, individual retirement accounts (IRAs) and certificates of deposit (CDs). SmartBank operates in approximately 28 branches.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "SIGNATURE BANK ( SBNY ) is a mid-cap value stock in the Regional Banks industry. The rating according to our strategy based on John Neff changed from 60% to 79% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Signature Bank is a full-service commercial bank. The Bank operates over 30 private client offices throughout the New York metropolitan area. Its segments include Commercial Banking and Specialty Finance. It offers a range of business and personal banking products and services. Its specialty finance subsidiary, Signature Financial LLC (Signature Financial), provides equipment finance and leasing services. Signature Securities Group Corporation, a subsidiary of Bank, is a licensed broker-dealer, investment advisor offering investment, brokerage, asset management and insurance products and services. The Commercial Banking segment consists of commercial real estate lending, commercial and industrial lending, and commercial deposit gathering activities. The Specialty Finance segment consists of financing and leasing products, including equipment, transportation, taxi medallion, commercial marine, commercial vehicle, municipal and national franchise financing and/or leasing.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "PZENA INVESTMENT MANAGEMENT, INC. ( PZN ) is a small-cap value stock in the Investment Services industry. The rating according to our strategy based on John Neff changed from 60% to 79% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Pzena Investment Management, Inc. is a holding company. The Company is the sole managing member of Pzena Investment Management, LLC. Pzena Investment Management, LLC is an investment management company. The Company also serves as the general partner of Pzena Investment Management, LP. The Company offers institutional investment products to public and corporate pension funds, endowments, foundations and certain commingled vehicles geared toward institutional investors. The Company also offers access to certain of its global and non-United States strategies through private placement vehicles and collective investment trusts. Pzena Investment Management, LLC is its operating company. Pzena Investment Management, LLC consists of Class A and Class B membership units.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "M&T BANK CORPORATION ( MTB ) is a large-cap value stock in the Regional Banks industry. The rating according to our strategy based on John Neff changed from 81% to 100% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: M&T Bank Corporation (M&T) is a bank holding company. As of December 31, 2016, M&T had two bank subsidiaries: Manufacturers and Traders Trust Company (M&T Bank) and Wilmington Trust, National Association (Wilmington Trust, N.A.). The Company, along with its subsidiaries, offers a range of retail and commercial banking, trust and wealth management, and investment services. Its segments are Business Banking, which provides a range of services to small businesses and professionals; Commercial Banking, which provides a range of credit products and banking services; Commercial Real Estate, which provides credit and deposit services; Discretionary Portfolio, which includes investment and trading account securities, residential real estate loans and other assets, and short-term and long-term borrowed funds; Residential Mortgage Banking, which originates and services residential mortgage loans, and Retail Banking, which services to consumers through various delivery channels.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "FIRST MERCHANTS CORPORATION (FRME) is a small-cap value stock in the Regional Banks industry. The rating according to our strategy based on John Neff changed from 62% to 81% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: First Merchants Corporation is a financial holding company. The Company has a bank charter, First Merchants Bank (the Bank), which is opened for business in Muncie, Indiana. It operates through community banking business segment. The Bank also operates Lafayette Bank and Trust, and First Merchants Private Wealth Advisors (each as a division of First Merchants Bank). As of July 17, 2017, the Bank included 122 banking centers in Indiana, Illinois and Ohio counties. In addition to its branch network, the Company's delivery channels include automated teller machines, check cards and Internet technology. Through the Bank, it offers a range of financial services, including accepting time deposits, savings and demand deposits; making consumer, commercial and real estate mortgage loans; renting safe deposit facilities; providing personal and corporate trust services, and providing other corporate services, letters of credit and repurchase agreements.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "S & T BANCORP INC (STBA) is a small-cap value stock in the Regional Banks industry. The rating according to our strategy based on John Neff changed from 62% to 81% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: S&T Bancorp, Inc. (S&T) is a bank holding company. The Company operates through three segments: Community Banking, Wealth Management and Insurance. The Community Banking segment offers services, which include accepting time and demand deposits, and originating commercial and consumer loans. The Wealth Management segment offers brokerage services, serves as executor and trustee under wills and deeds and as guardian and custodian of employee benefits and provides other trust services. In addition, it is a registered investment advisor that manages private investment accounts for individuals and institutions. The insurance segment includes an insurance agency offering commercial property and casualty insurance, group life and health coverage, employee benefit solutions and personal insurance lines. The Company's subsidiaries include S&T Bank, 9th Street Holdings, Inc. and STBA Capital Trust I.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "SANDY SPRING BANCORP INC. (SASR) is a small-cap value stock in the Regional Banks industry. The rating according to our strategy based on John Neff changed from 62% to 81% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Sandy Spring Bancorp, Inc. is the bank holding company for Sandy Spring Bank (the Bank). The Company operates through three segments: Community Banking, Insurance and Investment Management. The Company's Community Banking segment operates through Sandy Spring Bank and involves delivering a range of financial products and services, including various loan and deposit products to both individuals and businesses. The Insurance segment operates through Sandy Spring Insurance Corporation, a subsidiary of the Bank, and offers annuities as an alternative to traditional deposit accounts. The Investment Management segment operates through West Financial Services, Inc., a subsidiary of the Bank, which provides investment management and financial planning services. As of December 31, 2016, the Bank conducted commercial banking business through 44 community offices and six financial centers located in Central Maryland, Northern Virginia and Washington D.C.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "VALLEY NATIONAL BANCORP (VLY) is a mid-cap value stock in the Regional Banks industry. The rating according to our strategy based on John Neff changed from 81% to 100% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Valley National Bancorp is the bank holding company for Valley National Bank (the Bank). The Bank provides a range of commercial, retail, insurance and wealth management financial services products. The Company's segments include Consumer Lending, Commercial Lending, Investment Management, and Corporate and Other Adjustments. The Consumer Lending segment primarily includes residential mortgages, home equity loans and automobile loans. The Commercial Lending segment primarily includes floating rate and adjustable rate commercial and industrial loans, as well as fixed rate owner occupied and commercial real estate loans. The Investment Management segment includes the Company's investments in various types of securities. As of July 26, 2017, the Bank operated 200 branch locations serving northern and central New Jersey, the New York City boroughs of Manhattan, Brooklyn, Queens and Long Island, and Florida.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "WEBSTER FINANCIAL CORPORATION (WBS) is a mid-cap value stock in the Regional Banks industry. The rating according to our strategy based on John Neff changed from 81% to 100% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    "Company Description: Webster Financial Corporation is a bank and financial holding company. The Company's segments include Commercial Banking, Community Banking, HSA Bank, Private Banking, and Corporate and Reconciling. The Commercial Banking segment includes middle-market, asset-based lending, commercial real estate, equipment finance, and treasury and payment solutions, which includes government and institutional banking. The Community Banking segment consists of its Personal Banking and Business Banking segments. HSA Bank, a division of its subsidiary, Webster Bank, National Association, offers health savings accounts, health reimbursement accounts, flexible spending accounts, and other financial solutions. Private Banking serves high-net-worth clients, not-for-profit organizations, and business clients with asset management, trust, loan and deposit products, and financial planning services. Its treasury unit and consumer-liquidating portfolio are included in the Corporate and Reconciling segment.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here",
    "Since its inception, Validea's strategy based on John Neff has returned 283.42% vs. 165.03% for the S&P 500. For more details on this strategy, click here",
    "About John Neff : While known as the manager with whom many top managers entrusted their own money, Neff was far from the smooth-talking, high-profile Wall Streeter you might expect. He was mild-mannered and low-key, and the same might be said of the Windsor Fund that he managed for more than three decades. In fact, Neff himself described the fund as \"relatively prosaic, dull, [and] conservative.\" There was nothing dull about his results, however. From 1964 to 1995, Neff guided Windsor to a 13.7 percent average annual return, easily outpacing the S&P 500's 10.6 percent return during that time. That 3.1 percentage point difference is huge over time -- a $10,000 investment in Windsor (with dividends reinvested) at the start of Neff's tenure would have ended up as more than $564,000 by the time he retired, more than twice what the same investment in the S&P would have yielded (about $233,000). Considering the length of his tenure, that track record may be the best ever for a manager of such a large fund.",
    "About Validea : Validea is an investment research service that follows the published strategies of investment legends. Validea offers both stock analysis and model portfolios based on gurus who have outperformed the market over the long-term, including Warren Buffett, Benjamin Graham, Peter Lynch and Martin Zweig. For more information about Validea, click here",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 08:03:52"
}