{
  "url": "https://www.nasdaq.com/article/heres-how-emergent-biosolutions-procured-a-higher-price-today-cm1206871",
  "title": "Here's How Emergent BioSolutions Procured a Higher Price Today - Nasdaq.com",
  "text": [
    "Shares of Emergent BioSolutions (NYSE: EBS) are up 14% at 11:55 a.m. EDT after the bioterrorism expert was awarded a contract by the U.S. Department of Health and Human Services to deliver approximately $2 billion worth of smallpox vaccine ACAM2000 to the U.S. strategic national stockpile over the next 10 years.",
    "The contract will start with $170 million in the first year, with the government having nine additional option years.",
    "Image source: Getty Images.",
    "Having contracts with the government is a substantial advantage Emergent BioSolutions has compared to other biotech companies when it comes to predicting sales. But between contracts, there's increased risk that the sides might not come to terms for a new contract, so some of today's move just comes from relief that there's a contract in place.",
    "But investors are equally excited about the size of the contract. The previous 10-year contract, which was negotiated by Acambis (a vaccine maker acquired by partner Sanofi (NASDAQ: SNY) ) was only for $425 million, with about a third of that attributable to license maintenance activities.",
    "Emergent BioSolutions bought ACAM2000 plus a manufacturing plant and a lease on a facility that fills vials with drugs from Sanofi for $125 million in 2017. It seems likely the new contract will more than pay for the acquisition.",
    "The number of doses to be delivered wasn't disclosed, but presumably the government is getting a bulk discount over the previous contract. Fortunately, gross margins are likely high enough on the product to offer a discount and still make a substantially higher profit.",
    "Emergent BioSolutions has been manufacturing ACAM2000 during the break between contracts, so it has a warehouse full of the drug ready to be delivered to the strategic national stockpile. The company said it plans to deliver a majority of the doses under the first year of the contract by the end of 2019, which will allow Emergent to reach its 2019 guidance .",
    "10 stocks we like better than Emergent BioSolutions\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Emergent BioSolutions wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Brian Orelli has no position in any of the stocks mentioned. The Motley Fool owns shares of and recommends Emergent BioSolutions. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:55:00"
}