{
  "url": "https://www.nasdaq.com/article/hexo-stock-is-down-but-not-out-cm1207482",
  "title": "Hexo Stock Is Down — But Not Out - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Hexo (NYSE: HEXO ) stock is down 20% year-to-date. This is while the S&P 500 is up more than 10% and the SPDR S&P Biotech ETF (NYSEARCA: XBI ) is flat. So clearly, investors have shied away from buying HEXO stock specifically.",
    "This is not necessarily alarming because investors are already nervous from extraneous factors. Wall Street has good reason to be hesitant to buy even proven stocks right now with so much uncertainty is looming. So they are not rushing into risky ones either.",
    "During such uncertain times, stocks like HEXO, which are relatively frothy don't get bid up. If investors are nervous they usually prefer buying strong fundamentals not hopium. Since it sells at 270 time its sales, the Hexo stock price has a lot of forward potential baked into it - even down here.",
    "So, under such uncertain conditions, I would only trade HEXO from a tactical vantage point. And that's the opportunity we will study today.",
    "HEXO stock is down 50% since the end of April. Clearly the bears are in control of it, but there is hope for the bulls. Last week when it was under severe selling pressure, it held the July bottom. So as long as the HEXO bulls can maintain the higher-low trend, they will have an opportunity to regain control of the price action. This is also happening inside a pivotal zone and those are usually supportive.",
    "To do that, HEXO stock price needs to rise above $4.50. This is a moving target so I consider it more of a range rather than a hard line in the sand.",
    "If the buyers are able to do this then HEXO could run another $1 from there. This would almost be the halfback retracement of the whole correction from $8.20 per share.",
    "Since I deem this opportunity as tactical, it also means that the trade should have tight stops. This would eliminate the temptation of turning a trade into an investment.",
    "However, if traders know the company and expect its fundamentals to eventually blossom then this same opportunity here would also be a good long-term entry point. But in either case and with so much uncertainty, it is best to do it in stages and not a full position all at one.",
    "There is a technical caution from the weekly chart. The HEXO stock price pattern is expanding and testing the lower ends of the range. If the trend line breaks then they could target $3 per share. While this is not the obvious scenario unfolding, it is one that exists.",
    "The bottom line is that Wall Street is on edge so they won't have a lot of appetite to buy iffy stocks. HEXO is one that would likely need the general market help to find footing and recover higher levels. If it does then I'd trail profits near $5.50 then again at $6.30 per share.",
    "Nicolas Chahine is the managing director of  SellSpreads.com . As of this writing, he did not hold a position in any of the aforementioned securities. Join his live chat room for free  here .",
    "The post Hexo Stock Is Down - But Not Out appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:52:01"
}