{
  "url": "https://www.nasdaq.com/article/wednesday-sector-leaders-healthcare-utilities-cm1210651",
  "title": "Wednesday Sector Leaders: Healthcare, Utilities - Nasdaq.com",
  "text": [
    "Looking at the sectors faring best as of midday Wednesday, shares of Healthcare companies are outperforming other sectors, higher by 0.9%. Within that group, McKesson Corp (Symbol: MCK) and Intuitive Surgical Inc (Symbol: ISRG) are two large stocks leading the way, showing a gain of 4.3% and 4.0%, respectively. Among healthcare ETFs  , one ETF following the sector is the Health Care Select Sector SPDR ETF (Symbol: XLV), which is up 0.9% on the day, and up 6.60% year-to-date. McKesson Corp, meanwhile, is up 35.90% year-to-date, and Intuitive Surgical Inc is up 9.13% year-to-date. Combined, MCK and ISRG make up approximately 2.5% of the underlying holdings of XLV. The next best performing sector is the Utilities sector, up 0.8%. Among large Utilities stocks, CenterPoint Energy, Inc (Symbol: CNP) and AES Corp. (Symbol: AES) are the most notable, showing a gain of 3.3% and 2.0%, respectively. One ETF closely tracking Utilities stocks is the Utilities Select Sector SPDR ETF ( XLU  ), which is up 0.7% in midday trading, and up 20.81% on a year-to-date basis. CenterPoint Energy, Inc, meanwhile, is up 10.34% year-to-date, and AES Corp. is up 9.97% year-to-date. Combined, CNP and AES make up approximately 2.9% of the underlying holdings of XLU.    Comparing these stocks and ETFs on a trailing twelve month basis, below is a relative stock price performance chart, with each of the symbols shown in a different color as labeled in the legend at the bottom:  makeArticleAd();       Here's a snapshot of how the S&P 500 components within the various sectors are faring in afternoon trading on Wednesday. As you can see, eight sectors are up on the day, while none of the sectors are down.      25 Dividend Giants Widely Held By ETFs »  ",
    "The next best performing sector is the Utilities sector, up 0.8%. Among large Utilities stocks, CenterPoint Energy, Inc (Symbol: CNP) and AES Corp. (Symbol: AES) are the most notable, showing a gain of 3.3% and 2.0%, respectively. One ETF closely tracking Utilities stocks is the Utilities Select Sector SPDR ETF ( XLU  ), which is up 0.7% in midday trading, and up 20.81% on a year-to-date basis. CenterPoint Energy, Inc, meanwhile, is up 10.34% year-to-date, and AES Corp. is up 9.97% year-to-date. Combined, CNP and AES make up approximately 2.9% of the underlying holdings of XLU.",
    "  25 Dividend Giants Widely Held By ETFs » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:35:50"
}