{
  "url": "https://www.nasdaq.com/article/3-surprising-stocks-hitting-new-highs-last-week-cm1206470",
  "title": "3 Surprising Stocks Hitting New Highs Last Week - Nasdaq.com",
  "text": [
    "We're now two-thirds of the way through 2019, and the market's volatility continues to deliver hundreds of winners -- and hundreds of losers -- weekly. Last week nearly 550 stocks on the three major U.S. exchanges hit 52-week highs for the week. Even in a volatile market with so many stocks bottoming out there always seem to be top stocks worth buying .",
    "Dunkin' Brands (NASDAQ: DNKN) , Roku (NASDAQ: ROKU) , and Fastly (NYSE: FSLY) are three of the names hitting new all-time highs this past week. Each of the three stocks has a unique story to tell, but the one thing that they have in common is that they're all paying off for investors right now.",
    "Image source: Dunkin' Brands.",
    "The company behind Dunkin' Donuts may seem like an odd fit at the top. Health-conscious consumers are in theory staying away from Dunkin's sugary sweets, and an old-school doughnut shop wouldn't seem to have the trendy appeal of more nimble upstarts.",
    "Growth is also less than impressive at Dunkin' Brands. Revenue rose a mere 2.5% in its latest quarter , fueled largely by expansion and a 1.7% uptick in comps at its U.S. stores. The good news is that its adjusted net income is growing a lot faster.",
    "Dunkin' is trying to earn these sugary gains. The pace of new store openings is accelerating, and Dunkin' is updating the experience to include drive-through lanes for mobile orders when possible, digital order boards, and more modern interior designs. Dunkin' is also widening its reach beyond its namesake doughnuts and signature coffee. It's not just sandwiches anymore, as burrito bowls recently became a limited-time menu offering.",
    "One of this year's hottest stocks is Roku. The shares have nearly quintupled this year, going from $30.64 to $151.36. Investors are hopping on the Roku train as the company transforms itself from a slow-growing maker of hardware that gets TVs online to a fast-growing leader in the software that fuels online streaming experiences.",
    "Revenue skyrocketed 59% in its latest quarter . There are now 30.5 million active accounts leaning on the Roku TV operating system as the hub of their surfing through thousands of available streaming services. Roku TV is a free platform, but it cashes in on advertising as well as royalties paid to it by the premium services. Roku's monster year isn't a surprise given the acceleration of its growth and how the narrative has changed in the eyes of investors. The shock here is that folks figuring that it would only double, triple, or quadruple as the year played out have been left behind.",
    "One of this summer's more refreshing IPO turnaround stories is Fastly. The cloud-based provider of faster content delivery went public at $16 in May, only to bottom out as a broken IPO at $14.12 in mid-August. The stock had gone on to soar 147% by the time it hit an all-time high on Thursday, a spectacular return in just a little more than two weeks.",
    "Fastly had a thin float when it hit the market, and that has only gotten leaner as an investment firm has gobbled up nearly a third of the IPO shares. Fastly's edge cloud platform is growing in popularity. Revenue rose 38% in 2018, climbing 37% through the first half of this year. The shares will continue to be volatile given the limited float, but growth always seems to win out in situations like the one we're seeing here. Keep those seat belts buckled.",
    "10 stocks we like better than Dunkin' Brands Group\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Dunkin' Brands Group wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Rick Munarriz owns shares of Roku. The Motley Fool owns shares of and recommends Roku. The Motley Fool recommends Dunkin' Brands Group and Fastly. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-02 17:00:00"
}