{
  "url": "https://www.nasdaq.com/article/european-shares-hit-6week-high-on-trade-relief-stimulus-hope-20190911-00633",
  "title": "European shares hit 6-week high on trade relief, stimulus hope - Nasdaq.com",
  "text": [
    "    * China exempts 16 types of U.S. goods from more tariffs",
    "* LSE hits new record before easing on HKEX's $39 bln bid ",
    "* ECB expected to ease policy on Thursday (Updates to close)",
    "Sept 11 (Reuters) - European shares hit six-week highs onWednesday, supported by easing U.S.-China trade tensions andhopes of fresh stimulus from the European Central Bank, whilenews from individual companies played into the upbeat mood.",
    "Shares of London Stock ExchangeLSE.L hit a record highafter Hong Kong Exchanges and Clearing0388.HK made anunsolicited $39 billion takeover approach, but wanted LSE toditch its acquisition of data company Refinitiv. urn:newsml:reuters.com:*:nL5N2621WR",
    "LSE's shares pared early gains, but closed up about 6%, itsbiggest percentage gain since the company agreed to buyRefinitiv in a $27 billion deal on Aug. 1.",
    "Meanwhile, chipmakers including InfineonIFXGN.DE , DialogSemiconductor DLGS.DE , SiltronicWAFGn.DE and AMS AMS.S gained between 1.8% and 3% after Apple IncAAPL.O unveiledthree new iPhones on Tuesday. urn:newsml:reuters.com:*:nL5N262098",
    "Shares in ProsusPRX.AS , a spin-off from Naspers thatincludes the e-commerce group's 31% stake in Chinese tech giantTencent, surged more than 25% on their stock market debut inAmsterdam, creating one of Europe's largest internet companies. urn:newsml:reuters.com:*:nL5N2622NO",
    "Europe's tech index .SX8P gained 1.2%, while the financialservices index .SXFP rose 1.5%, led by LSE. ",
    "Gains were broad-based, however, with all subsectors barringoil and gas companies .SXEP finishing higher.",
    "Investors have been piling into sectors that have laggedbroader markets in the past days, driving the banking index .SX7P higher for the sixth straight session.",
    "All eyes are now on the ECB's monetary policy meeting onThursday, where it is expected to cut interest rates and restartan asset purchase programme at a time when the euro zone'sbiggest economy - Germany - might be slipping towards recession.",
    "\"Even if you're not going to be short (on markets), you'reprobably going to be cautiously long with the view of havingmore cash lined up, to buy into the market depending how dovishthe ECB is,\" said David Madden, market analyst at CMC Markets.",
    "Recent market moves have highlighted investors' doubt abouthow aggressive the central bank will be in providing stimulus,helping debt yields recover. ",
    "In the latest sign that trade tensions with the UnitedStates could be cooling, China's finance ministry said 16 typesof U.S. goods would be exempted from additional retaliatorytariffs effective Sept. 17. urn:newsml:reuters.com:*:nB9N25G01S",
    "Germany's trade-sensitive DAX .GDAXI rose 0.74%, while thepan-European STOXX 600 index .STOXX gained 0.9% to hit itshighest since July 30. ",
    "London-listed blue-chips .FTSE outperformed Europeanpeers, with mid-caps .FTMC getting an extra boost fromreceding risks of Britain crashing out the European Unionwithout a divorce deal, at least for now. GBP/",
    "All of the major European indexes have recouped lossessustained in a rough August, with the STOXX 600 up about 8%since touching a low of 361.07 last month.",
    "Zara owner Inditex ITX.MC fell about 4% and was among thebiggest decliners on the pan-regional benchmark after itreported weaker-than-expected growth in profit margins in thefirst half of the year. urn:newsml:reuters.com:*:nL5N2620TO",
    "Shares of Remy CointreauRCOP.PA gained 3.7% afterBloomberg reported the French spirits group was preparing toname Richemont's CFR.SEric Vallat as its new chief executiveofficer. urn:newsml:reuters.com:*:nL5N2623NW (Reporting by Sruthi Shankar and Medha Singh in Bengaluru;Editing by Mark Potter) ((sruthi.shankar@thomsonreuters.com; within U.S. +1 646 2238780; outside U.S. +91 80 6749 6328))"
  ],
  "published_datetime": "2019-09-11 01:03:00"
}