{
  "url": "https://www.nasdaq.com/article/forex-daily-recap-pound-dropped-amid-general-election-speculations-cm1206465",
  "title": "Forex Daily Recap – Pound Dropped amid General Election Speculations - Nasdaq.com",
  "text": [
    "The Cable dropped as UK PM Boris Johnson prepares  to snap voting planned this week to delay Brexit. Notably, the Opposition party and ruling party rebels were underway consistent efforts to prevent a no-deal Brexit from all possibilities. With that, the opposition wants the PM to pass a law to delay UK's divorce with the European Union until January 31, 2020. And, the government would call for an election in October if MP's block no-deal.",
    "\"The purpose of the Bill is to ensure that the UK does not leave the European Union on the October 31 without an agreement, unless Parliaments consents,\" lawmaker Hilary Benn said  on Twitter.",
    "On the technical side, the GBP/USD pair lost ground and dived into the lower vicinity of the Bollinger Bands .",
    "Even the Relative Strength Index (RSI) was pointing towards 40 levels, showing weak buyer interest. Also, the MACD line and the signal line of the MACD indicator remained below the zero line, strengthening the bears. Further downfall would have immediately activated the stable support level stemmed near 1.2023 level.",
    "The Chinese Yuan pair continued to stay intact within the upper Bollinger Band, sustaining a strong uptrend. Quite noticeably, the USD/CNY pair was forming a bearish rising wedge trading pattern since last one month. Nevertheless, RSI was hovering above 80 levels, revealing overbought conditions.",
    "Earlier today, August Caixin Manufacturing PMI showed up on the economic calendar . This Manufacturing PMI reported 50.4 points, rising 1.2% above the 49.8 points market hopes.",
    "Today, the US imposed another round of tariffs over a certain amount of Chinese goods estimated to remain near $300 billion. Notably, China filed a tariff case against the US counterpart over its aggressive tariff attacks. Now, the US would have 60 days to resolve this latest dispute raised by China.",
    "Meantime, a written US defense published on Friday in the first of the three legal cases read , \"China has taken the unilateral decision to adopt aggressive industrial policy measures to steal or otherwise unfairly acquire the technology of its trading partners; the United States has adopted tariff measures to try to obtain the elimination of China's unfair and distortive technology-transfer policies,\"",
    "On Monday, the Swiss Franc pair was making efforts to breach above the overhead red Ichimoku Clouds . Also, the underlying base line and conversion line stood well below the trading pair, providing extra ammunition to the bulls.",
    "In the meanwhile, the Switzerland July YoY Real Retail Sales recorded 1.4% over the previous 0.7%. Also, the August SVME - Purchasing Managers' Index published data well above the market estimates.",
    "Anyhow, the Stochastic Oscillator had crossed above 86.63 mark, showing overbought buying conditions. Nonetheless, a further move to the upside would enable immediate challenge over durable 0.9947 resistance handle.",
    "Today, the Aussie pair slipped out of the choppy bracket and was heading south after marking the daily opening near 0.6724 level. Earlier the day, the August MoM TD Securities Inflation recorded 0.0% over 0.3% prior figure.",
    "However, the highly disappointing August YoY RBA Commodity Index SDR came near 6.2% over the last 16.1%. Somehow, the buyers were losing interest in the AUD/USD pair as evident from the downward heading Stochastic Oscillator lines.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-02 16:00:15"
}