{
  "url": "https://www.nasdaq.com/article/add-these-5-low-pcf-stocks-to-create-a-value-based-portfolio-cm1206499",
  "title": "Add These 5 Low P/CF Stocks to Create a Value-Based Portfolio - Nasdaq.com",
  "text": [
    " Value style is considered one of the best practices when it comes to picking stocks. There are different valuation metrics to determine a stock's inherent strength but a random selection of a ratio cannot serve your purpose if you want a realistic assessment of a company's financial position. For this, we would suggest Price to Cash Flow  (or P/CF) ratio as one of the key metrics. This metric evaluates the market price of a stock relative to the amount of cash flow that the company is generating on a per-share basis - the lower the number, the better. One of the important factors that make P/CF a highly dependable metric is that operating cash flow adds back non-cash charges such as depreciation and amortization to net income, truly diagnosing the financial health of a company. Analysts caution that a company's earnings are subject to accounting estimates and management manipulation. However, cash flow is reliable. It is net cash flow that unveils how much money a company is actually generating and how effectively management is deploying the same. Positive cash flow indicates an increase in a company's liquid assets. It gives the company the means to settle debt, shell out for its expenses, reinvest in its business, endure downturns and finally pay back its shareholders. Negative cash flow implies a decline in the company's liquidity, which in turn lowers its flexibility to support these moves. However, an investment decision solely based on the P/CF metric may not fetch the desired results. To identify stocks that are trading at a discount, you should expand your search criteria and also consider price-to-book ratio, price-to-earnings ratio and price-to-sales ratio. Adding a favorable Zacks Rank and a  Value Score   of A or B to your search criteria should lead to even better results as these eliminate the chance of falling into a value trap.  The Bargain Hunting Strategy  Here are the parameters for selecting true value stocks:  P/CF less than or equal to X-Industry Median  .  Price greater than or equal to 5:  The stocks must all be trading at a minimum of $5 or higher.  Average 20-Day Volume greater than 100,000:  A substantial trading volume ensures that the stock is easily tradable.  P/E using (F1) less than or equal to X-Industry Median:  This parameter shortlists stocks that are trading at a discount or are equal to its peers.  P/B less than or equal to X-Industry Median:  A lower P/B compared with the industry average implies that there is enough room for the stock to gain.  P/S less than or equal to X-Industry Median:  The P/S ratio determines how a stock price compares to the company's sales - the lower the ratio the more attractive the stock is.  PEG less than 1:  The ratio is used to determine a stock's value by taking the company's earnings growth into account. PEG ratio gives a more complete picture than P/E ratio. A value of less than 1 indicates that the stock is undervalued and that investors need to pay less for a stock that has robus t earnings  growth prospect.  Zacks Rank less than or equal to 2:  Zacks Rank #1 (Strong Buy) or 2 (Buy) stocks are known to outperform irrespective of the market environment.  Value Score of less than or equal to B:  Our research shows that stocks with a Style Score of A or B when combined with Zacks Rank #1 or 2 offer the best upside potential.  Here are four of the 11 stocks that qualified the screening:  Hibbett Sports, Inc. HIBB  is one of the leading athletic-inspired fashion retailers. It has a Zacks Rank #1 and an expected EPS growth rate of 10.9% for 3-5 years. The company delivered positive earnings surprises in the trailing four quarters at an average of 12.1%. You can see  the complete list of today's Zacks #1 Rank stocks   here   .  Rush Enterprises, Inc. RUSHA  is an integrated retailer of commercial vehicles and related services. It has a Zacks Rank #2 and an expected EPS growth rate of 15% for 3-5 years. The company delivered average four-quarter positive earnings surprises of 15.1%.  BrightView Holdings, Inc. BV  provides commercial landscaping services in the United States. It has a Zacks Rank #2 and an expected EPS growth rate of 19% for 3-5 years. The company delivered positive earnings surprises in the trailing four quarters at an average of 3.8%.  Lions Gate Entertainment Corp. LGF.A  is engaged in motion picture production and distribution, television programming and syndication, and home entertainment. It has a Zacks Rank #2 and an expected EPS growth rate of 15% for 3-5 years. Get the rest of the stocks on the list and start putting this and other ideas to the test. It can all be done with the Research Wizard stock picking and backtesting software. The Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.   Click here to sign up for a free trial to the   Research Wizard today   .  Disclosure: Officers, directors and/or employees of Zacks   Investment Research may own or have sold short securities and/or   hold long and/or short positions in options that are mentioned in   this material. An affiliated investment advisory firm may own or   have sold short securities and/or hold long and/or short   positions in options that are mentioned in this material.   Disclosure: Performance information for Zacks' portfolios and   strategies are available at:   https://www.zacks.com/performance   .    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Rush Enterprises, Inc. (RUSHA): Free Stock Analysis Report   BrightView Holdings, Inc. (BV): Free Stock Analysis Report   Lions Gate Entertainment Corp. (LGF.A): Free Stock Analysis Report   Hibbett Sports, Inc. (HIBB): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Value style is considered one of the best practices when it comes to picking stocks. There are different valuation metrics to determine a stock's inherent strength but a random selection of a ratio cannot serve your purpose if you want a realistic assessment of a company's financial position. For this, we would suggest Price to Cash Flow  (or P/CF) ratio as one of the key metrics.",
    "This metric evaluates the market price of a stock relative to the amount of cash flow that the company is generating on a per-share basis - the lower the number, the better. One of the important factors that make P/CF a highly dependable metric is that operating cash flow adds back non-cash charges such as depreciation and amortization to net income, truly diagnosing the financial health of a company.",
    "Analysts caution that a company's earnings are subject to accounting estimates and management manipulation. However, cash flow is reliable. It is net cash flow that unveils how much money a company is actually generating and how effectively management is deploying the same.",
    "Positive cash flow indicates an increase in a company's liquid assets. It gives the company the means to settle debt, shell out for its expenses, reinvest in its business, endure downturns and finally pay back its shareholders. Negative cash flow implies a decline in the company's liquidity, which in turn lowers its flexibility to support these moves.",
    "However, an investment decision solely based on the P/CF metric may not fetch the desired results. To identify stocks that are trading at a discount, you should expand your search criteria and also consider price-to-book ratio, price-to-earnings ratio and price-to-sales ratio. Adding a favorable Zacks Rank and a  Value Score   of A or B to your search criteria should lead to even better results as these eliminate the chance of falling into a value trap.",
    " The Bargain Hunting Strategy ",
    "Here are the parameters for selecting true value stocks:",
    " P/CF less than or equal to X-Industry Median  .",
    " Price greater than or equal to 5:  The stocks must all be trading at a minimum of $5 or higher.",
    " Average 20-Day Volume greater than 100,000:  A substantial trading volume ensures that the stock is easily tradable.",
    " P/E using (F1) less than or equal to X-Industry Median:  This parameter shortlists stocks that are trading at a discount or are equal to its peers.",
    " P/B less than or equal to X-Industry Median:  A lower P/B compared with the industry average implies that there is enough room for the stock to gain.",
    " P/S less than or equal to X-Industry Median:  The P/S ratio determines how a stock price compares to the company's sales - the lower the ratio the more attractive the stock is.",
    " PEG less than 1:  The ratio is used to determine a stock's value by taking the company's earnings growth into account. PEG ratio gives a more complete picture than P/E ratio. A value of less than 1 indicates that the stock is undervalued and that investors need to pay less for a stock that has robus t earnings  growth prospect.",
    " Zacks Rank less than or equal to 2:  Zacks Rank #1 (Strong Buy) or 2 (Buy) stocks are known to outperform irrespective of the market environment.",
    " Value Score of less than or equal to B:  Our research shows that stocks with a Style Score of A or B when combined with Zacks Rank #1 or 2 offer the best upside potential. ",
    "Here are four of the 11 stocks that qualified the screening:",
    " Hibbett Sports, Inc. HIBB  is one of the leading athletic-inspired fashion retailers. It has a Zacks Rank #1 and an expected EPS growth rate of 10.9% for 3-5 years. The company delivered positive earnings surprises in the trailing four quarters at an average of 12.1%. You can see  the complete list of today's Zacks #1 Rank stocks   here   .",
    " Rush Enterprises, Inc. RUSHA  is an integrated retailer of commercial vehicles and related services. It has a Zacks Rank #2 and an expected EPS growth rate of 15% for 3-5 years. The company delivered average four-quarter positive earnings surprises of 15.1%.",
    " BrightView Holdings, Inc. BV  provides commercial landscaping services in the United States. It has a Zacks Rank #2 and an expected EPS growth rate of 19% for 3-5 years. The company delivered positive earnings surprises in the trailing four quarters at an average of 3.8%.",
    " Lions Gate Entertainment Corp. LGF.A  is engaged in motion picture production and distribution, television programming and syndication, and home entertainment. It has a Zacks Rank #2 and an expected EPS growth rate of 15% for 3-5 years.",
    "Get the rest of the stocks on the list and start putting this and other ideas to the test. It can all be done with the Research Wizard stock picking and backtesting software.",
    "The Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.",
    "  Click here to sign up for a free trial to the   Research Wizard today   .",
    " Disclosure: Officers, directors and/or employees of Zacks   Investment Research may own or have sold short securities and/or   hold long and/or short positions in options that are mentioned in   this material. An affiliated investment advisory firm may own or   have sold short securities and/or hold long and/or short   positions in options that are mentioned in this material. ",
    " Disclosure: Performance information for Zacks' portfolios and   strategies are available at:   https://www.zacks.com/performance   . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 06:40:00"
}