{
  "url": "https://www.nasdaq.com/article/pinewood-lands-bond-highyield-bond-20190911-00606",
  "title": "Pinewood lands bond, high-yield bond - Nasdaq.com",
  "text": [
    "By Eleanor Duncan",
    "LONDON, Sept 11 (IFR) - Investor demand allowed Pinewood Studios to accelerate the pricing of its new high-yield bond, wrapping up the senior secured debt sale before the European Central Bank'sSeptember 12 meeting.",
    "The British film studio, where 23 out of 25 of the James Bond films were shot, was set to be on the road until Thursday.",
    "High-yield investors were able to see through Brexit noise and concerns over the company's increasing debt levels, a source familiar with the trade said.",
    "\"This is a business which is fairly well-insulated from Brexit, that has just signed two long-term contracts with Disney and Netflix, and that is offering an attractive spread for investors that need to put cash to work,\" he said.",
    "Pinewood priced the 6NC2 note at a spread of 280bp over Gilts which provides investors with an attractive spread versus low Triple B rated credits, the source said.",
    "For example, M&S has a 4.75% June 2025 sterling bond that is seen bid around 250bp. The British retailer also has a 3.250% July 2027 seen bid around 300bp.",
    "\"Quite honestly there isn't a lot else out there that trades with a spread of 280bp,\" the source said.",
    "REIT MOVE",
    "The debt sale was buoyed after Fitch gave the company's pivot to real estate the thumbs up by assigning the senior secured bond an investment-grade rating of BBB.",
    "Pinewood leant heavily on its new-found property rental credentials to market the bond after signing two long-term rental contracts with Disney and Netflix, of 12 and 10-years respectively.",
    "\"Fitch believes Pinewood's profile is now more akin to an investment-grade property company,\" wrote analysts in a report published on Monday.",
    "The ratings agency also put Pinewood's long-term issuer rating of BB on positive watch.",
    "In addition, investors got comfortable with the credit by looking at it from an LTV perspective, rather than a leverage perspective, the source familiar said.",
    "One investor saw Pinewood's LTV rising from 36% at the time of its last bond deal in 2017 to 43% proforma for the current deal.",
    "However, the investor said that with net debt of €475m and proforma for the last 12 months' Ebitda of €55m, he saw Pinewood's net leverage at 8.6x.",
    "Pinewood last visited the high-yield bond market in November 2017, when it priced a £250m December 2023 bond at 3.750%, according to IFR data. That deal was rated BB/BB+ by S&P/Fitch.",
    "S&P gave the new bond a BB rating.",
    "The ratings agency also upgraded Pinewood to BB- from B+ on the back of the new lease agreements but the rating agency's analysts think the company will end up with a \"riskier capital structure\" because debt to Ebitda should reach 10x, from 5.3x as of June 30.",
    "The deal will refinance an outstanding note and also fund a £250m dividend recap to Pinewood's shareholder, Aermont Capital. Credit Suisse (B&D), Goldman Sachs, Barclays, HSBC and NatWest Markets were bookrunners."
  ],
  "published_datetime": "2019-09-11 11:39:00"
}