{
  "url": "https://www.nasdaq.com/article/why-generac-holdings-cleveland-cliffs-and-napco-security-technologies-slumped-today-cm1206977",
  "title": "Why Generac Holdings, Cleveland-Cliffs, and Napco Security Technologies Slumped Today - Nasdaq.com",
  "text": [
    " The stock market sank on Tuesday, sent lower by rising trade   conflict between the U.S. and China. The latest round of tariffs   took effect over the weekend, and a permanent solution seems   further away than ever right now even as the global economy   continues to show signs of slowing. Some companies had   particularly bad news that sent their shares sharply lower.   Generac Holdings    (NYSE: GNRC) ,   Cleveland-Cliffs    (NYSE: CLF) , and   Napco Security Technologies    (NASDAQ: NSSC) were among the worst performers. Here's why they   did so poorly. Generac loses some of its Dorian bump Shares of Generac Holdings fell more than 5%, giving up much   of their gains from last week as investors watched the likely   path of Hurricane Dorian. Previously, it appeared that Florida   might make a direct hit from the storm, and   historically    , major storms have led to massive sales of Generac's home power   generators. Dorian is still a threat, but the likelihood of its   grazing the Southeast coast probably won't have as big of an   upward impact on Generac sales. Even with the drop, Generac   shares are still up about 50% so far in 2019.   Image source: Generac Holdings.makeArticleAd();  Cleveland-Cliffs can't satisfy shareholders  Cleveland-Cliffs saw its stock drop nearly   15%    despite announcing what most investors would normally see as good   news. The company said that it would boost its regular quarterly   dividend by 20% to $0.06 per share, and it also declared a   special dividend of $0.04 per share on top of that. Yet as a   producer of iron ore, Cleveland-Cliffs relies on a healthy steel   market to support the companies it supplies with raw materials   for steel production. When tariffs present obstacles to free   trade in the steel market, it often causes investors to get more   concerned not just about steel producers but also the companies   like Cleveland-Cliffs that supply them with iron ore and   metallurgical coal. Until trade relations with China improve, it   could be tough for Cleveland-Cliffs to mount a full recovery. Napco looks less secure Finally, shares of Napco Security Technologies plunged 22%.   The high-tech security solutions company said that it enjoyed its   20th straight quarter of year-over-year record sales, with   revenue climbing 9% in its fiscal Q4. Net income also jumped 60%   for the full fiscal year compared to prior-year levels. Yet   investors had hoped that Napco    would do even better, especially as it seeks to expand into   promising areas like communication devices for   Internet of Things applications    . Napco has a lot of potential, but it'll have to work a little   harder to unlock all of it.   Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!* Tom and David just revealed their ten top stock picks for     investors to buy right now.  Click here to get access to the full       list!   *      Stock Advisor     returns as of June 1, 2019.     Dan Caplinger      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "The stock market sank on Tuesday, sent lower by rising trade   conflict between the U.S. and China. The latest round of tariffs   took effect over the weekend, and a permanent solution seems   further away than ever right now even as the global economy   continues to show signs of slowing. Some companies had   particularly bad news that sent their shares sharply lower.   Generac Holdings    (NYSE: GNRC) ,   Cleveland-Cliffs    (NYSE: CLF) , and   Napco Security Technologies    (NASDAQ: NSSC) were among the worst performers. Here's why they   did so poorly.",
    "Shares of Generac Holdings fell more than 5%, giving up much   of their gains from last week as investors watched the likely   path of Hurricane Dorian. Previously, it appeared that Florida   might make a direct hit from the storm, and   historically    , major storms have led to massive sales of Generac's home power   generators. Dorian is still a threat, but the likelihood of its   grazing the Southeast coast probably won't have as big of an   upward impact on Generac sales. Even with the drop, Generac   shares are still up about 50% so far in 2019.",
    "  Image source: Generac Holdings.makeArticleAd(); ",
    "Image source: Generac Holdings.",
    " Cleveland-Cliffs saw its stock drop nearly   15%    despite announcing what most investors would normally see as good   news. The company said that it would boost its regular quarterly   dividend by 20% to $0.06 per share, and it also declared a   special dividend of $0.04 per share on top of that. Yet as a   producer of iron ore, Cleveland-Cliffs relies on a healthy steel   market to support the companies it supplies with raw materials   for steel production. When tariffs present obstacles to free   trade in the steel market, it often causes investors to get more   concerned not just about steel producers but also the companies   like Cleveland-Cliffs that supply them with iron ore and   metallurgical coal. Until trade relations with China improve, it   could be tough for Cleveland-Cliffs to mount a full recovery.",
    "Finally, shares of Napco Security Technologies plunged 22%.   The high-tech security solutions company said that it enjoyed its   20th straight quarter of year-over-year record sales, with   revenue climbing 9% in its fiscal Q4. Net income also jumped 60%   for the full fiscal year compared to prior-year levels. Yet   investors had hoped that Napco    would do even better, especially as it seeks to expand into   promising areas like communication devices for   Internet of Things applications    . Napco has a lot of potential, but it'll have to work a little   harder to unlock all of it.",
    "  Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!* Tom and David just revealed their ten top stock picks for     investors to buy right now.  Click here to get access to the full       list!   *      Stock Advisor     returns as of June 1, 2019.  ",
    " Offer from The Motley Fool: The 10 best stocks to buy     now            Motley Fool co-founders Tom and David Gardner have spent more     than a decade beating the market. In fact, the newsletter they     run,     Motley Fool Stock Advisor      , has quadrupled the S&P 500!*",
    "Tom and David just revealed their ten top stock picks for     investors to buy right now.",
    " Click here to get access to the full       list! ",
    " *      Stock Advisor     returns as of June 1, 2019. ",
    "  Dan Caplinger      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 16:32:00"
}