{
  "url": "https://www.nasdaq.com/article/why-is-cardiovascular-systems-csii-up-18-since-last-earnings-report-cm1208057",
  "title": "Why Is Cardiovascular Systems (CSII) Up 1.8% Since Last Earnings Report? - Nasdaq.com",
  "text": [
    " It has been about a month since the las t earnings  report for Cardiovascular Systems (CSII). Shares have added about 1.8% in that time frame, underperforming the S&P 500. Will the recent positive trend continue leading up to its next earnings release, or is Cardiovascular Systems due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important drivers.  Cardiovascular Systems Earnings Match Estimates in   Q4  Cardiovascular Systems, Inc delivered earnings per share (EPS) of 4 cents in fourth-quarter fiscal 2019, down 63.6% year over year. The reported figure was in line with the Zacks Consensus Estimate. For the full year, loss per share came in at a cent, reflecting a sharp decline from the year-ago earnings of 5 cents.  Net Sales  Cardiovascular Systems' revenues of $68.2 million in the fourth quarter mark a 15.4% year-over-year increase. Meanwhile, the top line beat the Zacks Consensus Estimate by 3.33%. For the full year, revenues totaled $248 million, up 14.3% from a year ago.  Segment Details  In the quarter under review, global Coronary device revenues jumped 24% year over year to $20 million. Total U.S. revenues increased 13% to $65.7 million. Domestic coronary revenues grew 16%, primarily driven by expanded unit volumes and domestic peripheral revenue growth of 12% to $48.2 million. International revenues totaled $2.5 million.  Margin  Gross margin in the reported quarter was 80.3%, down 145 basis points (bps) year over year. Meanwhile, selling, general and administrative (SG&A) expenses rose 16.2% to $43.9 million plus research and development (R&D) expenses escalated 41.8% to $9.5 million. As a result, adjusted operating expenses increased 20.1% to $53.5 million. Operating margin in the reported quarter contracted 454 bps to 1.8%.  Financial Position  The company exited fiscal 2019 with cash and cash equivalents of $74.2 million compared with $116.3 million at the end of fiscal 2018.  2020 Outlook  Cardiovascular Systems initiated its fiscal 2020 guidance. The company projects revenues within $278-$283 million for fiscal 2020. The Zacks Consensus Estimate for fiscal 2020 revenues is pegged at $277.2 million, just below the company's view. Moreover, the company anticipates gross profit margin within 79-80%.   How Have Estimates Been Moving Since Then?  Fresh estimates followed a downward path over the past two months. The consensus estimate has shifted -63.24% due to these changes.  VGM Scores  At this time, Cardiovascular Systems has a subpar Growth Score of D, however its Momentum Score is doing a lot better with a B. However, the stock was allocated a grade of F on the value side, putting it in the lowest quintile for this investment strategy. Overall, the stock has an aggregate VGM Score of F. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Cardiovascular Systems has a Zacks Rank #5 (Strong Sell). We expect a below average return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Cardiovascular Systems, Inc. (CSII): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "It has been about a month since the las t earnings  report for Cardiovascular Systems (CSII). Shares have added about 1.8% in that time frame, underperforming the S&P 500.",
    "Will the recent positive trend continue leading up to its next earnings release, or is Cardiovascular Systems due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important drivers.  Cardiovascular Systems Earnings Match Estimates in   Q4  Cardiovascular Systems, Inc delivered earnings per share (EPS) of 4 cents in fourth-quarter fiscal 2019, down 63.6% year over year. The reported figure was in line with the Zacks Consensus Estimate. For the full year, loss per share came in at a cent, reflecting a sharp decline from the year-ago earnings of 5 cents.  Net Sales  Cardiovascular Systems' revenues of $68.2 million in the fourth quarter mark a 15.4% year-over-year increase. Meanwhile, the top line beat the Zacks Consensus Estimate by 3.33%. For the full year, revenues totaled $248 million, up 14.3% from a year ago.  Segment Details  In the quarter under review, global Coronary device revenues jumped 24% year over year to $20 million. Total U.S. revenues increased 13% to $65.7 million. Domestic coronary revenues grew 16%, primarily driven by expanded unit volumes and domestic peripheral revenue growth of 12% to $48.2 million. International revenues totaled $2.5 million.  Margin  Gross margin in the reported quarter was 80.3%, down 145 basis points (bps) year over year. Meanwhile, selling, general and administrative (SG&A) expenses rose 16.2% to $43.9 million plus research and development (R&D) expenses escalated 41.8% to $9.5 million. As a result, adjusted operating expenses increased 20.1% to $53.5 million. Operating margin in the reported quarter contracted 454 bps to 1.8%.  Financial Position  The company exited fiscal 2019 with cash and cash equivalents of $74.2 million compared with $116.3 million at the end of fiscal 2018.  2020 Outlook  Cardiovascular Systems initiated its fiscal 2020 guidance. The company projects revenues within $278-$283 million for fiscal 2020. The Zacks Consensus Estimate for fiscal 2020 revenues is pegged at $277.2 million, just below the company's view. Moreover, the company anticipates gross profit margin within 79-80%. ",
    " Cardiovascular Systems Earnings Match Estimates in   Q4 ",
    "Cardiovascular Systems, Inc delivered earnings per share (EPS) of 4 cents in fourth-quarter fiscal 2019, down 63.6% year over year. The reported figure was in line with the Zacks Consensus Estimate.",
    "For the full year, loss per share came in at a cent, reflecting a sharp decline from the year-ago earnings of 5 cents.",
    " Net Sales ",
    "Cardiovascular Systems' revenues of $68.2 million in the fourth quarter mark a 15.4% year-over-year increase. Meanwhile, the top line beat the Zacks Consensus Estimate by 3.33%.",
    "For the full year, revenues totaled $248 million, up 14.3% from a year ago.",
    " Segment Details ",
    "In the quarter under review, global Coronary device revenues jumped 24% year over year to $20 million. Total U.S. revenues increased 13% to $65.7 million. Domestic coronary revenues grew 16%, primarily driven by expanded unit volumes and domestic peripheral revenue growth of 12% to $48.2 million. International revenues totaled $2.5 million.",
    " Margin ",
    "Gross margin in the reported quarter was 80.3%, down 145 basis points (bps) year over year.",
    "Meanwhile, selling, general and administrative (SG&A) expenses rose 16.2% to $43.9 million plus research and development (R&D) expenses escalated 41.8% to $9.5 million. As a result, adjusted operating expenses increased 20.1% to $53.5 million. Operating margin in the reported quarter contracted 454 bps to 1.8%.",
    " Financial Position ",
    "The company exited fiscal 2019 with cash and cash equivalents of $74.2 million compared with $116.3 million at the end of fiscal 2018.",
    " 2020 Outlook ",
    "Cardiovascular Systems initiated its fiscal 2020 guidance. The company projects revenues within $278-$283 million for fiscal 2020. The Zacks Consensus Estimate for fiscal 2020 revenues is pegged at $277.2 million, just below the company's view.",
    "Moreover, the company anticipates gross profit margin within 79-80%.",
    " How Have Estimates Been Moving Since Then? ",
    "Fresh estimates followed a downward path over the past two months. The consensus estimate has shifted -63.24% due to these changes.",
    " VGM Scores ",
    "At this time, Cardiovascular Systems has a subpar Growth Score of D, however its Momentum Score is doing a lot better with a B. However, the stock was allocated a grade of F on the value side, putting it in the lowest quintile for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of F. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Cardiovascular Systems has a Zacks Rank #5 (Strong Sell). We expect a below average return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:31:23"
}