{
  "url": "https://www.nasdaq.com/article/5-hot-stocks-to-buy-in-september-cm1207376",
  "title": "5 Hot Stocks to Buy in September - Nasdaq.com",
  "text": [
    " The end of summer is almost upon us, but some hot stocks   aren't ready to cool off. Hundreds of U.S. stocks scored gains of   at least 50% through the first eight months of the year,   outperforming the volatile market's ups and downs -- among them,   Target    (NYSE: TGT) ,   Shopify    (NYSE: SHOP) ,   Roku    (NASDAQ: ROKU) ,   Momo    (NASDAQ: MOMO) , and   RingCentral    (NYSE: RNG) . Here's why all five could keep the good times going for   investors in the months ahead.   Image source: Shopify.makeArticleAd();  Target: Up 66% in 2019 A lot of traditional retailers are struggling these days, but   Target's store logo apparently remains a bullseye for shoppers.   The \"cheap chic\" retailer is back with a vengeance. Comps climbed   3.4% in   its latest quarter    , a gain that was stacked on top of a 6.5% pop a year earlier.   Put another way, the average store is selling 10% more than it   was two years ago. Digital sales are a major driver of Target's recent growth,   but it's also excelling at keeping costs in check. It's expanding   its margins, and that's something that you don't see a lot among   hungry retailers lately. In addition, adjusted earnings have   landed ahead of management's guidance and Wall Street's profit   targets for three consecutive quarters. Shopify: Up 177% The internet has made it possible for any business to sell its   wares to the world, and Shopify is making that process seamless   for its more than 800,000 merchants. Shopify storefronts are   everywhere, and even though the company's revenue growth is   slowing -- year-over-year upticks have decelerated for 14   consecutive quarters -- it's hard to ignore a dot-com darling   that still came through with a 48% top-line surge in   its latest quarter    . The stock has nearly tripled this year, and analysts keep   raising their price targets to keep up both with the buoyant   share price and the business's improving fundamentals. Last week,   it was Mark Zgutowicz at Rosenblatt lifting his price goal on the   shares to a Wall Street high of $481, excited by the prospects of   modest acceleration in gross merchandise volume in the   future. Roku: Up 412% If you're kicking yourself for missing out on Shopify this   year, just imagine the self-bruising you can put yourself through   for failing to cash in on 2019 five-bagger Roku. The streaming TV   pioneer's platform has emerged as a rock star in the booming   cord-cutting revolution. There are now   30.5 million active accounts    leaning on Roku, and this quarter, those users should stream more   than 10 billion hours of content across the thousands of services   available on the platform. Momentum favors the company, and while   its share price has outpaced its fundamentals in 2019, betting   against Roku has been an easy way to get burned this year. Momo: Up 55%  Chinese internet stocks    may seem an unlikely hotbed for investors' interest in 2019,   considering that country's slowing economy and its ongoing trade   tussle with the U.S., but Momo is rising above the fray. With its   social discovery and online dating sites gaining traction in the   world's most populous nation, its revenue   climbed 32%     in its latest quarter -- and adjusted earnings rose even   faster. A lot of this month's hot stocks trade at pricy multiples, but   that's not the case with Momo. Despite its rally, shares can   still be had for less than 14 times this year's expected adjusted   earnings, and just 11 times next year's bottom-line forecast. RingCentral: Up 71% Companies need smart phone systems to stay on top of incoming   communications, and that's what RingCentral provides with its   cloud-based platform that automatically routes inbound calls to   whatever device a recipient is using. RingCentral isn't a   household name among consumers, but it's proving to be   resiliently sticky for its enterprise clients. Revenue   rose 34%     in the second quarter, and the numbers are just as   impressive on the other end of the income statement. RingCentral   has posted double-digit percentage beats on the bottom line for   the past seven quarters. It's been the right call for   investors.   10 stocks we like better than Target       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Target wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Rick Munarriz      owns shares of RingCentral, Roku, and Target. The Motley Fool     owns shares of and recommends Roku and Shopify. The Motley Fool     recommends Momo. The Motley Fool has a     disclosure policy      .  ",
    "The end of summer is almost upon us, but some hot stocks   aren't ready to cool off. Hundreds of U.S. stocks scored gains of   at least 50% through the first eight months of the year,   outperforming the volatile market's ups and downs -- among them,   Target    (NYSE: TGT) ,   Shopify    (NYSE: SHOP) ,   Roku    (NASDAQ: ROKU) ,   Momo    (NASDAQ: MOMO) , and   RingCentral    (NYSE: RNG) .",
    "Here's why all five could keep the good times going for   investors in the months ahead.",
    "  Image source: Shopify.makeArticleAd(); ",
    "Image source: Shopify.",
    "A lot of traditional retailers are struggling these days, but   Target's store logo apparently remains a bullseye for shoppers.   The \"cheap chic\" retailer is back with a vengeance. Comps climbed   3.4% in   its latest quarter    , a gain that was stacked on top of a 6.5% pop a year earlier.   Put another way, the average store is selling 10% more than it   was two years ago.",
    "Digital sales are a major driver of Target's recent growth,   but it's also excelling at keeping costs in check. It's expanding   its margins, and that's something that you don't see a lot among   hungry retailers lately. In addition, adjusted earnings have   landed ahead of management's guidance and Wall Street's profit   targets for three consecutive quarters.",
    "The internet has made it possible for any business to sell its   wares to the world, and Shopify is making that process seamless   for its more than 800,000 merchants. Shopify storefronts are   everywhere, and even though the company's revenue growth is   slowing -- year-over-year upticks have decelerated for 14   consecutive quarters -- it's hard to ignore a dot-com darling   that still came through with a 48% top-line surge in   its latest quarter    .",
    "The stock has nearly tripled this year, and analysts keep   raising their price targets to keep up both with the buoyant   share price and the business's improving fundamentals. Last week,   it was Mark Zgutowicz at Rosenblatt lifting his price goal on the   shares to a Wall Street high of $481, excited by the prospects of   modest acceleration in gross merchandise volume in the   future.",
    "If you're kicking yourself for missing out on Shopify this   year, just imagine the self-bruising you can put yourself through   for failing to cash in on 2019 five-bagger Roku. The streaming TV   pioneer's platform has emerged as a rock star in the booming   cord-cutting revolution.",
    "There are now   30.5 million active accounts    leaning on Roku, and this quarter, those users should stream more   than 10 billion hours of content across the thousands of services   available on the platform. Momentum favors the company, and while   its share price has outpaced its fundamentals in 2019, betting   against Roku has been an easy way to get burned this year.",
    " Chinese internet stocks    may seem an unlikely hotbed for investors' interest in 2019,   considering that country's slowing economy and its ongoing trade   tussle with the U.S., but Momo is rising above the fray. With its   social discovery and online dating sites gaining traction in the   world's most populous nation, its revenue   climbed 32%     in its latest quarter -- and adjusted earnings rose even   faster.",
    "A lot of this month's hot stocks trade at pricy multiples, but   that's not the case with Momo. Despite its rally, shares can   still be had for less than 14 times this year's expected adjusted   earnings, and just 11 times next year's bottom-line forecast.",
    "Companies need smart phone systems to stay on top of incoming   communications, and that's what RingCentral provides with its   cloud-based platform that automatically routes inbound calls to   whatever device a recipient is using. RingCentral isn't a   household name among consumers, but it's proving to be   resiliently sticky for its enterprise clients.",
    "Revenue   rose 34%     in the second quarter, and the numbers are just as   impressive on the other end of the income statement. RingCentral   has posted double-digit percentage beats on the bottom line for   the past seven quarters. It's been the right call for   investors.",
    "  10 stocks we like better than Target       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Target wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Target       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Target wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Rick Munarriz      owns shares of RingCentral, Roku, and Target. The Motley Fool     owns shares of and recommends Roku and Shopify. The Motley Fool     recommends Momo. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:13:00"
}