{
  "url": "https://www.nasdaq.com/article/china-unlocked-argentine-soymeal-producers-spy-2020-boost-20190911-00550",
  "title": "China unlocked, Argentine soymeal producers spy 2020 boost - Nasdaq.com",
  "text": [
    "By Hugh Bronstein and Maximilian Heath",
    "BUENOS AIRES, Sept 11 (Reuters) - Argentine soy farmers and crushers expect a boost in demand next year after the South American grains giant won long-sought  approval from China to export soymeal, its top commodity, to the world's biggest consumer of the livestock feed.",
    "Argentina's government announced on Tuesday that China would allow the import of its soymeal for the first time following decades of talks. That agreement will be formalized in Buenos Aires on Wednesday. ",
    "\"This news is huge for our country given the magnitude and potential of the new market,\" the Rosario grains exchange said in a statement. The majority of Argentina's soy is grown and crushed in the area around Rosario, on the banks of the Parana River.",
    "\"(It) will allow exports to the Asian country to kick in effectively from next year.\"",
    "China consumes an estimated 67.3 million tonnes of soymeal each year to feed its giant hog herd, the Rosario exchange said, though it has imported only small amounts of the processed soy product, preferring to crush the beans domestically.",
    "This has meant that while China has been the top buyer of raw Argentine soybeans, it has long resisted opening up to  soymeal. Argentina's top export markets for the feed are currently Europe, Vietnam, and Indonesia.",
    "Grain industry insiders said that the U.S.-China trade war had helped make Argentine soymeal exports more alluring as Beijing looks to diversify its supply options, and the deal could help local farmers make up lost ground on U.S. rivals.",
    "Argentina could export a total 31 million tonnes of meal from beans harvested in the upcoming 2019/20 season. The amount China will take is still unclear, depending on demand linked to swine flu currently hitting the country's hog herd and Beijing's political will to shift away from local supplies toward imports.",
    "Santiago del Solar, chief of staff to Argentina's agriculture minister, said the deal was \"simple good news.\"",
    "\"We know that last year the possibility of selling soymeal to China was zero. Now we've opened the market, which is good for the whole value chain,\" he told Reuters. \"By the time of our  next soy harvest in March, April and May we hope we will have the paperwork done and have the first shipments.\"",
    "Adding China to the mix in 2020 should lend some stability to a farm sector hurting from political and economic uncertainty,  with business-friendly President Mauricio Macri heading for likely defeat in the October election.",
    "Front-runner opposition candidate Alberto Fernandez is running with Cristina Fernandez de Kirchner, an ex-president who was locked in an feud with the farm sector over taxes and export caps during her two terms, between 2007 and 2015.",
    "\"Every new market for our flagship product is good for the economic health of the country,\" said Ezequiel De Freijo, head economist at the Argentine Rural society, which represents some of the country's biggest growers.",
    "Argentine farmers, worried by the volatile political and economic risks, had already said they were likely to boost soy planting this year over more expensive corn. "
  ],
  "published_datetime": "2019-09-11 10:38:00"
}