{
  "url": "https://www.nasdaq.com/article/7-stocks-to-buy-in-a-flat-market-cm1206917",
  "title": "7 Stocks to Buy In a Flat Market - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "In late January 2018, U.S. President Donald Trump announced tariffs on solar panels and washing machines from China, officially starting the U.S.-China trade war. That was 19 months ago. Over the subsequent 19 months, the stock market has gone nowhere. The S&P 500 peaked at 2,870 in late January 2018. Nineteen months later, at the end of August 2019, the S&P 500 is at 2,870.",
    "That isn't a coincidence. The U.S.-China trade war has created a flat market. Why? Because no one is sure exactly how this volatile trade war will play out, and how it does play out will have profound implications on the global economy. Either the U.S. and China come to a trade resolution, the trade war ends and global economic activity ramps back up (and stocks fly higher), or they don't, the trade war drags on, and corporate uncertainty drags the global economy into a recession (and stocks plunge).",
    "As such, until investors have clarity as to which way the trade war will swing, the stock market will likely remain flat. At the current moment, the most likely scenario is for trade war uncertainty to persist, and for the stock market to remain stuck in neutral.",
    "How do investors make money in a flat market? It's pretty simple. Look for three things.",
    "One, look for stocks that have been working in this flat market. Two, look for stocks with minimal exposure to the market's big headwind, which today is the trade war. Three, look for stocks with plenty of long-term growth potential - enough long-term growth potential that investors are willing to ignore near-term noise for the promise of long-term gain once the noise passes.",
    "With that in mind, let's take a look at a list of seven stocks to buy in this flat market.",
    "% Gain Over Last 19 Months:  215%",
    "Exposure to China:  Minimal",
    "Revenue CAGR Estimate over Next Two Years (from YCharts ):  35%",
    "Up first, we have one of the market's hottest socks, e-commerce solutions provider Shopify (NYSE: SHOP ).",
    "SHOP stock checks off all the boxes you'd want it to check off in a flat market. The stock has more than tripled since the trade war started, so clearly the stock is working. It's working because Shopify has very little exposure to China, so the growth trajectory has remained robust despite escalating trade tensions (Shopify's revenue growth rates have remained in excess of 45% in each of the past several quarters). Further, Shopify controls less than 2% of global retail sales, and given current consumer trends promoting do-it-yourself mentalities and economic decentralization , it's easy to see Shopify running up toward 5-10% share in the long run.",
    "That means that this growth narrative is just getting started. That's why analysts see Shopify growing revenues at a 35% compounded annual growth rate over the next two years.",
    "In other words, with Shopify, you have a big growth stock that has been on fire over the past 19 months, has minimal exposure to the U.S.-China trade war and which has tons of long-term growth potential. That's a winning combination in a flat market.",
    "% Gain Over Last 19 Months:  240%",
    "Exposure to China: Minimal",
    "Revenue CAGR Estimate over Next Two Years (from YCharts): 33%",
    "Shopify stock has been red hot over the past 19 months, but Roku (NASDAQ: ROKU ) stock has been even hotter.",
    "Roku stock is up 240% since the trade war started, mostly because this company is supported by secular growth tailwinds, which have remained vigorous despite escalating trade tensions. That is, consumers in the U.S. are still shifting in bulk from linear to internet TV. At the same time, media companies everywhere are still launching multiple streaming services. Thus, both supply and demand in the streaming TV market are still rapidly rising, meaning that there remains robust demand for a streaming service aggregator like Roku to connect all the demand in the streaming TV world to all the supply, in a seamless, friction-less and low-cost manner.",
    "Consequently, Roku has fired off huge user engagement and revenue growth rates over the past several quarters. As it has, ROKU stock has popped.",
    "Meanwhile, Roku has very little exposure to China, with the only exposure really being that they manufacture their streaming devices in China. But, the hardware part of this business is largely irrelevant to the software side, so hardware manufacturing exposure to China is a null point in the big picture. Further, Roku only has 30 million active streamers. There are over a billion internet households in the world, meaning that Roku is still a long runway ahead of it for future growth - hence the 30%-plus revenue CAGR projected over the next two years.",
    "Net net, Roku - much like Shopify - has been red hot during the trade war, has minimal exposure to China, and projects as a big grower for a lot longer. Again, that's a winning combination, which should continue to produce gains in a flat market.",
    "% Gain Over Last 19 Months:  380%",
    "Exposure to China: Minimal",
    "Revenue CAGR Estimate over Next Two Years (from YCharts): 28%",
    "Up nearly 400% over the past 19 months, programmatic advertising leader The Trade Desk (NASDAQ: TTD ) checks off all the boxes you'd want checked off for a winning stock in a flat market.",
    "First, TTD has risen nearly five-fold over since early 2018. That's a huge gain. Clearly, whatever this company is doing, it's working.",
    "Second, what The Trade Desk is doing - providing programmatic advertising solutions to automate and optimize the ad spend process by leveraging data and machine learning - is revolutionary. Indeed, it's already disrupting the entire ad industry, as companies left and right are adopting TTD's automated ad spend solutions. Still, the ~$2.4 billion of ad spend that flowed through TTD's platform in 2018 amounted to less than 1% of total digital ad spend globally . Thus, the runway for growth here is very long and very big.",
    "Third, TTD has minimal exposure to China. International gross billings amounted to just 15% of total gross billings in 2018. While that number will grow over time - and while China could one day be a huge market for TTD - The Trade Desk presently lacks meaningful exposure to China, meaning that weakness in China won't show up in TTD's numbers.",
    "Overall, then, TTD stock is a stock that has outperformed big in this flat market, has big growth potential in the long run, and lacks meaningful exposure to China - a trio of winning features that should keep TTD stock on an uptrend in this flat market.",
    "% Gain Over Last 19 Months:  130%",
    "Exposure to China: None",
    "Revenue CAGR Estimate over Next Two Years (from YCharts): 22%",
    "Digital education leader Chegg (NASDAQ: CHGG ) has been less hot compared to many of the other stocks on this list, but it still checks off all the boxes of a winning stock in a flat market.",
    "First, CHGG stock is up big since the trade war started, more than doubling over that stretch as the company has powered consistently favorable results that comprise big subscriber, revenue and profit growth.",
    "Second, CHGG stock lacks trade war exposure. This is a U.S. company, which services U.S. high school and college students. The U.S.-China trade war has zero impact on those students, or their willingness to spend on Chegg's digital education service. Thus, it's fair to say that Chegg has zero trade war exposure.",
    "Third, CHGG stock is far from being done growing. The platform has 3.1 million subscribers. There are 36 million high school and college students in America. That means Chegg is at roughly 8% market penetration. Further, Chegg has very little competition in that market, and is supported by secular demographic trends such as the fact that most Generation Z students prefer to learn online . As such, all signs point to the fact that Chegg is in the first few inning of a long-term growth narrative that will result in 20%-plus profit growth for a lot longer.",
    "All in all, CHGG stock - like all the other stocks on this list - has all the attributes of a winning stock in a flat market. As such, so long as the market remains flat due to trade war concerns, Chegg stock is a good place to hangout.",
    "% Gain Over Last 19 Months:  335%",
    "Exposure to China: Minimal",
    "Revenue CAGR Estimate over Next Two Years (from YCharts): 31%",
    "One of the market's favorite growth stocks over the past 19 months - cloud identity management company Okta (NASDAQ: OKTA ), up more than 300% since the trade war started - has turned into a market favorite for good reason.",
    "First, Okta's secular growth narrative is very promising. Okta's Identity Cloud is a unique identity-focused approach to cloud security, wherein Okta outfits each employee in an enterprise with their own \"identity armor\" as opposed to outfitting the ecosystem with a \"security castle\". The logic is that if everyone in an ecosystem has armor, there's no need to build a castle around the ecosystem - everyone is safe. And, without a castle, individuals are unrestricted and can move freely - this enhanced flexibility is increasingly important in enterprise ecosystems with multiple software applications.",
    "Consequently, enterprises have been quick to adopt Okta's Identity Cloud. But, Okta is still a small company, with revenues projected at just $550 million this year. Global cybersecurity spend amounts to over $100 billion every single year. Thus, Okta has plenty of room to grow its share in the cybersecurity market in the long run.",
    "Second, Okta's secular growth narrative has very little do with China. At least for now. Less than 20% of revenue comes from outside of America, and of that 20%, China is such a small part that it wasn't mentioned once in either the company's most recent annual report or most recent conference call. Further, even if the U.S.-China trade war dampens global corporate investment, one thing corporations are  not  likely to cut back on is security spend.",
    "Consequently, with OKTA stock, you have a red hot stock that is supported by robust secular growth tailwinds which are largely unaffected by the U.S.-China trade war. That's a winning combination in today's flat market.",
    "% Gain Over Last 19 Months:  75%",
    "Exposure to China: None",
    "Revenue CAGR Estimate over Next Two Years (from YCharts): 15%",
    "Another high-growth U.S. technology company that looks like a good buy in a trade war afflicted market is Twitter (NYSE: TWTR ).",
    "First, and foremost, Twitter has no China exposure. The Twitter platform is blocked in China, and all of the platform's users are from outside of China. Thus, U.S.-China trade war turbulence shouldn't have any impact on the user base, and it likely won't have much impact on the ad business until business uncertainty escalates to the point where they start cutting ad spend - and we appear to be far from that point today.",
    "Second, Twitter has been on fire over the past near two years. The company's revenue growth rates have come surging back, and have remained vigorous as the company has figured out how to optimally advertise on its platform. Meanwhile, user growth trends have been stable, and margins have tracked higher alongside big revenue growth, thereby powering huge profit growth. Alongside this big profit growth, TWTR stock has flown higher - to the tune of a 75% gain since the trade war started in early 2018.",
    "Third, Twitter still has a lot of growth firepower left. The company is a 1% (and expanding) share player in a secular growth global digital ad market projected to grow at a double-digit rate for the foreseeable future. That combination of share expansion and double-digit market growth implies that mid-teens revenue growth is achievable over the next several years, which is what analysts are modeling for. On top of that, operating margins are just 14%, versus over 30% at Facebook (NASDAQ: FB ), so Twitter has plenty of runway to drive further positive operating leverage in the long run.",
    "Big picture, Twitter has very minimal exposure to the trade war, has been on fire lately in terms of growth and share price appreciation, and has plenty of room to keep growing at a big pace for a lot longer. Those are the exact features which investors will continue to be attracted to in a flat market.",
    "% Gain Over Last 19 Months:  400%",
    "Revenue Exposure to China:  Minimal",
    "Revenue CAGR Estimate over Next Two Years (from YCharts): 30%",
    "Last, but not least, on this list of hot stocks to buy in a flat market is cloud communications leader Twilio (NASDAQ: TWLO ).",
    "As with all the other stocks on this list, Twilio checks off all the right boxes. Red hot stock? Check. TWLO stock is up 400% since the trade war begun, thanks to a series of consecutive beat-and-raise reports. Minimal exposure to China? Check. Only a quarter of revenue comes from outside of the U.S.",
    "Big growth potential? Check. Every company is integrating cloud communications into their customer experiences, and as they do, Twilio's revenue growth trajectory will remain robust for the next several years - hence analysts expecting a 30% revenue CAGR here over the next two years.",
    "Net net, Twilio is a winning stock in a flat market. It projects to remain so for the foreseeable future, too.",
    "As of this writing, Luke Lango was long SHOP, ROKU, TTD, CHGG and OKTA.",
    "The post 7 Stocks to Buy In a Flat Market appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:32:16"
}