{
  "url": "https://www.nasdaq.com/article/lesson-from-slack-works-first-earnings-report-may-not-be-what-you-think-cm1207905",
  "title": "Lesson From Slack (WORK)'s First Earnings Report May Not Be What You Think - Nasdaq.com",
  "text": [
    "The first couple of earnings reports from recently IPO’d companies are always interesting. Even though the information given during an offering is subject to a lot of scrutiny, there is a feeling that early official filings give a sense of what is really going on, rather than what the company wants the market to know. That often leads to an overreaction in the stock once earnings are released, and that can create good opportunities for investors.",
    "Slack (WORK)’s initial offering was a private listing rather than a full public offering, but their release yesterday still fits that description.",
    "The headline numbers contained in the filing were great, but this was one of those earnings releases that so often confound and confuse those new to the ways of the stock market. Slack posted an adjusted loss of $0.14 per share, versus expectations for an $0.18 loss, on revenue of $145 million, well above the $140.7 million consensus estimate. WORK jumped initially on that top and bottom line beat, but quickly reversed and at the time of writing is indicating an opening nearly fifteen percent below yesterday’s close.",
    "As is so often the case, what ultimately hurt the stock was not the headline, backward looking numbers, but the forward-looking guidance offered by the company. Slack said in a statement that accompanied the release that they were anticipating a loss of 8 to 9 cents per share in the third quarter on revenue of $154-156 million versus estimates for a loss of 7 cents on just over $153 million. For their full financial year, they guided to a loss of 40-42 cents on $603-610 million. Analysts were expecting 40 cents on $601 million.",
    "Obviously, that worse than expected guidance for EPS wasn’t good news, but does it really justify a fifteen percent drop in the stock? Admittedly the sample size is small, but if you look at this quarter’s numbers and previous guidance, it seems not.",
    "The fact that Slack beat not only analysts’ expectations for this quarter but also their own early estimates for Q2 revenue of $139-141 million handily should tell us something about how to treat this guidance. Management obviously resisted the temptation to exaggerate their prospects when going public, so it is only reasonable to assume that they are being conservative here too.",
    "The concern voiced by many about the future for Slack is that their main competitor is Microsoft (MSFT), who include a similar workplace communication app that they call “Team” in business subscriptions to Office 365. Going up against a giant like Microsoft, whose product is essentially free is not an ideal situation, but you should keep in mind that even with that competition, Slack posted a 58% year over year growth in revenue in yesterday’s report.",
    "There is, it seems, room for both systems to prosper.",
    "It is interesting to me that Slack’s guidance is for lower profit, or rather a bigger loss, than most had anticipated, but on higher revenue. They are basically saying that they will continue to grow but will be investing more back into the business. We cannot know at this point if that investment will pay off, but a fifteen percent drop in the stock is pricing in the worst possible outcome, and that makes no sense.",
    "As I said, we can learn a lot from the early earnings releases of a newly public company. In this case, the lesson we should learn is not necessarily the obvious one. Yes, lower than expected guidance is disappointing, but it suggests that Slack’s management are managing expectations, while investing for future growth. That isn’t a bad thing, so a bounce back in the stock before long looks to be on the cards.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:44:48"
}