{
  "url": "https://www.nasdaq.com/article/where-to-find-small-cap-value-stocks-cm1207952",
  "title": "Where to Find Small Cap Value Stocks - Nasdaq.com",
  "text": [
    "      (0:30) - Finding Value In Small Cap Stocks (5:10) - Stock Screener Criteria  (9:00) - Tracey's Top Stock Picks (23:45) - Episode Roundup:   XPER, MATW, AJX, MOFG, FBIZ     Welcome to Episode #157 of the Value Investor Podcast Every week, Tracey Ryniec, the editor of Zacks Value Investor portfolio  , shares some of her top value investing tips and stock picks. This week, she turns her attention to small cap value stocks. Could any category be more hated? But it was back in the news after hedge fund manager Michael Burry, who rose to fame thanks to his bet against the housing bubble which was outlined in Michael Lewis' book Money Ball, said he was finding investing opportunities in small cap value stocks.  How Do You Find Small Cap Value Stocks?  Small caps, in general, usually have the least amount of information available to investors. And they are more lightly covered by the Street analysts. Investors have to really dig down deep to find small cap gems.  Screening for Small Cap Value Stocks  A basic value screen with a forward P/E under 10, a Zacks Rank of #1 (Strong Buy) and #2 (Buy), which should produce companies with rising earnings estimates, and a market cap under $1 billion, produced a list of 57 companies. That's a long list to go through. But how can you get quality small cap names? The same screen with some dividend requirements, including a history of having paid one for 5 years, narrowed the list to just 8 names. It's not easy for smaller companies to pay a dividend. And these companies have been paying out for at least 5 years.  5 Cheap Small Cap Stocks with Dividends  1.       Xperi Corporation XPER   creates innovative technology solutions. With a market cap of $918 million, it is dirt cheap with a forward P/E of just 6.7. It also has a juicy dividend, currently yielding 4.4%. It's a Zacks Rank #1 (Strong Buy). 2.       Matthews International MATW   has 3 business segments: SGK Brand Solutions; Memorialization, which includes caskets and cremation equipment; and Industrial Technologies which designs and makes marking, coding and industrial automation technologies. The company has a market cap of $925 million and is shareholder friendly as it's both repurchasing shares and pays a dividend currently yielding 2.7%. It's a Zacks Rank #2 (Buy). 3.       Great Ajax AJX   is a REIT which acquires and manages a portfolio of mortgage loans secured by single family homes and commercial properties, as well as non-performing loans. It has a market cap of $305 million. It pays the highest dividend of this group, with a yield of 8.8%. It's a Zacks Rank #2 (Buy). 4.       First Business Financial Services FBIZ   is the smallest company on this list with a market cap of just $188 million. It focuses on businesses, executives and high net worth individuals. Last quarter, it had record quarterly results backed by strong loan and deposit growth. It's cheap, with a forward P/E of just 8.7. It's a Zacks Rank #2 (Buy). 5.       MidWest One Financial Group MOFG   is the parent of MidWest One Bank which has 44 offices in Iowa, Minnesota, Wisconsin, Florida and Colorado. It has a market cap of $452 million. The bank is cheap with a forward P/E of just 9.1. It does pay shareholders for their patience, with a dividend yielding 2.8%. It's a Zacks Rank #2 (Buy). What else should investors know about finding small cap value stocks? Find out on this week's podcast.  Biggest Tech Breakthrough in a Generation  makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Tessera Holding Corporation (XPER): Free Stock Analysis Report   MidWestOne Financial Group, Inc. (MOFG): Free Stock Analysis Report   First Business Financial Services, Inc. (FBIZ): Free Stock Analysis Report   Matthews International Corporation (MATW): Free Stock Analysis Report   Great Ajax Corp. (AJX): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Welcome to Episode #157 of the Value Investor Podcast",
    "Every week, Tracey Ryniec, the editor of Zacks Value Investor portfolio  , shares some of her top value investing tips and stock picks.",
    "This week, she turns her attention to small cap value stocks.",
    "Could any category be more hated?",
    "But it was back in the news after hedge fund manager Michael Burry, who rose to fame thanks to his bet against the housing bubble which was outlined in Michael Lewis' book Money Ball, said he was finding investing opportunities in small cap value stocks.",
    " How Do You Find Small Cap Value Stocks? ",
    "Small caps, in general, usually have the least amount of information available to investors. And they are more lightly covered by the Street analysts.",
    "Investors have to really dig down deep to find small cap gems.",
    " Screening for Small Cap Value Stocks ",
    "A basic value screen with a forward P/E under 10, a Zacks Rank of #1 (Strong Buy) and #2 (Buy), which should produce companies with rising earnings estimates, and a market cap under $1 billion, produced a list of 57 companies.",
    "That's a long list to go through.",
    "But how can you get quality small cap names?",
    "The same screen with some dividend requirements, including a history of having paid one for 5 years, narrowed the list to just 8 names.",
    "It's not easy for smaller companies to pay a dividend. And these companies have been paying out for at least 5 years.",
    " 5 Cheap Small Cap Stocks with Dividends ",
    "1.       Xperi Corporation XPER   creates innovative technology solutions. With a market cap of $918 million, it is dirt cheap with a forward P/E of just 6.7. It also has a juicy dividend, currently yielding 4.4%. It's a Zacks Rank #1 (Strong Buy).",
    "2.       Matthews International MATW   has 3 business segments: SGK Brand Solutions; Memorialization, which includes caskets and cremation equipment; and Industrial Technologies which designs and makes marking, coding and industrial automation technologies. The company has a market cap of $925 million and is shareholder friendly as it's both repurchasing shares and pays a dividend currently yielding 2.7%. It's a Zacks Rank #2 (Buy).",
    "3.       Great Ajax AJX   is a REIT which acquires and manages a portfolio of mortgage loans secured by single family homes and commercial properties, as well as non-performing loans. It has a market cap of $305 million. It pays the highest dividend of this group, with a yield of 8.8%. It's a Zacks Rank #2 (Buy).",
    "4.       First Business Financial Services FBIZ   is the smallest company on this list with a market cap of just $188 million. It focuses on businesses, executives and high net worth individuals. Last quarter, it had record quarterly results backed by strong loan and deposit growth. It's cheap, with a forward P/E of just 8.7. It's a Zacks Rank #2 (Buy).",
    "5.       MidWest One Financial Group MOFG   is the parent of MidWest One Bank which has 44 offices in Iowa, Minnesota, Wisconsin, Florida and Colorado. It has a market cap of $452 million. The bank is cheap with a forward P/E of just 9.1. It does pay shareholders for their patience, with a dividend yielding 2.8%. It's a Zacks Rank #2 (Buy).",
    "What else should investors know about finding small cap value stocks?",
    "Find out on this week's podcast.",
    " Biggest Tech Breakthrough in a Generation  makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:26:00"
}