{
  "url": "https://www.nasdaq.com/article/zackscom-featured-highlights-include-davita-hibbett-first-horizon-universal-forest-and-popular-cm1210457",
  "title": "Zacks.com featured highlights include: DaVita, Hibbett, First Horizon, Universal Forest and Popular - Nasdaq.com",
  "text": [
    "  For Immediate Release  Chicago, IL - September 11, 2019 - Stocks in this week's article are DaVita Inc. DVA  , Hibbett Sports, Inc. HIBB  , First Horizon National Corp. FHN  , Universal Forest Products, Inc. UFPI  and Popular, Inc. BPOP  .   5 Stocks with Amazingly Low EV/EBITDA Ratios to Own     Now   Price-to-earnings (P/E), given its apparent simplicity, is the most commonly used metric in the value investing world. The ratio enjoys greater popularity among valuation metrics in the investment toolkit and is preferred while uncovering stocks trading at attractive prices. But even this straightforward, easy-to-calculate equity valuation multiple is not devoid of limitations.  What Makes EV/EBITDA a Better Choice?  While P/E is by far the most-popular valuation metric, a more-complicated metric called EV/EBITDA does a better job in working out the fair market value of a firm. Often viewed as a better substitute to P/E, this ratio offers a clearer picture of a company's valuation and its earnings potential. Also dubbed as the enterprise multiple, EV/EBITDA is essentially the enterprise value (EV) of a stock divided by its earnings before interest, taxes, depreciation and amortization (EBITDA). EV is the sum of a company's market capitalization, its debt and preferred stock minus cash and cash equivalents. Essentially, it is the total value of a company. EBITDA, the other component of the ratio, gives the true picture of a company's profitability as it eliminates the impact of non-cash expenses like depreciation and amortization that depress ne t earnings  . It is also often used as a proxy for cash flows. Just like P/E, the lower the EV/EBITDA ratio, the more appealing it is. A low EV/EBITDA ratio could be a sign that a stock is potentially undervalued. However, unlike P/E ratio, EV/EBITDA takes into account the debt on a company's balance sheet. For this reason, EV/EBITDA is usually used to value possible acquisition targets. Stocks with a low EV/EBITDA multiple could be seen as potential takeover candidates. P/E also can't be used to value a loss-making firm. A company's earnings are also subject to accounting estimates and management manipulation. On the other hand, EV/EBITDA is difficult to manipulate and can also be used to value companies that are making loss but are EBITDA-positive. EV/EBITDA is also a useful yardstick in measuring the value of firms that are highly leveraged and have a high degree of depreciation. Moreover, it can be used to compare companies with different levels of debt. However, EV/EBITDA has its limitations too. It varies across industries and is generally not appropriate while comparing stocks in different industries given their diverse capital spending requirements. As such, a strategy entirely based on EV/EBITDA might not fetch the desired outcome. But you can club it with other major ratios such as price-to-book (P/B), P/E and price-to-sales (P/S) to screen true value stocks.  For the rest of this Screen of the Week article please   visit Zacks.com at:    https://www.zacks.com/stock/news/510849/5-stocks-with-amazingly-low-evebitda-ratios-to-own-now   Disclosure: Officers, directors and/or employees of Zacks   Investment Research may own or have sold short securities and/or   hold long and/or short positions in options that are mentioned in   this material. An affiliated investment advisory firm may own or   have sold short securities and/or hold long and/or short   positions in options that are mentioned in this material.   About Screen of the Week  Zacks.com created the first and best screening system on the web earning the distinction as the \"#1 site for screening stocks\" by Money Magazine.  But powerful screening tools is just the start. That is why Zacks created the Screen of the Week to highlight profitable stock picking strategies that investors can actively use.  Strong Stocks that Should Be in the News  Many are little publicized and fly under the Wall Street radar. They're virtually unknown to the general public. Yet today's 220 Zacks Rank #1 \"Strong Buys\" were generated by the stock-picking system that has more than doubled the market from 1988 through 2016. Its average gain has been a stellar +25% per year. See these high-potential stocks free >>.  Follow us on Twitter:   http://twitter.com/zacksresearch  Join us on Facebook:  http://www.facebook.com/ZacksInvestmentResearch  Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates. Contact: Jim Giaquinto Company: Zacks.com Phone: 312-265-9268 Email: pr@zacks.com  Visit: www.Zacks.com  Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer  . Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  First Horizon National Corporation (FHN): Free Stock Analysis Report   Popular, Inc. (BPOP): Free Stock Analysis Report   Universal Forest Products, Inc. (UFPI): Free Stock Analysis Report   DaVita Inc. (DVA): Free Stock Analysis Report   Hibbett Sports, Inc. (HIBB): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " For Immediate Release ",
    "Chicago, IL - September 11, 2019 - Stocks in this week's article are DaVita Inc. DVA  , Hibbett Sports, Inc. HIBB  , First Horizon National Corp. FHN  , Universal Forest Products, Inc. UFPI  and Popular, Inc. BPOP  .",
    "  5 Stocks with Amazingly Low EV/EBITDA Ratios to Own     Now  ",
    "Price-to-earnings (P/E), given its apparent simplicity, is the most commonly used metric in the value investing world. The ratio enjoys greater popularity among valuation metrics in the investment toolkit and is preferred while uncovering stocks trading at attractive prices. But even this straightforward, easy-to-calculate equity valuation multiple is not devoid of limitations.",
    " What Makes EV/EBITDA a Better Choice? ",
    "While P/E is by far the most-popular valuation metric, a more-complicated metric called EV/EBITDA does a better job in working out the fair market value of a firm. Often viewed as a better substitute to P/E, this ratio offers a clearer picture of a company's valuation and its earnings potential.",
    "Also dubbed as the enterprise multiple, EV/EBITDA is essentially the enterprise value (EV) of a stock divided by its earnings before interest, taxes, depreciation and amortization (EBITDA). EV is the sum of a company's market capitalization, its debt and preferred stock minus cash and cash equivalents. Essentially, it is the total value of a company.",
    "EBITDA, the other component of the ratio, gives the true picture of a company's profitability as it eliminates the impact of non-cash expenses like depreciation and amortization that depress ne t earnings  . It is also often used as a proxy for cash flows.",
    "Just like P/E, the lower the EV/EBITDA ratio, the more appealing it is. A low EV/EBITDA ratio could be a sign that a stock is potentially undervalued.",
    "However, unlike P/E ratio, EV/EBITDA takes into account the debt on a company's balance sheet. For this reason, EV/EBITDA is usually used to value possible acquisition targets. Stocks with a low EV/EBITDA multiple could be seen as potential takeover candidates.",
    "P/E also can't be used to value a loss-making firm. A company's earnings are also subject to accounting estimates and management manipulation. On the other hand, EV/EBITDA is difficult to manipulate and can also be used to value companies that are making loss but are EBITDA-positive.",
    "EV/EBITDA is also a useful yardstick in measuring the value of firms that are highly leveraged and have a high degree of depreciation. Moreover, it can be used to compare companies with different levels of debt.",
    "However, EV/EBITDA has its limitations too. It varies across industries and is generally not appropriate while comparing stocks in different industries given their diverse capital spending requirements.",
    "As such, a strategy entirely based on EV/EBITDA might not fetch the desired outcome. But you can club it with other major ratios such as price-to-book (P/B), P/E and price-to-sales (P/S) to screen true value stocks.",
    " For the rest of this Screen of the Week article please   visit Zacks.com at:    https://www.zacks.com/stock/news/510849/5-stocks-with-amazingly-low-evebitda-ratios-to-own-now ",
    " Disclosure: Officers, directors and/or employees of Zacks   Investment Research may own or have sold short securities and/or   hold long and/or short positions in options that are mentioned in   this material. An affiliated investment advisory firm may own or   have sold short securities and/or hold long and/or short   positions in options that are mentioned in this material. ",
    " About Screen of the Week ",
    "Zacks.com created the first and best screening system on the web earning the distinction as the \"#1 site for screening stocks\" by Money Magazine.  But powerful screening tools is just the start. That is why Zacks created the Screen of the Week to highlight profitable stock picking strategies that investors can actively use.",
    " Strong Stocks that Should Be in the News ",
    "Many are little publicized and fly under the Wall Street radar. They're virtually unknown to the general public. Yet today's 220 Zacks Rank #1 \"Strong Buys\" were generated by the stock-picking system that has more than doubled the market from 1988 through 2016. Its average gain has been a stellar +25% per year. See these high-potential stocks free >>. ",
    "Follow us on Twitter:   http://twitter.com/zacksresearch ",
    "Join us on Facebook:  http://www.facebook.com/ZacksInvestmentResearch ",
    "Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.",
    "Contact: Jim Giaquinto",
    "Company: Zacks.com",
    "Phone: 312-265-9268",
    "Email: pr@zacks.com ",
    "Visit: www.Zacks.com ",
    "Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer  .",
    "Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit  http://www.zacks.com/performance   for information about the performance numbers displayed in this press release.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:30:00"
}