{
  "url": "https://www.nasdaq.com/article/do-this-now-to-recession-proof-your-portfolio-and-grab-65-dividends-cm1206566",
  "title": "Do This Now to “Recession-Proof” Your Portfolio (and grab 6.5% dividends) - Nasdaq.com",
  "text": [
    "By Brett Owens",
    "Are you worried that youaEURtmre going to outlive your money? ItaEURtms a fair concern with interest rates low and heading lower.",
    "To put it bluntly, many well-off retirees are at serious risk of having to pick up a aEURoeside hustleaEUR to avoid dying broke. Passive income in the popular retirement aEURoego-tosaEUR is simply no help today, as the average S&P 500 stock pays a skimpy 1.9% now. Ten-year Treasuries? Even worse, at just 1.5%.",
    "So unless youaEURtmve got $2.1 million laying around to invest in the typical blue chip stockaEUR\"enough to get you a $40,000 annual dividend streamaEUR\"youaEURtmll likely have to sell some of your stocks to supplement your dividend income.",
    "ThataEURtms a very dangerous course right now, because of this:",
    "aEURoeRecession AlertaEUR Turns Red",
    "WeaEURtmre looking at the yield on the 2-year Treasury note (in orange) and the yield on the 10-year (blue). When these yields aEURoeinvertaEURaEUR\"as they are nowaEUR\"theyaEURtmre the canary in the coal mine: this setup has predicted the last seven recessions.",
    "Millions of Retirees About to Get Hit",
    "This indicator is putting millions of retirees on notice. But many will ignore it because they follow a strategy their adviser says is safe, but is, in fact, anything but.",
    "ThataEURtms the aEURoe4% rule.aEUR You know the one: where you withdraw up to 4% of your portfolio a year to supplement your dividend income.",
    "Sounds reasonable, right? Well, I hope you havenaEURtmt fallen into this trap. Because the 4% fiasco can only magnify your losses (and crush your income) when you hit a patch like this:",
    "The 4% Rule Slams Into Reality",
    "This is a snapshot of Apple ( AAPL ) stockaEURtms 33% plunge during the late 2018 correction, which was much worse than the 20% fall in the market as a whole.",
    "If you were following the 4% rule, you were forced to withdraw money at exactly the wrong time. AppleaEURtms dividend was fine (in fact, the company announced a big hike a few months before the meltdown). But you still needed to sell shares for more income.",
    "Remember the benefits of dollar-cost averaging that built your retirement portfolio? This is the same, but in reverse! YouaEURtmre selling more shares when prices are lowaEUR\"which hurts your income stream even moreaEUR\"and fewer when prices are high .",
    "ItaEURtms a aEURoeretirement death spiralaEUR with one outcome: outliving your money!",
    "The Solution: aEURoePullback-ProofaEUR Dividends",
    "Instead of Wall StreetaEURtms flawed 4% rule, weaEURtmre going to transition your nest egg into what I call aEURoepullback-proofaEUR dividends. These stout dividend payers have two critical strengths that protect and grow your savings no matter what:",
    "LetaEURtms dive into two dividends that tick these boxes. IaEURtmm zeroing in on these two because between them, they give you a ton of diversification, with real estate investment trusts (REITs) , blue chip stocks and high-yielding preferred stocks.",
    "Pick No. 1: Tap This aEURoeInvestor Blind SpotaEUR for Big Gains (and 6.5% Dividends)",
    "Like the proverbial generals fighting the last war, many folks simply wonaEURtmt touch real estate, because it triggered the aEURtm08/aEURtm09 crisis.",
    "ThataEURtms too bad, because theyaEURtmre missing out on one of the steadiest, highest-yielding corners of the market. Right now, the benchmark Vanguard Real Estate ETF ( VNQ ), yields 3.3%, nearly double the typical S&P 500 name.",
    "WhataEURtms more, in the late-2018 crash, REITs fell half as much as stocks. And because of REITsaEURtm higher dividends, owners of these stocks had far less need to sell into the downturn:",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:30:02"
}