{
  "url": "https://www.nasdaq.com/article/irelands-cairn-homes-to-pay-out-dividend-start-buyback-20190912-00118",
  "title": "Ireland's Cairn Homes to pay out dividend, start buyback - Nasdaq.com",
  "text": [
    "By Padraic Halpin",
    "DUBLIN, Sept 12 (Reuters) - Ireland's largest publicly listed housebuilder Cairn Homes  on Thursday announced plans to buy back shares and issue a dividend for the first time, saying Brexit was having no impact on the market for homes for first-time buyers.",
    "Still, shares in Cairn fell 5% to 1.1 euros by 0815 GMT, as weaker than expected margins overshadowed a 51% rise in operating profit for the first half of the year.",
    "Cairn, which became the first Irish housebuilder to float in almost 20 years in 2015 as a recovery from a real estate crash gathered pace, said it will pay a 2.5 euro cents interim dividend and begin a 25 million euro share buyback.",
    "First half revenues rose 48% to 192 million euros and Cairn said it expects to generate about 500 million euros - or 60% of its market capitalisation - in free cash over the next three years as it completes 5,250 new homes across 15 active sites.",
    "House prices have begun to stabilise in recent months in Ireland. In an interview, Cairn CEO Michael Stanley said the starter home market it focuses on was not affected by the nervousness around a fallout from Brexit, which was holding back potential buyers of more expensive homes.",
    "\"It's very obvious from our numbers on the sale side that that's not filtering down in any way to first time buyers side or institutional capital when it comes to PRS (private rental sector),\" Stanley told Reuters.",
    "\"Once we're building homes at the appropriate price level, bluntly we can't build them fast enough. The vast majority of people buying our homes are couples, young families making life decisions.\"",
    "\"If you asked them what a backstop is at any of our show units this weekend, they'd look at you funny and say show me where the dishwasher is,\" he said, referring to a clause relating to the Irish border in Britain's divorce deal with the European Union. \"They're just not focussed on it.\"",
    "Stanley said he saw an \"average to poor\" response to a lack of supply continuing, keeping rents sky high and maintaining the strong demand for Dublin-focussed Cairn's midpriced homes as it grows at more than three times the market rate.",
    "\"It's just going to take time and not going to happen in the next couple of years in my view because it's just difficult for private housebuilders to scale up,\" he said.",
    "\"It's 50% more expensive to rent one of our starter homes than buy one - that's an extraordinary number that people don't seem to fully understand... That's a compelling proposition for our customers.\""
  ],
  "published_datetime": "2019-09-12 04:30:00"
}