{
  "url": "https://www.nasdaq.com/article/ukrainian-tax-authority-refutes-comments-by-official-on-arcelormittal-probe-20190904-00939",
  "title": "Ukrainian tax authority refutes comments by official on ArcelorMittal probe - Nasdaq.com",
  "text": [
    "KIEV, Sept 4 (Reuters) - Ukraine's state tax service on Wednesday said no decisions had been made about a probe into ArcelorMittal  taxes, dismissing comments by one of its own officials who had said the steelmaker owed the state 9 billion hryvnias ($355 million).",
    "Evgen Bambizov, who is listed on the department's website as head of the large taxpayers' office, had spoken to media about an investigation into ArcelorMittal. He was quoted as saying the company had paid too little tax.",
    "But the state tax service said Bambizov did not have the authority to speak about the probe because he was not the head of the large taxpayers' office but the head of a commission on reorganising that office.",
    "\"Currently, tax audits of these enterprises have not been completed; no decisions have been made.\"",
    "Bambizov's press office issued a statement saying that he was still in charge of the large taxpayers' office, however, and that he stood by his earlier comments on the probe.",
    "ArcelorMittal, Ukraine's biggest private foreign investor, has been in the spotlight after an environmental investigation at its plant in the city of Kryvyi Rih was launched this year.",
    "That investigation caused some concern among investors at a time when new Ukrainian President Volodymyr Zelenskiy, who is from Kryvyi Rih and criticised ArcelorMittal in July, is pitching to make the country more business friendly. ",
    "In its own statement on Wednesday, ArcelorMittal said there had been a probe by the large taxpayers' office between May and August but that it had not been notified of the results or been given time to give its own statements about the audit.",
    "\"In this regard, we were extremely surprised by today's public statements by the head of the office of large taxpayers,\" it said.",
    "\"We believe that it is premature and incorrect to make public statements before submitting a tax audit report to an enterprise. We cannot consider such statements as anything other than biased and aimed at unreasonably discrediting the business reputation of the enterprise.\""
  ],
  "published_datetime": "2019-09-04 02:57:00"
}