{
  "url": "https://www.nasdaq.com/article/is-paycom-software-payc-stock-outpacing-its-computer-and-technology-peers-this-year-cm1207177",
  "title": "Is Paycom Software (PAYC) Stock Outpacing Its Computer and Technology Peers This Year? - Nasdaq.com",
  "text": [
    " Investors focused on the Computer and Technology space have likely heard of Paycom Software (PAYC), but is the stock performing well in comparison to the rest of its sector peers? One simple way to answer this question is to take a look at the year-to-date performance of PAYC and the rest of the Computer and Technology group's stocks. Paycom Software is one of 638 companies in the Computer and Technology group. The Computer and Technology group currently sits at #8 within the Zacks Sector Rank. The Zacks Sector Rank considers 16 different sector groups. The average Zacks Rank of the individual stocks within the groups is measured, and the sectors are listed from best to worst. The Zacks Rank is a proven system that emphasizes earnings estimates and estimate revisions, highlighting a variety of stocks that are displaying the right characteristics to beat the market over the next one to three months. PAYC is currently sporting a Zacks Rank of #2 (Buy). Over the past three months, the Zacks Consensus Estimate for PAYC's full-year earnings has moved 5.09% higher. This shows that analyst sentiment has improved and the company's earnings outlook is stronger. Based on the most recent data, PAYC has returned 99.49% so far this year. At the same time, Computer and Technology stocks have gained an average of 18.07%. As we can see, Paycom Software is performing better than its sector in the calendar year. Breaking things down more, PAYC is a member of the Internet - Software industry, which includes 89 individual companies and currently sits at #103 in the Zacks Industry Rank. This group has gained an average of 28.64% so far this year, so PAYC is performing better in this area. Investors with an interest in Computer and Technology stocks should continue to track PAYC. The stock will be looking to continue its solid performance.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Paycom Software, Inc. (PAYC): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors focused on the Computer and Technology space have likely heard of Paycom Software (PAYC), but is the stock performing well in comparison to the rest of its sector peers? One simple way to answer this question is to take a look at the year-to-date performance of PAYC and the rest of the Computer and Technology group's stocks.",
    "Paycom Software is one of 638 companies in the Computer and Technology group. The Computer and Technology group currently sits at #8 within the Zacks Sector Rank. The Zacks Sector Rank considers 16 different sector groups. The average Zacks Rank of the individual stocks within the groups is measured, and the sectors are listed from best to worst.",
    "The Zacks Rank is a proven system that emphasizes earnings estimates and estimate revisions, highlighting a variety of stocks that are displaying the right characteristics to beat the market over the next one to three months. PAYC is currently sporting a Zacks Rank of #2 (Buy).",
    "Over the past three months, the Zacks Consensus Estimate for PAYC's full-year earnings has moved 5.09% higher. This shows that analyst sentiment has improved and the company's earnings outlook is stronger.",
    "Based on the most recent data, PAYC has returned 99.49% so far this year. At the same time, Computer and Technology stocks have gained an average of 18.07%. As we can see, Paycom Software is performing better than its sector in the calendar year.",
    "Breaking things down more, PAYC is a member of the Internet - Software industry, which includes 89 individual companies and currently sits at #103 in the Zacks Industry Rank. This group has gained an average of 28.64% so far this year, so PAYC is performing better in this area.",
    "Investors with an interest in Computer and Technology stocks should continue to track PAYC. The stock will be looking to continue its solid performance.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:11"
}