{
  "url": "https://www.nasdaq.com/article/3-dow-jones-stocks-with-great-trade-setups-right-now-cm1207601",
  "title": "3 Dow Jones Stocks With Great Trade Setups Right Now - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Contrasting and sparring forces off and on the price charts have made investing - long or short - in recent weeks a tough proposition. As much it may be time to consider hedging today's volatility by taking advantage of the charts of these three Dow Jones stocks.",
    "In some respects August was a tough one for Dow Jones stocks. Shares of the iconic market barometer finished off by about 1.20%. At its worst, the index shed nearly 7.3% from its mid-July high. Of course, with gnawing trade war theater and an inverted yield curve warning of a looming global recession, it's easy to see why this period was tough on bulls.",
    "Now investors considering stocks to buy have entered the historically volatile and bearish calendar month of September, but that doesn't mean only bad news for traders.",
    "Away from most headlines catching Wall Street's attention, the broader market signaled a bullish technical-based follow-through day on August 13 th . Historically, most every significant market rally has begun with this type of bottoming action.",
    "So, what's an investor really supposed to do? I'd propose it's time to hedge blanket style bullish or bearish forecasts and simply find stocks to buy and stocks to short. And in the price charts of Dow Jones stocks Walt Disney (NYSE: DIS ), Cisco  (NASDAQ: CSCO ) and Goldman Sachs (NYSE: GS ) investors have three diversified picks for bullish and bearish exposure.",
    "Disney is the first of our Dow Jones stocks, and this one is a stock to buy. Sometimes investing can be as simple as buying what you use. That philosophy was made popular by legendary Fidelity manager Peter Lynch, and the advice now has the added support of the DIS stock chart.",
    "Technically, this stock to buy is setting up in a five-month long base-on-base pattern after storming out of lengthy 3.5-year triangle base to all-time-highs. The expectation is DIS stock can mirror its bullish run from 2012 - 2015.",
    "With Disney shares near $137, this forecast translates into a rally which should challenge $200 before all is said and done. My recommendation for DIS stock is to use the August hammer candlestick for a confirmation signal to go long. Likewise, respecting this price pattern makes sense off and on the price chart.",
    "Cisco is the second of our Dow Jones stocks. A mixed earnings report landed shares in the dog house in July. However, with CSCO stock poised to capitalize on the 5G market and already capturing market share in growth areas like hybrid-cloud computing and security, today's weakness should provide a nice platform for tomorrow's long-term winner.",
    "\r\n Click to Enlarge On the monthly price chart shares are testing the top layer of a key support zone within CSCO stock's uptrend. The area holds pattern price congestion, a couple trend-lines and longer-term Fibonacci levels to back up a purchase.",
    "As this price area in Cisco is volatile and spans 18% from $39 to $48, I'd suggest drilling down the price action for this stock to buy when purchasing shares. The weekly chart shows CSCO stock has formed two weeks of inside trading and is on its way to carving a third. To capitalize on this potential bottoming, I'd recommend this as a stock to buy above $48 and set an initial stop beneath $44.85 to contain risk off and on the price chart.",
    "Goldman Sachs is the last of our Dow Jones stocks. Here, the conversation and fears tied to an inverted yield curve and shares having just challenged and failed to clear its former pre-crisis high set in 2008 sets the stage for shorting GS stock.",
    "Technically, the icing on the cake is a supportive-looking stochastics for going short shares. Having said that, I'm not entirely certain if a bearish flag will trump an uptrend of 10 years. So I'd recommend this as a Dow Jones stock to sell if pattern support near $191 fails.",
    "Disclosure: Investment accounts under Christopher Tyler's management do not currently own positions in securities mentioned in this article. The information offered is based upon Christopher Tyler's observations and strictly intended for educational purposes only; the use of which is the responsibility of the individual. For additional market insights and related musings, follow Chris on Twitter @Options_CAT and  StockTwits",
    "The post 3 Dow Jones Stocks With Great Trade Setups Right Now appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:21:25"
}