{
  "url": "https://www.nasdaq.com/article/brady-brc-upgraded-to-buy-heres-what-you-should-know-cm1210306",
  "title": "Brady (BRC) Upgraded to Buy: Here's What You Should Know - Nasdaq.com",
  "text": [
    " Brady (BRC) could be a solid choice for investors given its recent upgrade to a Zacks Rank #2 (Buy). This upgrade primarily reflects an upward trend in earnings estimates, which is one of the most powerful forces impacting stock prices. The sole determinant of the Zacks rating is a company's changing earnings picture. The Zacks Consensus Estimate -- the consensus of EPS estimates from the sell-side analysts covering the stock -- for the current and following years is tracked by the system. The power of a changing earnings picture in determining near-term stock price movements makes the Zacks rating system highly useful for individual investors, since it can be difficult to make decisions based on rating upgrades by Wall Street analysts. These are mostly driven by subjective factors that are hard to see and measure in real time. Therefore, the Zacks rating upgrade for Brady basically reflects positivity about its earnings outlook that could translate into buying pressure and an increase in its stock price.  Most Powerful Force Impacting Stock Prices  The change in a company's future earnings potential, as reflected in earnings estimate revisions, and the near-term price movement of its stock are proven to be strongly correlated. The influence of institutional investors has a partial contribution to this relationship, as these big professionals use earnings and earnings estimates to calculate the fair value of a company's shares. An increase or decrease in earnings estimates in their valuation models simply results in higher or lower fair value for a stock, and institutional investors typically buy or sell it. Their transaction of large amounts of shares then leads to price movement for the stock. For Brady, rising earnings estimates and the consequent rating upgrade fundamentally mean an improvement in the company's underlying business. And investors' appreciation of this improving business trend should push the stock higher.  Harnessing the Power of Earnings Estimate   Revisions  As empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock movements, tracking such revisions for making an investment decision could be truly rewarding. Here is where the tried-and-tested Zacks Rank stock-rating system plays an important role, as it effectively harnesses the power o f earnings  estimate revisions. The Zacks Rank stock-rating system, which uses four factors related to earnings estimates to classify stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), has an impressive externally-audited track record, with Zacks Rank #1 stocks generating an average annual return of +25% since 1988. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here >>>>  .  Earnings Estimate Revisions for Brady  For the fiscal year ending July 2020, this identification and security products maker is expected to earn $2.57 per share, which is a change of 4.5% from the year-ago reported number. Analysts have been steadily raising their estimates for Brady. Over the past three months, the Zacks Consensus Estimate for the company has increased 3.1%.  Bottom Line  Unlike the overly optimistic Wall Street analysts whose rating systems tend to be weighted toward favorable recommendations, the Zacks rating system maintains an equal proportion of 'buy' and 'sell' ratings for its entire universe of more than 4000 stocks at any point in time. Irrespective of market conditions, only the top 5% of the Zacks-covered stocks get a 'Strong Buy' rating and the next 15% get a 'Buy' rating. So, the placement of a stock in the top 20% of the Zacks-covered stocks indicates its superior earnings estimate revision feature, making it a solid candidate for producing market-beating returns in the near term. You can learn more about the Zacks Rank here >>>  The upgrade of Brady to a Zacks Rank #2 positions it in the top 20% of the Zacks-covered stocks in terms of estimate revisions, implying that the stock might move higher in the near term.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Brady Corporation (BRC): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Brady (BRC) could be a solid choice for investors given its recent upgrade to a Zacks Rank #2 (Buy). This upgrade primarily reflects an upward trend in earnings estimates, which is one of the most powerful forces impacting stock prices.",
    "The sole determinant of the Zacks rating is a company's changing earnings picture. The Zacks Consensus Estimate -- the consensus of EPS estimates from the sell-side analysts covering the stock -- for the current and following years is tracked by the system.",
    "The power of a changing earnings picture in determining near-term stock price movements makes the Zacks rating system highly useful for individual investors, since it can be difficult to make decisions based on rating upgrades by Wall Street analysts. These are mostly driven by subjective factors that are hard to see and measure in real time.",
    "Therefore, the Zacks rating upgrade for Brady basically reflects positivity about its earnings outlook that could translate into buying pressure and an increase in its stock price.",
    " Most Powerful Force Impacting Stock Prices ",
    "The change in a company's future earnings potential, as reflected in earnings estimate revisions, and the near-term price movement of its stock are proven to be strongly correlated. The influence of institutional investors has a partial contribution to this relationship, as these big professionals use earnings and earnings estimates to calculate the fair value of a company's shares. An increase or decrease in earnings estimates in their valuation models simply results in higher or lower fair value for a stock, and institutional investors typically buy or sell it. Their transaction of large amounts of shares then leads to price movement for the stock.",
    "For Brady, rising earnings estimates and the consequent rating upgrade fundamentally mean an improvement in the company's underlying business. And investors' appreciation of this improving business trend should push the stock higher.",
    " Harnessing the Power of Earnings Estimate   Revisions ",
    "As empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock movements, tracking such revisions for making an investment decision could be truly rewarding. Here is where the tried-and-tested Zacks Rank stock-rating system plays an important role, as it effectively harnesses the power o f earnings  estimate revisions.",
    "The Zacks Rank stock-rating system, which uses four factors related to earnings estimates to classify stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), has an impressive externally-audited track record, with Zacks Rank #1 stocks generating an average annual return of +25% since 1988. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here >>>>  .",
    " Earnings Estimate Revisions for Brady ",
    "For the fiscal year ending July 2020, this identification and security products maker is expected to earn $2.57 per share, which is a change of 4.5% from the year-ago reported number.",
    "Analysts have been steadily raising their estimates for Brady. Over the past three months, the Zacks Consensus Estimate for the company has increased 3.1%.",
    " Bottom Line ",
    "Unlike the overly optimistic Wall Street analysts whose rating systems tend to be weighted toward favorable recommendations, the Zacks rating system maintains an equal proportion of 'buy' and 'sell' ratings for its entire universe of more than 4000 stocks at any point in time. Irrespective of market conditions, only the top 5% of the Zacks-covered stocks get a 'Strong Buy' rating and the next 15% get a 'Buy' rating. So, the placement of a stock in the top 20% of the Zacks-covered stocks indicates its superior earnings estimate revision feature, making it a solid candidate for producing market-beating returns in the near term.",
    "You can learn more about the Zacks Rank here >>> ",
    "The upgrade of Brady to a Zacks Rank #2 positions it in the top 20% of the Zacks-covered stocks in terms of estimate revisions, implying that the stock might move higher in the near term.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:00:07"
}