{
  "url": "https://www.nasdaq.com/article/saudi-stock-index-slips-to-8month-low-amid-slowing-economy-20190911-00530",
  "title": "Saudi stock index slips to 8-month low amid slowing economy - Nasdaq.com",
  "text": [
    "By Maqsood Alam",
    "Sept 11 (Reuters) - Saudi Arabia's stock market fell to an eight-month low on Wednesday as a slowing economy prompted investors to pull most shares down from lofty valuations.",
    "The Saudi index  closed 1.4% down with 163 of its stocks falling and 19 rising.",
    "The index fell as much as 2.5% during the session, wiping out all its gains this year before clawing back some losses to close just 0.4% up year-to-date.",
    "The market had jumped as much as 20% between January and May, led by foreign investors who have been net buyers every month this year as Saudi stocks joined the MSCI and FTSE Russell emerging market indexes.",
    "The move onto the indexes caused the stocks to become over-valued, with the kingdom's slowing economy teetering on the brink of contraction ",
    "\"Saudi Tadawul has lost more than 15% since May,\" said Vrajesh Bhandari, Senior Portfolio Manager at Al Mal Capital. \"Valuations were expensive and fundamentals have caught up now. However, even with this we do not see value in large caps and therefore expect more downside.\"",
    "\"Investors need to be selective and we find interesting ideas within the midcap space,\" added Bhandari. \"One area to have a close eye on is Government project spending on infrastructure and how much that translates into loan growth for banks.\"",
    "Dubai's index  was down 0.3% with Dubai's largest listed developer Emaar Properties  dropping 0.8%.",
    "Qatar's index  rose 0.9% extending its gains for the fourth day, in a boost led by financial shares with Gulf's biggest lender Qatar National Bank  advancing 1%.",
    "In Abu Dhabi, the index  was up 0.2% lifted by 0.4% gain in market heavy-weight First Abu Dhabi Bank .",
    "Egypt's index  closed 0.4% higher. Eastern Co  gained 3.6% after the cigarette maker's board proposed an annual dividend of one Egyptian pound per share.",
    "The market also received support from a decline in the country's annual urban consumer-price inflation rate to 7.5% in August, the lowest rate in years. The fall cleared the way for further rate cuts by the central bank, which delivered a rate cut in August."
  ],
  "published_datetime": "2019-09-11 10:15:00"
}