{
  "url": "https://www.nasdaq.com/article/american-eagle-outfitters-inc-aeo-q2-2019-earnings-call-transcript-cm1207478",
  "title": "American Eagle Outfitters Inc (AEO) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   American Eagle Outfitters Inc    (NYSE: AEO)        Q2 2019 Earnings Call       Sep 4, 2019 ,   9:00 a.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Greetings and welcome to the American Eagle Outfitters' Second   Quarter 2019 Earnings Conference Call. [Operator   Instructions] I would now like to turn the conference over to your host, Ms.   Judy Meehan. Thank you. You may begin.  Judy Meehan    --   Vice President of Investor Relations  Good morning, everyone. Joining me today for our prepared   remarks are Jay Schottenstein, Chief Executive Officer; Chad   Kessler, AE Global Brand President; Jen Foyle, Aerie Global Brand   President; and Bob Madore, Chief Financial Officer. Before we begin today's call, I need to remind you that we   will make certain forward-looking statements. These statements   are based upon information that represents the Company's current   expectations or beliefs. The results actually realized may differ   materially based on risk factors included in our SEC filings. The   Company undertakes no obligation to publicly update or revise any   forward-looking statements, whether as a result of new   information, future events or otherwise, except as required by   law. Also, please note that during this call and in the   accompanying press release, certain financial metrics are   presented on both a GAAP and non-GAAP adjusted basis.   Reconciliations of adjusted results to the GAAP results are   available in the tables attached to the earnings release, which   is posted on our corporate website at aeoinc.com [Phonetic] in   the Investor Relations section. Here you can also find the second   quarter investor presentation. And now I'd like to turn the call over to Jay.  Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer  Thanks, Judy, and good morning everyone. The second quarter   marked our 18th consecutive quarter of positive comps, which show   remarkable consistency in a difficult environment. While we did   face some challenges in the quarter that impacted our AE Brand,   the issues were largely concentrated in certain warm weather   apparel categories which were affected by unseasonable weather.   With the start of August, business has picked up and we're   pleased with positive trends quarter-to-date. Based on these   positive trends and strength in fall category, I'm optimistic   about our prospects for the second half of the year. Despite some of the challenges in the second quarter, we had a   number of wins and accomplishment, specifically. American Eagle   Jeans continue to post record sales, marking sixth consecutive   years of all time highs in each and every quarter. This period we   recorded strong double-digit growth across genders, capturing   market share and further strengthening our number one market   position. Aerie maintain incredible momentum, achieving a 16% comp   increase, its 19th consecutive quarter of double-digit sales   increases. Aerie's consistent industry leading growth continues   to demonstrate the power of this emerging brand and the   significant opportunity ahead of us. Clearly we offer our   customers industry leading product innovations that best fits   quality and value, wrapped in emotional brand experiences. Our digital business was also a highlight producing growth in   the double-digits. Across channel and brands, we saw positive   traffic, and stores outpaced the mall, a clear indication of   strong brand equity. We ended the quarter with over $300 million   in cash and no debt after returning $83 million to shareholders   through dividends and share repurchases. We continue to make key   investments across our business and brands, deliver the best   products and customer experiences, and importantly, we invest in   our people to ensure we have the best talent and culture to drive   future success. As I said last quarter, we are better positioned than ever to   capitalize on the continued disruption across the retail   industry. That view has not changed. Our brand keeps getting   stronger and we intend to continue to capture market share and   grow our merchandise assortments, our customer base and our   profitability. Our strength lies in our culture, our people, and   a strong purpose as an organization to show the world that there   is real power in the optimism of youth. I'm optimistic that we   will post another strong year for all of our stakeholders. And now I turn the call to Chad.  Chad Kessler    --   Executive Vice President and Global Brand President-AE  Thanks, Jay, and good morning everyone. I was not satisfied   with our second quarter results. Comp sales declined 1% against   the strong 7% increase last year, which was the most difficult   comparison of the year. A cool May hurt demand for warm weather   apparel. Shorts missed our expectations and our product mix in   women's top skewed to lower AUR style. It was the trend -- it was   the right trend and unit demand was strong as the AUR pressure   caused comps to decline. These issues are largely behind us and   we are very encouraged by meaningful improvement in our business   in August and early September. We are seeing consistently   positive comps quarter-to-date, led by strength in jeans and fall   apparel, which become increasingly important as we go forward. In   addition, despite the headwinds, there are plenty of bright spots   in the second quarter. First, we continue to consolidate our leadership in jeans   where we are the undisputed destination for customers. The second   quarter represented our 24th consecutive quarter of record sales   and we delivered strong double-digit growth in both our men's and   women's assortment. We are proud to remain the Number 1 women's   jeans brand in America, Number 1 men's jeans brand in our core 15   year to 25 year old age group and the Number 2 jeans brand   overall. We are committed to extending our leadership and   expanding share through continued innovation and an emphasis on   inclusivity. With that in mind, we are very pleased with the response to   the new women's Curvy collection, which has shown to be   incremental. Together with the extended size ranges in both men's   and women's, we are thrilled to welcome new customers to our   brand. As awareness to new styles and expanded sizes grow, we   expect new customers to build the time. This will help sustain   our strong growth in jeans and extend our leadership position in   this important category. With peak back-to-school now behind us,   we are confident we will deliver another record season. There were other highlights in the quarter. In addition to   record sales in dresses and skirts, I'd like to call out   accessories, which was a standout this quarter. The team has been   working hard to strengthen our accessories program and we're   pleased to see those improvements paying off. Powerful new trends   combined with our renewed focus on this category to yield very   positive performance in the near and longer term. The AE brand is very healthy and coveted by today's consumers.   Our AE and me campaigns and brand positions of inclusivity,   individuality and self-expression strongly resonate in today's   youth market. Both in-stores and online, traffic was once again   positive, and we are retaining customers at a higher rate with   our best customers spending more and engaging more frequently   with our brand. Expanding our customer base through our loyalty   programs, social media outreach and the personal connections at   the store level will continue to fuel the brand's strength. Looking ahead, I'm confident in our plans for the back half of   the year and encouraged by the start of the third quarter. We see   a healthy consumer and powerful fashion trends that are perfect   for our brand. American Eagle is stronger than ever and poised to   continue winning in the disrupted retail environment. Now I'd turn the call over to Jen.  Jennifer Foyle    --   Executive Vice President and Global Brand   President-Aerie  Thanks, Chad, and good morning everyone. I'm thrilled to   report that Aerie delivered a spectacular quarter. The revenue   increased more than 20%, fueled by a comparable sales increase of   16% in new [Phonetic] stores. Sales growth built on a 27% comp   increase last year. This period marked our 19th consecutive   quarter of double-digit sales increases. I'm extremely proud of   the consistency we continue to see across the business as we   capture meaningful market share. Sales metrics reflected a   healthy growing brand. Traffic was positive across all channels,   with stores well outpacing mall averages as we continue to   attract more customers to Aerie. Our basket size is also   expanding at a very healthy clip, driven by increased units per   transaction and strong AURs. In the second quarter, all   categories posted sales growth. Bras were one of the strongest   areas in the quarter. We saw healthy demand for core bras and   renewed excitement for bralette, one of Aries signature   categories. Once more, we are thrilled by the very positive response to   our new apparel collections. Our bottoms business remains robust,   and due to strong demand, we were chasing tops throughout much of   the quarter. Brand awareness continues to grow. Aerie's Brand   body -- body positivity platform and empowerment is our strength   and underpins the encouraging emotional connection with our   customers. The power of self-love and acceptance builds trust and   loyalty, and that is truly with the AerieREAL movement is all   about. As a result, our customer file continues to expand.   Retention rates are growing, with existing customers shopping   more frequently and buying more categories from Aerie. Our store expansion plans are tracking well. We opened 20   stores in the quarter with an emphasis on new and filling   markets, including openings in Texas and California, which are   priority states for us. As we enter new markets, we are seeing an   uplift in our digital business in those markets as well. I'm also   very pleased with the performance of remodeled stores in our   latest design. In fact, 10 of our remodeled locations and several   new stores quickly rose to be among our top 25 most productive   locations. This validates our real estate strategy and the power   of Aerie. We still have meaningful locations and opportunity to expand   our footprint in the coming years with a sizable retail presence   of 10,000 square feet in only 23 states. I'm so very thankful for   my amazing team, who continue to deliver exception results across   the Board, from outstanding collections, to our uniquely   innovative marketing campaigns, to new store openings, this team   is firing on all cylinders. Our back-to-school season has been a terrific success. I'm   very encouraged by sales trends in key seasonal apparel   categories, as well as strength in intimates. I'm confident that   we will continue our strong momentum into the second half of the   year. Beyond that, we have visibility to exceeding $1 billion in   short order and see great potential for Aerie over the longer   term. And now I'll turn the call over to Bob.  Robert L. Madore    --   Executive Vice President and Chief Financial Officer  Thanks, Jim, and good morning everyone. My comments were   focused on the adjusted second quarter financials, which excludes   certain items as detailed in the press release and tables in the   investor presentation. As indicated, second quarter operating   results fell short of our expectations. By many accounts, the   environment was challenging. And as we indicated back in early   June, May was unreasonably cool, suppressing demand for warm   weather apparel. This continued with the later start to   back-to-school adversely impacting second quarter sales and   margins. However, there were a number of areas that we performed   very well and we were pleased to post increases in consolidated   comp and revenue, marking 18 consecutive quarters of comp growth   in record revenues. We are also encouraged by a meaningful   improvement in business trends so far this quarter. Turning now to the second quarter financial results. Total net   revenue increased $76 million, rising 8% to $1 billion. Total   revenue includes $40 million recognized for license royalties   from a third-party operator in Japan. This payment was the   primary driver of margin improvement and generated $0.15 in   earnings per share. We plan to terminate the agreement with our   partner and are currently exploring options for our future   business model to continue our growth in Japan. Consolidated   comparable sales increased 2%, building on 9% growth last   year. By brand, American Eagle comps declined 1% in the second   quarter, following a 7% increase last year. Aerie comps increased   16%, building on 27% growth last year. We saw positive digital   comps for American Eagle, which was offset by decline in stores.   Aerie grew across both channels in the quarter. On a consolidated basis, stores decreased 1%. Digital sales   rose in the low-double digits, reaching approximately 25% of   total revenue, up 100 basis points to last year. We saw the   biggest increases coming from our app and mobile channels which   contributed -- which combined now represent well over half our   digital business. Total gross profit increased $29 million or 8% to $383   million. Gross margin rate to revenue increased 10 basis points   to 36.7%. The increase was due to strong flow through from the   Japanese licensed royalties, which contributed approximately 230   basis points of margin improvement. This was largely offset by   increased markdowns, higher delivery expense and compensation   costs. Selling, general and administrative expense of $253 million   increased 8% and was flat as a percent of revenues at 24.3%.   Compensation was the largest contributor to the dollar increase,   primarily reflecting the continued impact from our investments in   customer facing, store payroll and wages, which began in   mid-2018. Higher professional fees also contributed to the   increase. Absent some expenses associated with the license   royalty revenue received, SG&A dollar growth was consistent   with our expectation of a mid-single digit increase. Depreciation   and amortization rose $2 million to 45 million or 4.3% as a rate   to revenue, which was down 10 basis points compared to last year.   Adjusted operating income increased 11% to $85 million from $76   million last year and the margin rate to revenue improved 20   basis points to 8.1%. Operating income includes approximately $34   million from the Japan license royalty. The effective tax rate of approximately 24% compared to   approximately 22% last year. Adjusted EPS of $0.39 increased 15%   from $0.34 last year, included in adjusted EPS was $0.15 from the   license royalty received. Adjusted earnings in the second   quarter, also excluded restructuring charges, of $2.7 million or   approximately $0.01 per share. Now regarding inventory, which can be found on page 11 of the   investor presentation. We ended the quarter with inventory at   cost of $535 million, up $69 million or 15% from last year. Units   were up 10% versus the year ago period. The increase largely   reflects inventory to support strong demand for AE Jeans,   including new styles and expanded sizes. These are incremental   product lines to last year. Additionally, new Aerie stores and   improved in-stocks for our wholly owned international businesses   also contributed to the increase. These factors represented over   half of the inventory increase to last year. Overall, we feel   good about the composition of inventory. Capital expenditures totaled $55 million in the second   quarter, and we continue to expect capex to be in the range of   $200 million to $215 million for the year. During the quarter, we   completed $60 million in share repurchases and paid $23 million   in dividends to shareholders. In July, our Board of Directors authorized an additional 30   million shares for repurchase, and we exit the quarter with a   little over 37 million shares available for purchase. Our   liquidity position remain strong and we ended the quarter with   total cash and investments of $317 million and no debt   outstanding. Now turning to our real estate portfolio. Our 2019 priorities   are to accelerate the growth of Aerie, to reposition and remodel   80 stores and to continue expanding our global footprint. Based   on the openings to-date and our plans for the balance of the   year, we now expect every store openings this this year near the   lower end of our prior 60 to 75 target. Importantly, this is   simply a function of timing. Our long-term footprint, expansion   plans and growth expectations for this business are unchanged.   Overall, stores remain a very important part of how we operate   our business and engage with our customers. We have a highly   profitable store portfolio and significant lease flexibility.   Additional store information can be found on pages 14 through 18   in the investor presentation. I would now like to provide an update on the impact of   tariffs. As discussed in the past, we have actively collaborated   with our sourcing partners to meaningfully mitigate the potential   impact. In addition, we continue to make progress in further   reducing our exposure to China tariffs through a combination of   partnering with vendors and diversifying our geographic   production capabilities. Based on recently enforced tariffs List   4, we do not expect a material impact this year. At present, we   expect the impact to be manageable in 2020. Now looking ahead, we expect third quarter EPS in the range of   $0.47 to $0.49 per share. Consistent with improving sales trends,   we expect comparable sales growth in the low to mid-single   digits. This outlook assumes continued promotional activity.   S&GA expense is expected to increase in the mid-single   digits. Our third quarter guidance compares to EPS of $0.48 last   year and excludes potential impairment and restructuring   charges. To conclude, we're very pleased with quarter-to-date trends.   As Chad and Jen discussed, our fall product is performing across   both brands and we have a clear path for the rest of the year. We   remain focused on our strategic initiatives that will enable us   to maintain our comparable sales momentum, strengthen our bottom   line and generate financial returns to our shareholders. Thanks. And now we'd like to take your questions. Questions and Answers:  Operator  Thank you. [Operator Instructions] Our first question comes   from the line of Jay Sole with UBS. Please proceed with your   question.  Jay Sole    --   UBS -- Analyst  Great. Thank you so much. Jen, my question is about Aerie,   you're going up against a tougher comp in 3Q. On a two-year   basis, the comp looked like it slowed a bit from 1Q to 2Q. Do you   feel confident that you can deliver within the guidance? Do you   feel confident to deliver a comp at least in line with where you   were in 2Q or better as you look at the 3Q?  Jennifer Foyle    --   Executive Vice President and Global Brand   President-Aerie  Absolutely. If I mentioned -- well, I did mention that our   apparel business has been very strong as we get into the back   half. We own more apparel, because it's seasonally appropriate.   However, so we feel really confident about what's happening in   apparel and what happened in August. Our comps were very strong   and laid up against some very, very strong comps. So that said,   also, we continue to own and dominate bras and undies. Bras had   an extremely great month in August and we're looking forward to   chasing more bralettes actually, they've been on fire for us.  Jay Sole    --   UBS -- Analyst  Great. And then, Bob, if I can just ask you about the Japan   license royalty. Can you just clarify, how is the Japan business   was accounted for in this quarters? Was this 40 million a   one-time issue, a one-time payment or was there a similar amount   last year? If you could just clarify that for us, it'd be super   helpful.  Robert L. Madore    --   Executive Vice President and Chief Financial Officer  It's a one-time payment that was triggered by a breach by our   licensed partner, which put into motion minimum royalties from   prior years that became due as a result of that breach. So it   actually was the result of events and circumstances that   transpired directly in the quarter and was related to higher   royalty rates that were triggered as a result of that.  Jay Sole    --   UBS -- Analyst  Got it. Okay. Thank you so much.  Operator  Thank you. Our next question comes from the line of Paul   Lejuez with Citigroup. Please proceed with your question.  Paul Lejuez    --   Citigroup -- Analyst  Hey, thanks guys. Just to follow-up on the Japan payment. Was   that already received or was that simply an accrual? Also curious   why you didn't break it up, Bob?  Robert L. Madore    --   Executive Vice President and Chief Financial Officer  Paul, it was received -- Paul, it was received and there is   coming in the quarter.  Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer  So $40 million is the total amount of royalties earned. $30   million was paid, there's a $10 million receivable that's due in   a couple of months.  Paul Lejuez    --   Citigroup -- Analyst  Got you. Okay. And then, can you just maybe provide a little   bit more color on quarter-to-date trends that you're seeing by   brand and what gives you confidence to include that mid-single   digit as part of the comp guidance for 3Q? Thanks.  Jennifer Foyle    --   Executive Vice President and Global Brand   President-Aerie  For Aerie, we're just -- we're seeing strong business in   apparel as I mentioned. Honestly, all categories are doing great.   We're really pleased with the August results. I just mentioned   bralettes are doing really well for us, the bra category, the   core bra category. You know, we're really, as I said in my   script, we're really firing in all cylinders here. The team's   doing a great job executing.  Robert L. Madore    --   Executive Vice President and Chief Financial Officer  I would tell you with August representing our single largest   month within the quarter from both the sales and a profit --   operating profit perspective. we've got that behind us now. We're   very happy with how back-to-school finished off as we pointed   out. Although we got off to a slow start in the last two weeks of   July, we finished back-to-school really strong in August. So   we've got our biggest month completed and that gives us a lot of   confidence in support of our guidance that we gave for the   quarter.  Chad Kessler    --   Executive Vice President and Global Brand President-AE  Yeah, I think what we were seeing in AE a lot of the   challenges in the second quarter were really related to seasonal   product as I mentioned. Shorts with a slow start with a cool   weather, and unit demand was great, and women's knits, we had a   lower AUR. As we go -- run through back-to-school and shift to   long bottom, and the strength of our Jeans business that's been   really powerful with our new launches have all exceeded   expectations. And then as we get into the warmer weather product   that we've already started to set through August, early demand   has been really great and broad based across a lot of category.   So I expect the third quarter and -- even the fourth quarter, the   whole fall should have a better trend than what we saw in the   second quarter.  Paul Lejuez    --   Citigroup -- Analyst  Has there been promotionally driven or are you happy with the   margins?  Chad Kessler    --   Executive Vice President and Global Brand President-AE  Promotions were consistent year-over-year. As the bottoms   business grows, that does carry -- jeans are slightly lower   margin rate than the tops business. But as we have talked, it's   back on track. We'll hopefully see margins improving with that as   well.  Operator  Thank you. Our next question comes from the line of Oliver   Chen with Cowen & Company. Please proceed with your   question.  Oliver Chen    --   Cowen & Company -- Analyst  Hi. Thank you. Bob, in one of your comments you mentioned that   you -- the outlook assumes continued promotional activity. What   does that mean in terms of how you're seeing merchandise margins   evolve? And it sounds like your inventory position right now is   very clean. I would love your thoughts there. And then the   innovation that you've done with Style Drop in the subscription   model, Chad, what are your thoughts on managing incrementality   and what this means for customer engagement and why now?  Robert L. Madore    --   Executive Vice President and Chief Financial Officer  Yes. So, you know, our guidance does contemplate slight   deleveraging of our gross margin rate, not to the magnitude that   we've seen in Q2 results, it will be muted relative to that as we   clear through some of the seasonal inventory that we carried in   from the end of the second quarter. Now having said that, Oliver,   we are really happy with the currency, the inventory, not only   our incremental investments supported by businesses that are   really performing well, and huge large growth vehicles for us,   but our carryover inventory from summer spring is less than 2% of   our whole total on hand, which is extremely manageable, but it   will have a slight impact on margin rate.  Chad Kessler    --   Executive Vice President and Global Brand President-AE  And then as for Style Drop, we're basically six months into   it, and it's been really interesting to watch. I think the main   question, Oliver, is going to be the incrementality as you said.   What's the incrementality of it? Right now, we're seeing a lot of   our most engaged customers participating in the Style Drop rather   than at attracting new customers per se. We're seeing a higher   percentage of already engaged customers in the program. So we   just need to see if that means they're spending more in total   with the brand and if we're getting margin flow through from what   they're spending both in stores as well as renting. So that's why   we kicked off as a test and we are watching it. I do think these   sort of new forms of retail and new forms of customer purchasing   are really interesting. We have to make sure that they come with   the sales and the margin that we expect in our business.  Oliver Chen    --   Cowen & Company -- Analyst  Thank you. Best regards.  Judy Meehan    --   Vice President of Investor Relations  Thank you.  Operator  Thank you. Our next question comes from line of Tiffany Kanaga   with Deutsche Bank. Please proceed with your question.  Tiffany Kanaga    --   Deutsche Bank -- Analyst  Hi. Thanks for taking our questions. With your AUR   decelerating further in the second quarter, with a lot of new   innovation introduced for back-to-school, do you believe you can   lift that metric back to positive territory during the back half   of the year against the easier compares or should promotional   activity keep it down year-over-year? And would you also break   down your AUR in the quarter by brand since I thought I heard Jen   mentioned strong AUR on the Aerie side? Thanks.  Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer  We're already -- Tiffany, we're already seeing AURs positive   to the last year with the strength of the fall product in AE, as   well as the Jeans business continuing to grow and we're   definitely getting paid for the innovation we're delivering in   [Indecipherable]. As I mentioned, a lot of it -- AUR challenge in   Q2 came from a lower AUR trend in the women's knits category that   in the first quarter we were able to overcome the low AUR with   positive comps. And in the second quarter, we weren't able to   overcome that lower AUR. But it was really -- the AUR in the   second quarter for AE is really driven by product mix impacting   -- ended up impacting top line. And as I said, so far in the   third quarter, our AURs are back to positive and we definitely   make sure that the innovation we put into our product is   recognizable -- is recognizable for the customer and we're   getting paid for the innovation we have.  Robert L. Madore    --   Executive Vice President and Chief Financial Officer  And Aerie is definitely getting paid for their innovation and   product category expansion. They saw AUR increase in the   mid-single digits in the second quarter.  Tiffany Kanaga    --   Deutsche Bank -- Analyst  Thank you so much.  Operator  Thank you. Our next question comes from line of Dana Telsey   with Telsey Advisory Group. Please proceed with your   question.  Dana Telsey    --   Telsey Advisory Group -- Analyst  Good morning. As you think about the tops category, what needs   to change in order to deliver the positive results that you're   looking for? And lastly, as you think about your store base, both   full-line and outlet stores. How are you seeing the profitability   in each store format and where do you see openings and closings   stand at reach? Thank you.  Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer  Yeah, so, you know, what we're seeing in tops, as I mentioned   was really the bare knits carrying a lower AUR and being a high   percentage of the business in the second quarter. What we need to   see change in Q3, I think, we've already seen change as a   seasonal categories come in with fleece, sweaters, outerwear plus   knits, really across the board in tops. We're seeing return to   strong sales in seasonal categories that carry a higher AUR. And   those businesses are all really healthy. So I think we're going   to see that continue through the rest of the third quarter and   into the fall as temperatures drop and as the assortment mixes   even more into those categories. In terms of stores, we are -- we see healthy profitability in   both mainline and outlet stores. You know, there's only a handful   of our stores that are not profitable. And so, but we look at as   we renew leases. We're looking at active returns in all of the   stores, not really factory or mainline specific, but really store   by store.  Robert L. Madore    --   Executive Vice President and Chief Financial Officer  And, you know, it's been a pretty consistent answer. I'll just   add a little more color to that. Over 95% of our fleet is   profitable. That 5% that isn't are either new stores that haven't   hit their sales productivity, maturity levels or the flagship in   nature that have other purposes other than just four-wall   profitability. But we have an extremely strong and profitable   real estate portfolio. And to give you an example, the   flexibility we have in that, we've got out of our 1,075 stores,   600 of them are coming up for lease decision over the course of   the next three years at a rate on average of about 200 locations   a year. We're constantly looking at those renewals, whether the   stores meet our strategic objectives, profit objectives, etc. So   we continue to feel really good about our our store fleet and the   performance across the fleet.  Dana Telsey    --   Telsey Advisory Group -- Analyst  Thank you.  Robert L. Madore    --   Executive Vice President and Chief Financial Officer  And I'm sorry -- your one of the question was store openings   and closings. We're going to open a little over 66 stores, add to   that number about another 29 for Aerie side by side store. So   we're going to have 95 additional new stores that we will be   opening in the course of the year and we'll be closing around 12   stores with the majority of those being AE stores throughout the   course of the year.  Dana Telsey    --   Telsey Advisory Group -- Analyst  Thank you.  Operator  Thank you. Our next question comes from the line of Janine   Stichter with Jefferies. Please proceed with your question.  Janine Stichter    --   Jefferies -- Analyst  Hi, good morning. Two questions for Jen on Aerie. First, just   in the bralette commentary. Curious to hear your thoughts on   what's behind the resurgence there, and if you're seeing the   bralette purchase is more of an incremental purchase that she is   using as a fashion item or is there some trade-off between bras   and bralettes? And then you mentioned strong AUR there for Aerie.   I'm wondering if you could just comment on what you're seeing in   terms of promotional activity in this space and we've seen some   competitors be very promotional. And just your thoughts on any   impact that might be having to your pricing strategy? Thank   you.  Jennifer Foyle    --   Executive Vice President and Global Brand   President-Aerie  Well, let's you know, I always say that we really have always   had a strong business in bralettes. Certainly was -- it really   peaked as a trend a couple of years ago, few years ago, in fact.   But we stayed with it, and it's our business and we own it. So we   feel proud of what we've done there and it hasn't really eaten   into our core bras. In fact, we've been very disciplined in bras.   We have extended sizes as Chad has in denim, but also really   focusing on the bra silhouettes that she's demanding from us and   not being over sorted. So that's really what's going on in the   bra business. Yeah, it has been promotional out there. But we   keep on mixing our AURs up. So, you know, we're able to ride that   wave.  Robert L. Madore    --   Executive Vice President and Chief Financial Officer  Just to put overall margin deleverage in a perspective, total   company gross margin was down 220 basis points versus last year   in the quarter. Aerie's gross margin rate was pretty much flat.   They had a very strong quarter in spite of what was an extremely   promotional environment, particularly going head to head with   some of her competitors, which she didn't have to do.  Janine Stichter    --   Jefferies -- Analyst  Really helpful color. Thank you -- thank you very much.  Jennifer Foyle    --   Executive Vice President and Global Brand   President-Aerie  Thank you.  Operator  Thank you. Our next question comes from the line of Marni   Shapiro with The Retail Tracker. Please proceed with your   question.  Marni Shapiro    --   The Retail Tracker -- Analyst  Hey, guys. I think the Curvy line looks great. So I have two   quick questions. Chad, if you could just touch a little bit on AE   Studio, trying to understand how that fits into the big scope of   the American Eagle brand. And then, Jay, if you could touch a   little bit on the partnership with Seventh Sense. I guess, when   are you expected to launch this in stores? And do you view this   as a new customer coming into American Eagle? You've been with   the brand for a very long time. You know the customer intimately.   So I'm curious what your thoughts are on that launch?  Chad Kessler    --   Executive Vice President and Global Brand President-AE  Hi, Marti, in terms of AE Studio, we saw great results. We   Don't Ask Why as a way that we could learn about test and learn   quickly about new and exciting trends. When we evolve, Don't Ask   Why or I guess I'd replaced Don't Ask Why with AE Studio. So AE   Studio is a series of monthly trend capsules that we're doing in   a very fast lead time to try to learn about new product, new   styling and trying to create more editorial fashion message for   our customer and we're seeing great response to it and learning a   lot. So Don't Ask Why was really had a very specific point of   view in terms of selling and AE Studio is -- the goal is for it   to look different every month, and it's been a great learning   experience and we will use it like we use Don't Ask Why to test   and react in the business.  Marni Shapiro    --   The Retail Tracker -- Analyst  It meant to look very different than American Eagle core tops   business or is it meant to sort of blend in with the   assortment?  Chad Kessler    --   Executive Vice President and Global Brand President-AE  I think it depends month to month. It's really -- I think   there will be things that we are looking to learn about, but it's   also a lot of it, how we style the clothes, right. Like trying to   show maybe outfits in a different way and trying to communicate   to the customer that you can get a different look than maybe she   expects at American Eagle.  Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer  And on the issue of the Seventh Sense, we're going to be --   we're going to be issuing this coming fall and we have a special   name for it. We have a special kick-off and we're gonna surprise   everybody. So we're not going to tell you now. It will be very   exciting. We think we've done some customer research. It's been   very positive. We think there's a big opportunity -- big   opportunity for us as to get to get into the beauty business.  Marni Shapiro    --   The Retail Tracker -- Analyst  So, Jay, this will be in for the holiday season then?  Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer  Yes, it will be.  Marni Shapiro    --   The Retail Tracker -- Analyst  Fantastic. Thanks, guys.  Robert L. Madore    --   Executive Vice President and Chief Financial Officer  Thanks, Marni.  Operator  Thank you. Our next question comes from the line of Kimberly   Greenberger with Morgan Stanley. Please proceed with your   question.  Kimberly Greenberger    --   Morgan Stanley -- Analyst  Thank you so much. I was wondering if you could look back to   last year and let us know if you've got a similarly -- a similar   comparison in October. Does it get slightly more difficult as you   get into October? And then, I wanted to just ask about the   investments in store wages. Now that you've lapped the increases   in store wages, would you expect that that would represent less   of a pressure point in SG&A moving forward? Thank you so   much.  Robert L. Madore    --   Executive Vice President and Chief Financial Officer  Yeah, the last question Kimberly that you ask around store   payroll, as we pointed out, we started the incremental   investments and store payroll, kind of, mid second quarter of   last year. So we've pretty much left that at this point. And you   should not expect to see that level of incremental investment   going forward. If we're able to hit our revenue guidance as we've   communicated to you, which we feel very strong, that we can we   believe we still have the ability in the third quarter to   slightly leverage SG&A rate in addition to Q4 too. So still   represents part of our strategy and the narrative going forward   for sure. And as far as looking forward to October and the third   quarter, as I said, we're coming up against some good comp   performance, but I think our revenue guidance of low-single   digits to mid-single digits again represent -- reflects August in   the bank, which is almost 50% of our sales in the quarter -- in   much more of our profits in the quarter, roughly 80% of our   profits in the quarter. So feel really good about the guidance   that we gave and our ability to hit it.  Kimberly Greenberger    --   Morgan Stanley -- Analyst  Thank you, Bob.  Operator  Thank you. Our next question comes from line of Janet   Kloppenburg with JJK Research. Please proceed with your   question.  Janet Kloppenburg    --   JJK Research -- Analyst  Good morning everyone. Quick question for Chad and for Jay.   Chad, I know your denim business has been consistently strong for   a long time now. And I'm just wondering if that chunk of the   business is becoming outsized and if there's any worry about, you   know, a jeans slowdown and some sort of change in the bottom   cycle and what that might mean to American Eagle's growth   outlook? And for Jay it's interesting you just talked about beauty. I   was wondering if you could give us a look forward to the kinds of   growth strategies you are thinking about, whether they would be   internally developed or if you're also considering M&A   opportunities? Thank you so much.  Chad Kessler    --   Executive Vice President and Global Brand President-AE  Hi Janet. Thanks. The Jeans business is amazing and continues   to grow, and as I just said, at this point I'm quite confident   we're going to have another record quarter in jeans. We find   there's even more demand than what we offer today for the   customer. We continue to see the opportunity to expand   productivity throughout the assortment with more jeans. Now, I   think that could lead to some concerns that you're saying that   jeans can get too big, but four or five years ago, when everyone   said jeans were dead, we were writing record in Jeans business   and we continue to do so. I think for us, we are the destination   for jeans and I think jeans are going to outlive everybody in   this room and on this call. And so I think what we saw prior is   when people ran away from jeans, we just consolidated our   position as the leader in the space. And I think that that is an   opportunity and a strength for us going forward. We do have a healthy bottoms business overall. So the rest of   the pants business, and even though, I spoke to some weakness in   shorts, we did write positive comps in women's shorts in the   quarter. There is -- we have a very strong bottoms business led   by our jeans, and I think people are going to continue to wear   bottoms as time goes forward.  Janet Kloppenburg    --   JJK Research -- Analyst  Thanks.  Chad Kessler    --   Executive Vice President and Global Brand President-AE  Thanks, Janet.  Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer  And as far as the beauty business, we're just getting our toe   into the water. We're very excited about it. We think it's big   opportunity. Look, we see a lot of opportunity and we're very   gung ho as far as this year and we see a lot of opportunity like   for next year, too.  Operator  Thank you. Our next question comes from line of Susan Anderson   with B. Riley FBR. Please proceed with your question.  Susan Anderson    --   B. Riley FBR -- Analyst  Hi, good morning. Thanks for taking my question. On the China   tariffs, so it sounds like you don't expect a material impact   this year and next year manageable, I guess. Should we assume   that it will not be material next year also? And then also maybe   if you can give us an update on when you expect your exposure to   China sourcing to be next year, and I guess if it did go to 25%,   maybe if you could just talk about, kind of, the plan at that   level in terms of vendor concessions or would there any -- be any   plan in the future to raise prices? Thanks.  Robert L. Madore    --   Executive Vice President and Chief Financial Officer  Well, you know, this China tariff issue, trade war issue has   been going on for a while. And I have to tell you, our team, our   production sourcing team has been out in front of this and has   done a phenomenal job. They've been able to mitigate over   two-thirds of the tariff exposure through the partnerships and   the negotiating skills that they've had with our manufacturing   partners in China and migrating some of our production to other   geographies too. Today, China represents about 30% of our   production. We believe in the next 12 months to 18 months, we'll   be able to drive that down to 20% or below 20%, slightly below   20%. Yeah, this year's impact of terrorists is immaterial. Next   year, it's more material, it's a full year impact. We're only   going to see an impact a little bit in the fourth quarter and but   it's -- it's manageable within our total operating income number   and a lot of the other strategies that we have to drive income   growth.  Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer  [Indecipherable] building your forecast too.  Robert L. Madore    --   Executive Vice President and Chief Financial Officer  It's definitely reflected in the guidance we gave.  Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer  It's already in the guidance, too. And look, the good news is   that with the factories, we are -- we are the vendor of choice,   it is good. So we have the flexibility to move around and we are   moving around the world. And look, hopefully the President makes   a deal with China. There is probably a very good chance of a deal   getting done.  Robert L. Madore    --   Executive Vice President and Chief Financial Officer  And Jay, I haven't really heard any competitors disclosing   that they've been able to mitigate two-thirds of the tariff   exposure items. So I think that's a big plus for us and I think   it just demonstrates.  Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer  Now let's put it this way, we don't plan to use tariffs for   any excuse or anything. We know we have to have merchandise for   competition. At the end of the day, if we have certain misses   last quarter -- last quarter, we think we can improve it next   year. We know where those opportunities lie. We know where it is.   We know where the opportunities are. We know what we have to do   merchandise wise. Actually we're working on it. We don't accept   excuses and we don't like being down. This was the first -- this   was the first quarter miss in a long time, but there's been a lot   of changes made and we feel very good about the future.  Susan Anderson    --   B. Riley FBR -- Analyst  Very helpful. Thank you so much guys.  Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer  Let's put this way, I feel much better about the future than   the analyst will. We're watching the stock go up and down. I got   lot more confidence in the analyst and I'll just put it this way,   shame on all the naysayers.  Operator  Thank you. Our next question comes from the line of Kate   Fitzsimons with RBC Capital Markets. Please proceed with your   question.  Kate Fitzsimons    --   RBC Capital Markets -- Analyst  Yes. Hi, good morning. I guess, piggybacking on that tariff   question, I'm curious kind of what your view is on price   increases to the extent that tariffs go to 25%, you know   definitely impressed that you guys are able to mitigate a lot of   the pressure internally but just curious on your views on   pricing. And then secondly, Chad, you made mention of a fashion   cycle and the changing silhouette, you seem pretty optimistic on   what you're seeing there. What are you seeing on the top to   bottom ratio now? Is that where you want it to be? You know   sounds like it's improving quarter-to-date versus 2Q maybe? Just   how should we think about the opportunity there? Thank you.  Chad Kessler    --   Executive Vice President and Global Brand President-AE  I think for pricing, when we look at the tariff, I think we   just have to be very careful. I think we have to make sure we've   always been a brand that represents value. We've always been a   brand that priced our apparel to where we -- for what we built   into it and what we think the customer will perceive as a fair   ticket. I think if tariffs do go to 25% and we're still making a   percentage of our goods in China, we need to look at some of   those tweener styles where maybe there's an opportunity for a few   dollars here or there, but I think the environment will continue   to be competitive and we will continue to be a leader   representing value in the space. And so I don't think that we can   look at any sort of across the Board increases in ticket, so. But   then again, you know, we have to look at it as the news breaks   and as things come across and use our best judgment at that   time. In terms of women's changing silhouette, we are -- we do   continue to see a shift into high rises and some of the new jean   silhouettes in women's really driving a shift in both the size of   the tops as well as boxier silhouettes or longer silhouettes. And   I think it provides a great opportunity going into fall. As I   said, the back-to-school merchandise was very well received and   the categories that we will drive going forward through the fall   are the categories that drove back-to-school and I think that   provides significant opportunity in women's non-bottoms   apparel. The tops to bottoms ratio, I think, it's a bit of a tough   metric for us to look at other retailers, because of the strength   of our bottoms business. As bottoms continues to grow that means   that they continue to grow and they're part of that ratio, right.   So we continue to see bottoms grow. The goal -- my goal is that   the bottoms growth is incremental to the brand growth and that   the tops business at least hold steady if not growing along with   bottoms. But I don't see that shifting our tops to bottoms ratio   back to tops. But each -- every brand has their strength and our   strength is both our brand as well as our bottoms business and   the apparel that outfits back to those bottoms and we've seen   that drive consistent positive growth. Q2 is a hiccup, but I   think coming into Q3 and going through the fall, we'll continue   to see that drive the business in a positive way.  Kate Fitzsimons    --   RBC Capital Markets -- Analyst  Great guys. Best of luck.  Chad Kessler    --   Executive Vice President and Global Brand President-AE  Thanks.  Operator  Thank you. Our next question comes from line of Westcott   Rochette with Evercore ISI. Please proceed with your   question.  Westcott Rochette    --   Evercore ISI -- Analyst  Thanks, guys. I have a question on the interplay between the   Aerie and the American Eagle customer. And as you grow brand   awareness at Aerie and as you move into apparel, and especially   -- maybe if you go into new markets like Texas and California, do   you see that Aerie customer and the brand awareness translating   over to Eagle, an opportunity to go over to Eagle and how is that   customer kind of interact between the two brands?  Chad Kessler    --   Executive Vice President and Global Brand President-AE  I think we have a really virtuous circle with the customer   base. We have two really strong brands that appeal their   customers from 15 to 25 and maybe even a little higher in Aerie.   And Aerie brings a lot of excitement with AerieREAL campaign and   bringing new customers to the brand that, yes, we actively work   to migrate into the AE business and we still have a lot of AE   customers who only shop in AE and we work to build Aerie brand   awareness and help inspire those customers to shop in the Aerie   business. So I think it's a really positive thing to have these   two brands working together and a positive thing that we share a   website. And we see even with Aerie's apparel business growing,   as Jen and I have said on earlier calls, we try to make sure that   Aerie apparel is more lounge, AE apparel is more jeans based, and   we try to not compete directly with each other and we find that   in total. It lifts the entire business, and that we can use both   brands to attract new customers and then retain those customers   and migrate those customers between the brands. It's really a   positive thing to have, two such strong brands under the same   umbrella.  Judy Meehan    --   Vice President of Investor Relations  Okay. So we'll take one more question.  Operator  Thank you. Our final question comes from line of Rebecca Duval   with BlueFin Research Partners. Please proceed with your   question.  Rebecca Duval    --   BlueFin Research Partners -- Analyst  Good morning, and thank you for taking my question. Chad, I   was just wondering you talked a little bit, you just touched on   it briefly about the extended sizes and that you're starting to   see a new customer base come in, particularly at the AE brand.   I've seen the reaction that you -- actually, with the reviews of   the Curvy, it's pretty incredible online. But I'm wondering how   you guys are measuring that in terms of just new customer   acquisition and what are the plans on extended sizes? Are you   going to continue into tops as well or is it just going to   continue on to denim? And then along those lines, are there   different plans in terms of the marketing that we're going to see   to kind of get that message out there that you are offering the   extended sizes for the back half. Thanks.  Chad Kessler    --   Executive Vice President and Global Brand President-AE  Yeah. So just sort of break into two parts. One, Curvy   represents everything from -- it was really about the silhouette   in the shape and not the size. And so Curvy has been great. When   we look at the Jeans business, it looks like Curvy is really   incremental to the Jeans business, our core Jeans business, we   would also be posting positive comps in the quarter even before   we layer in Curvy. So Curvy has been a great success and we're   very happy with that. We did a lot of specific marketing around   Curvy and getting the reach out to customers, both existing   customers who maybe felt like our jeans didn't provide the   optimal fit as well as to new customers in the brand. The extended sizing is something that I'm really excited we're   able to offer in all stores. The brand is really about   inclusivity. And I think Aerie and Jen really led the way there   and we're happy to build upon it by extending the sizes we have   in our stores. I think that's still a story of attracting a new   customer to the store. We're seeing faster pickup online, but   we're still getting the awareness out to the store customer and   we're seeing it build. We're seeing it build over time, but it's   still early days. They've only been in stores for like five   weeks. But I'm happy that we have it and I'm happy to see it   build and I do think it's an opportunity to grow the customer   base. We do expect to have the larger sizes across all of our   bottoms category. And then in tops, I think we'll see how the   reaction builds in bottoms and then see if we're able to offer it   across tops as well.  Rebecca Duval    --   BlueFin Research Partners -- Analyst  Great. Thanks.  Judy Meehan    --   Vice President of Investor Relations  So that concludes our call today. Thanks for your   participation and have a great day.  Operator  [Operator Closing Remarks].  Duration: 53 minutes  Call participants:  Judy Meehan    --   Vice President of Investor Relations   Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer   Chad Kessler    --   Executive Vice President and Global Brand President-AE   Jennifer Foyle    --   Executive Vice President and Global Brand   President-Aerie   Robert L. Madore    --   Executive Vice President and Chief Financial Officer   Jay Sole    --   UBS -- Analyst   Paul Lejuez    --   Citigroup -- Analyst   Oliver Chen    --   Cowen & Company -- Analyst   Tiffany Kanaga    --   Deutsche Bank -- Analyst   Dana Telsey    --   Telsey Advisory Group -- Analyst   Janine Stichter    --   Jefferies -- Analyst   Marni Shapiro    --   The Retail Tracker -- Analyst   Kimberly Greenberger    --   Morgan Stanley -- Analyst   Janet Kloppenburg    --   JJK Research -- Analyst   Susan Anderson    --   B. Riley FBR -- Analyst   Kate Fitzsimons    --   RBC Capital Markets -- Analyst   Westcott Rochette    --   Evercore ISI -- Analyst   Rebecca Duval    --   BlueFin Research Partners -- Analyst   More AEO analysis   All earnings call transcripts        10 stocks we like better than American Eagle   Outfitters     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and American Eagle   Outfitters wasn't one of them! That's right --   they think these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " American Eagle Outfitters Inc    (NYSE: AEO)        Q2 2019 Earnings Call       Sep 4, 2019 ,   9:00 a.m. ET ",
    " Operator ",
    "Greetings and welcome to the American Eagle Outfitters' Second   Quarter 2019 Earnings Conference Call. [Operator   Instructions]",
    "I would now like to turn the conference over to your host, Ms.   Judy Meehan. Thank you. You may begin.",
    " Judy Meehan    --   Vice President of Investor Relations ",
    "Good morning, everyone. Joining me today for our prepared   remarks are Jay Schottenstein, Chief Executive Officer; Chad   Kessler, AE Global Brand President; Jen Foyle, Aerie Global Brand   President; and Bob Madore, Chief Financial Officer.",
    "Before we begin today's call, I need to remind you that we   will make certain forward-looking statements. These statements   are based upon information that represents the Company's current   expectations or beliefs. The results actually realized may differ   materially based on risk factors included in our SEC filings. The   Company undertakes no obligation to publicly update or revise any   forward-looking statements, whether as a result of new   information, future events or otherwise, except as required by   law.",
    "Also, please note that during this call and in the   accompanying press release, certain financial metrics are   presented on both a GAAP and non-GAAP adjusted basis.   Reconciliations of adjusted results to the GAAP results are   available in the tables attached to the earnings release, which   is posted on our corporate website at aeoinc.com [Phonetic] in   the Investor Relations section. Here you can also find the second   quarter investor presentation.",
    "And now I'd like to turn the call over to Jay.",
    " Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer ",
    "Thanks, Judy, and good morning everyone. The second quarter   marked our 18th consecutive quarter of positive comps, which show   remarkable consistency in a difficult environment. While we did   face some challenges in the quarter that impacted our AE Brand,   the issues were largely concentrated in certain warm weather   apparel categories which were affected by unseasonable weather.   With the start of August, business has picked up and we're   pleased with positive trends quarter-to-date. Based on these   positive trends and strength in fall category, I'm optimistic   about our prospects for the second half of the year.",
    "Despite some of the challenges in the second quarter, we had a   number of wins and accomplishment, specifically. American Eagle   Jeans continue to post record sales, marking sixth consecutive   years of all time highs in each and every quarter. This period we   recorded strong double-digit growth across genders, capturing   market share and further strengthening our number one market   position.",
    "Aerie maintain incredible momentum, achieving a 16% comp   increase, its 19th consecutive quarter of double-digit sales   increases. Aerie's consistent industry leading growth continues   to demonstrate the power of this emerging brand and the   significant opportunity ahead of us. Clearly we offer our   customers industry leading product innovations that best fits   quality and value, wrapped in emotional brand experiences.",
    "Our digital business was also a highlight producing growth in   the double-digits. Across channel and brands, we saw positive   traffic, and stores outpaced the mall, a clear indication of   strong brand equity. We ended the quarter with over $300 million   in cash and no debt after returning $83 million to shareholders   through dividends and share repurchases. We continue to make key   investments across our business and brands, deliver the best   products and customer experiences, and importantly, we invest in   our people to ensure we have the best talent and culture to drive   future success.",
    "As I said last quarter, we are better positioned than ever to   capitalize on the continued disruption across the retail   industry. That view has not changed. Our brand keeps getting   stronger and we intend to continue to capture market share and   grow our merchandise assortments, our customer base and our   profitability. Our strength lies in our culture, our people, and   a strong purpose as an organization to show the world that there   is real power in the optimism of youth. I'm optimistic that we   will post another strong year for all of our stakeholders.",
    "And now I turn the call to Chad.",
    " Chad Kessler    --   Executive Vice President and Global Brand President-AE ",
    "Thanks, Jay, and good morning everyone. I was not satisfied   with our second quarter results. Comp sales declined 1% against   the strong 7% increase last year, which was the most difficult   comparison of the year. A cool May hurt demand for warm weather   apparel. Shorts missed our expectations and our product mix in   women's top skewed to lower AUR style. It was the trend -- it was   the right trend and unit demand was strong as the AUR pressure   caused comps to decline. These issues are largely behind us and   we are very encouraged by meaningful improvement in our business   in August and early September. We are seeing consistently   positive comps quarter-to-date, led by strength in jeans and fall   apparel, which become increasingly important as we go forward. In   addition, despite the headwinds, there are plenty of bright spots   in the second quarter.",
    "First, we continue to consolidate our leadership in jeans   where we are the undisputed destination for customers. The second   quarter represented our 24th consecutive quarter of record sales   and we delivered strong double-digit growth in both our men's and   women's assortment. We are proud to remain the Number 1 women's   jeans brand in America, Number 1 men's jeans brand in our core 15   year to 25 year old age group and the Number 2 jeans brand   overall. We are committed to extending our leadership and   expanding share through continued innovation and an emphasis on   inclusivity.",
    "With that in mind, we are very pleased with the response to   the new women's Curvy collection, which has shown to be   incremental. Together with the extended size ranges in both men's   and women's, we are thrilled to welcome new customers to our   brand. As awareness to new styles and expanded sizes grow, we   expect new customers to build the time. This will help sustain   our strong growth in jeans and extend our leadership position in   this important category. With peak back-to-school now behind us,   we are confident we will deliver another record season.",
    "There were other highlights in the quarter. In addition to   record sales in dresses and skirts, I'd like to call out   accessories, which was a standout this quarter. The team has been   working hard to strengthen our accessories program and we're   pleased to see those improvements paying off. Powerful new trends   combined with our renewed focus on this category to yield very   positive performance in the near and longer term.",
    "The AE brand is very healthy and coveted by today's consumers.   Our AE and me campaigns and brand positions of inclusivity,   individuality and self-expression strongly resonate in today's   youth market. Both in-stores and online, traffic was once again   positive, and we are retaining customers at a higher rate with   our best customers spending more and engaging more frequently   with our brand. Expanding our customer base through our loyalty   programs, social media outreach and the personal connections at   the store level will continue to fuel the brand's strength.",
    "Looking ahead, I'm confident in our plans for the back half of   the year and encouraged by the start of the third quarter. We see   a healthy consumer and powerful fashion trends that are perfect   for our brand. American Eagle is stronger than ever and poised to   continue winning in the disrupted retail environment.",
    "Now I'd turn the call over to Jen.",
    " Jennifer Foyle    --   Executive Vice President and Global Brand   President-Aerie ",
    "Thanks, Chad, and good morning everyone. I'm thrilled to   report that Aerie delivered a spectacular quarter. The revenue   increased more than 20%, fueled by a comparable sales increase of   16% in new [Phonetic] stores. Sales growth built on a 27% comp   increase last year. This period marked our 19th consecutive   quarter of double-digit sales increases. I'm extremely proud of   the consistency we continue to see across the business as we   capture meaningful market share. Sales metrics reflected a   healthy growing brand. Traffic was positive across all channels,   with stores well outpacing mall averages as we continue to   attract more customers to Aerie. Our basket size is also   expanding at a very healthy clip, driven by increased units per   transaction and strong AURs. In the second quarter, all   categories posted sales growth. Bras were one of the strongest   areas in the quarter. We saw healthy demand for core bras and   renewed excitement for bralette, one of Aries signature   categories.",
    "Once more, we are thrilled by the very positive response to   our new apparel collections. Our bottoms business remains robust,   and due to strong demand, we were chasing tops throughout much of   the quarter. Brand awareness continues to grow. Aerie's Brand   body -- body positivity platform and empowerment is our strength   and underpins the encouraging emotional connection with our   customers. The power of self-love and acceptance builds trust and   loyalty, and that is truly with the AerieREAL movement is all   about. As a result, our customer file continues to expand.   Retention rates are growing, with existing customers shopping   more frequently and buying more categories from Aerie.",
    "Our store expansion plans are tracking well. We opened 20   stores in the quarter with an emphasis on new and filling   markets, including openings in Texas and California, which are   priority states for us. As we enter new markets, we are seeing an   uplift in our digital business in those markets as well. I'm also   very pleased with the performance of remodeled stores in our   latest design. In fact, 10 of our remodeled locations and several   new stores quickly rose to be among our top 25 most productive   locations. This validates our real estate strategy and the power   of Aerie.",
    "We still have meaningful locations and opportunity to expand   our footprint in the coming years with a sizable retail presence   of 10,000 square feet in only 23 states. I'm so very thankful for   my amazing team, who continue to deliver exception results across   the Board, from outstanding collections, to our uniquely   innovative marketing campaigns, to new store openings, this team   is firing on all cylinders.",
    "Our back-to-school season has been a terrific success. I'm   very encouraged by sales trends in key seasonal apparel   categories, as well as strength in intimates. I'm confident that   we will continue our strong momentum into the second half of the   year. Beyond that, we have visibility to exceeding $1 billion in   short order and see great potential for Aerie over the longer   term.",
    "And now I'll turn the call over to Bob.",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    "Thanks, Jim, and good morning everyone. My comments were   focused on the adjusted second quarter financials, which excludes   certain items as detailed in the press release and tables in the   investor presentation. As indicated, second quarter operating   results fell short of our expectations. By many accounts, the   environment was challenging. And as we indicated back in early   June, May was unreasonably cool, suppressing demand for warm   weather apparel. This continued with the later start to   back-to-school adversely impacting second quarter sales and   margins. However, there were a number of areas that we performed   very well and we were pleased to post increases in consolidated   comp and revenue, marking 18 consecutive quarters of comp growth   in record revenues. We are also encouraged by a meaningful   improvement in business trends so far this quarter.",
    "Turning now to the second quarter financial results. Total net   revenue increased $76 million, rising 8% to $1 billion. Total   revenue includes $40 million recognized for license royalties   from a third-party operator in Japan. This payment was the   primary driver of margin improvement and generated $0.15 in   earnings per share. We plan to terminate the agreement with our   partner and are currently exploring options for our future   business model to continue our growth in Japan. Consolidated   comparable sales increased 2%, building on 9% growth last   year.",
    "By brand, American Eagle comps declined 1% in the second   quarter, following a 7% increase last year. Aerie comps increased   16%, building on 27% growth last year. We saw positive digital   comps for American Eagle, which was offset by decline in stores.   Aerie grew across both channels in the quarter.",
    "On a consolidated basis, stores decreased 1%. Digital sales   rose in the low-double digits, reaching approximately 25% of   total revenue, up 100 basis points to last year. We saw the   biggest increases coming from our app and mobile channels which   contributed -- which combined now represent well over half our   digital business.",
    "Total gross profit increased $29 million or 8% to $383   million. Gross margin rate to revenue increased 10 basis points   to 36.7%. The increase was due to strong flow through from the   Japanese licensed royalties, which contributed approximately 230   basis points of margin improvement. This was largely offset by   increased markdowns, higher delivery expense and compensation   costs.",
    "Selling, general and administrative expense of $253 million   increased 8% and was flat as a percent of revenues at 24.3%.   Compensation was the largest contributor to the dollar increase,   primarily reflecting the continued impact from our investments in   customer facing, store payroll and wages, which began in   mid-2018. Higher professional fees also contributed to the   increase. Absent some expenses associated with the license   royalty revenue received, SG&A dollar growth was consistent   with our expectation of a mid-single digit increase. Depreciation   and amortization rose $2 million to 45 million or 4.3% as a rate   to revenue, which was down 10 basis points compared to last year.   Adjusted operating income increased 11% to $85 million from $76   million last year and the margin rate to revenue improved 20   basis points to 8.1%. Operating income includes approximately $34   million from the Japan license royalty.",
    "The effective tax rate of approximately 24% compared to   approximately 22% last year. Adjusted EPS of $0.39 increased 15%   from $0.34 last year, included in adjusted EPS was $0.15 from the   license royalty received. Adjusted earnings in the second   quarter, also excluded restructuring charges, of $2.7 million or   approximately $0.01 per share.",
    "Now regarding inventory, which can be found on page 11 of the   investor presentation. We ended the quarter with inventory at   cost of $535 million, up $69 million or 15% from last year. Units   were up 10% versus the year ago period. The increase largely   reflects inventory to support strong demand for AE Jeans,   including new styles and expanded sizes. These are incremental   product lines to last year. Additionally, new Aerie stores and   improved in-stocks for our wholly owned international businesses   also contributed to the increase. These factors represented over   half of the inventory increase to last year. Overall, we feel   good about the composition of inventory.",
    "Capital expenditures totaled $55 million in the second   quarter, and we continue to expect capex to be in the range of   $200 million to $215 million for the year. During the quarter, we   completed $60 million in share repurchases and paid $23 million   in dividends to shareholders.",
    "In July, our Board of Directors authorized an additional 30   million shares for repurchase, and we exit the quarter with a   little over 37 million shares available for purchase. Our   liquidity position remain strong and we ended the quarter with   total cash and investments of $317 million and no debt   outstanding.",
    "Now turning to our real estate portfolio. Our 2019 priorities   are to accelerate the growth of Aerie, to reposition and remodel   80 stores and to continue expanding our global footprint. Based   on the openings to-date and our plans for the balance of the   year, we now expect every store openings this this year near the   lower end of our prior 60 to 75 target. Importantly, this is   simply a function of timing. Our long-term footprint, expansion   plans and growth expectations for this business are unchanged.   Overall, stores remain a very important part of how we operate   our business and engage with our customers. We have a highly   profitable store portfolio and significant lease flexibility.   Additional store information can be found on pages 14 through 18   in the investor presentation.",
    "I would now like to provide an update on the impact of   tariffs. As discussed in the past, we have actively collaborated   with our sourcing partners to meaningfully mitigate the potential   impact. In addition, we continue to make progress in further   reducing our exposure to China tariffs through a combination of   partnering with vendors and diversifying our geographic   production capabilities. Based on recently enforced tariffs List   4, we do not expect a material impact this year. At present, we   expect the impact to be manageable in 2020.",
    "Now looking ahead, we expect third quarter EPS in the range of   $0.47 to $0.49 per share. Consistent with improving sales trends,   we expect comparable sales growth in the low to mid-single   digits. This outlook assumes continued promotional activity.   S&GA expense is expected to increase in the mid-single   digits. Our third quarter guidance compares to EPS of $0.48 last   year and excludes potential impairment and restructuring   charges.",
    "To conclude, we're very pleased with quarter-to-date trends.   As Chad and Jen discussed, our fall product is performing across   both brands and we have a clear path for the rest of the year. We   remain focused on our strategic initiatives that will enable us   to maintain our comparable sales momentum, strengthen our bottom   line and generate financial returns to our shareholders.",
    "Thanks. And now we'd like to take your questions.",
    " Operator ",
    "Thank you. [Operator Instructions] Our first question comes   from the line of Jay Sole with UBS. Please proceed with your   question.",
    " Jay Sole    --   UBS -- Analyst ",
    "Great. Thank you so much. Jen, my question is about Aerie,   you're going up against a tougher comp in 3Q. On a two-year   basis, the comp looked like it slowed a bit from 1Q to 2Q. Do you   feel confident that you can deliver within the guidance? Do you   feel confident to deliver a comp at least in line with where you   were in 2Q or better as you look at the 3Q?",
    " Jennifer Foyle    --   Executive Vice President and Global Brand   President-Aerie ",
    "Absolutely. If I mentioned -- well, I did mention that our   apparel business has been very strong as we get into the back   half. We own more apparel, because it's seasonally appropriate.   However, so we feel really confident about what's happening in   apparel and what happened in August. Our comps were very strong   and laid up against some very, very strong comps. So that said,   also, we continue to own and dominate bras and undies. Bras had   an extremely great month in August and we're looking forward to   chasing more bralettes actually, they've been on fire for us.",
    " Jay Sole    --   UBS -- Analyst ",
    "Great. And then, Bob, if I can just ask you about the Japan   license royalty. Can you just clarify, how is the Japan business   was accounted for in this quarters? Was this 40 million a   one-time issue, a one-time payment or was there a similar amount   last year? If you could just clarify that for us, it'd be super   helpful.",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    "It's a one-time payment that was triggered by a breach by our   licensed partner, which put into motion minimum royalties from   prior years that became due as a result of that breach. So it   actually was the result of events and circumstances that   transpired directly in the quarter and was related to higher   royalty rates that were triggered as a result of that.",
    " Jay Sole    --   UBS -- Analyst ",
    "Got it. Okay. Thank you so much.",
    " Operator ",
    "Thank you. Our next question comes from the line of Paul   Lejuez with Citigroup. Please proceed with your question.",
    " Paul Lejuez    --   Citigroup -- Analyst ",
    "Hey, thanks guys. Just to follow-up on the Japan payment. Was   that already received or was that simply an accrual? Also curious   why you didn't break it up, Bob?",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    "Paul, it was received -- Paul, it was received and there is   coming in the quarter.",
    " Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer ",
    "So $40 million is the total amount of royalties earned. $30   million was paid, there's a $10 million receivable that's due in   a couple of months.",
    " Paul Lejuez    --   Citigroup -- Analyst ",
    "Got you. Okay. And then, can you just maybe provide a little   bit more color on quarter-to-date trends that you're seeing by   brand and what gives you confidence to include that mid-single   digit as part of the comp guidance for 3Q? Thanks.",
    " Jennifer Foyle    --   Executive Vice President and Global Brand   President-Aerie ",
    "For Aerie, we're just -- we're seeing strong business in   apparel as I mentioned. Honestly, all categories are doing great.   We're really pleased with the August results. I just mentioned   bralettes are doing really well for us, the bra category, the   core bra category. You know, we're really, as I said in my   script, we're really firing in all cylinders here. The team's   doing a great job executing.",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    "I would tell you with August representing our single largest   month within the quarter from both the sales and a profit --   operating profit perspective. we've got that behind us now. We're   very happy with how back-to-school finished off as we pointed   out. Although we got off to a slow start in the last two weeks of   July, we finished back-to-school really strong in August. So   we've got our biggest month completed and that gives us a lot of   confidence in support of our guidance that we gave for the   quarter.",
    " Chad Kessler    --   Executive Vice President and Global Brand President-AE ",
    "Yeah, I think what we were seeing in AE a lot of the   challenges in the second quarter were really related to seasonal   product as I mentioned. Shorts with a slow start with a cool   weather, and unit demand was great, and women's knits, we had a   lower AUR. As we go -- run through back-to-school and shift to   long bottom, and the strength of our Jeans business that's been   really powerful with our new launches have all exceeded   expectations. And then as we get into the warmer weather product   that we've already started to set through August, early demand   has been really great and broad based across a lot of category.   So I expect the third quarter and -- even the fourth quarter, the   whole fall should have a better trend than what we saw in the   second quarter.",
    " Paul Lejuez    --   Citigroup -- Analyst ",
    "Has there been promotionally driven or are you happy with the   margins?",
    " Chad Kessler    --   Executive Vice President and Global Brand President-AE ",
    "Promotions were consistent year-over-year. As the bottoms   business grows, that does carry -- jeans are slightly lower   margin rate than the tops business. But as we have talked, it's   back on track. We'll hopefully see margins improving with that as   well.",
    " Operator ",
    "Thank you. Our next question comes from the line of Oliver   Chen with Cowen & Company. Please proceed with your   question.",
    " Oliver Chen    --   Cowen & Company -- Analyst ",
    "Hi. Thank you. Bob, in one of your comments you mentioned that   you -- the outlook assumes continued promotional activity. What   does that mean in terms of how you're seeing merchandise margins   evolve? And it sounds like your inventory position right now is   very clean. I would love your thoughts there. And then the   innovation that you've done with Style Drop in the subscription   model, Chad, what are your thoughts on managing incrementality   and what this means for customer engagement and why now?",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    "Yes. So, you know, our guidance does contemplate slight   deleveraging of our gross margin rate, not to the magnitude that   we've seen in Q2 results, it will be muted relative to that as we   clear through some of the seasonal inventory that we carried in   from the end of the second quarter. Now having said that, Oliver,   we are really happy with the currency, the inventory, not only   our incremental investments supported by businesses that are   really performing well, and huge large growth vehicles for us,   but our carryover inventory from summer spring is less than 2% of   our whole total on hand, which is extremely manageable, but it   will have a slight impact on margin rate.",
    " Chad Kessler    --   Executive Vice President and Global Brand President-AE ",
    "And then as for Style Drop, we're basically six months into   it, and it's been really interesting to watch. I think the main   question, Oliver, is going to be the incrementality as you said.   What's the incrementality of it? Right now, we're seeing a lot of   our most engaged customers participating in the Style Drop rather   than at attracting new customers per se. We're seeing a higher   percentage of already engaged customers in the program. So we   just need to see if that means they're spending more in total   with the brand and if we're getting margin flow through from what   they're spending both in stores as well as renting. So that's why   we kicked off as a test and we are watching it. I do think these   sort of new forms of retail and new forms of customer purchasing   are really interesting. We have to make sure that they come with   the sales and the margin that we expect in our business.",
    " Oliver Chen    --   Cowen & Company -- Analyst ",
    "Thank you. Best regards.",
    " Judy Meehan    --   Vice President of Investor Relations ",
    "Thank you.",
    " Operator ",
    "Thank you. Our next question comes from line of Tiffany Kanaga   with Deutsche Bank. Please proceed with your question.",
    " Tiffany Kanaga    --   Deutsche Bank -- Analyst ",
    "Hi. Thanks for taking our questions. With your AUR   decelerating further in the second quarter, with a lot of new   innovation introduced for back-to-school, do you believe you can   lift that metric back to positive territory during the back half   of the year against the easier compares or should promotional   activity keep it down year-over-year? And would you also break   down your AUR in the quarter by brand since I thought I heard Jen   mentioned strong AUR on the Aerie side? Thanks.",
    " Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer ",
    "We're already -- Tiffany, we're already seeing AURs positive   to the last year with the strength of the fall product in AE, as   well as the Jeans business continuing to grow and we're   definitely getting paid for the innovation we're delivering in   [Indecipherable]. As I mentioned, a lot of it -- AUR challenge in   Q2 came from a lower AUR trend in the women's knits category that   in the first quarter we were able to overcome the low AUR with   positive comps. And in the second quarter, we weren't able to   overcome that lower AUR. But it was really -- the AUR in the   second quarter for AE is really driven by product mix impacting   -- ended up impacting top line. And as I said, so far in the   third quarter, our AURs are back to positive and we definitely   make sure that the innovation we put into our product is   recognizable -- is recognizable for the customer and we're   getting paid for the innovation we have.",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    "And Aerie is definitely getting paid for their innovation and   product category expansion. They saw AUR increase in the   mid-single digits in the second quarter.",
    " Tiffany Kanaga    --   Deutsche Bank -- Analyst ",
    "Thank you so much.",
    " Operator ",
    "Thank you. Our next question comes from line of Dana Telsey   with Telsey Advisory Group. Please proceed with your   question.",
    " Dana Telsey    --   Telsey Advisory Group -- Analyst ",
    "Good morning. As you think about the tops category, what needs   to change in order to deliver the positive results that you're   looking for? And lastly, as you think about your store base, both   full-line and outlet stores. How are you seeing the profitability   in each store format and where do you see openings and closings   stand at reach? Thank you.",
    " Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer ",
    "Yeah, so, you know, what we're seeing in tops, as I mentioned   was really the bare knits carrying a lower AUR and being a high   percentage of the business in the second quarter. What we need to   see change in Q3, I think, we've already seen change as a   seasonal categories come in with fleece, sweaters, outerwear plus   knits, really across the board in tops. We're seeing return to   strong sales in seasonal categories that carry a higher AUR. And   those businesses are all really healthy. So I think we're going   to see that continue through the rest of the third quarter and   into the fall as temperatures drop and as the assortment mixes   even more into those categories.",
    "In terms of stores, we are -- we see healthy profitability in   both mainline and outlet stores. You know, there's only a handful   of our stores that are not profitable. And so, but we look at as   we renew leases. We're looking at active returns in all of the   stores, not really factory or mainline specific, but really store   by store.",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    "And, you know, it's been a pretty consistent answer. I'll just   add a little more color to that. Over 95% of our fleet is   profitable. That 5% that isn't are either new stores that haven't   hit their sales productivity, maturity levels or the flagship in   nature that have other purposes other than just four-wall   profitability. But we have an extremely strong and profitable   real estate portfolio. And to give you an example, the   flexibility we have in that, we've got out of our 1,075 stores,   600 of them are coming up for lease decision over the course of   the next three years at a rate on average of about 200 locations   a year. We're constantly looking at those renewals, whether the   stores meet our strategic objectives, profit objectives, etc. So   we continue to feel really good about our our store fleet and the   performance across the fleet.",
    " Dana Telsey    --   Telsey Advisory Group -- Analyst ",
    "Thank you.",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    "And I'm sorry -- your one of the question was store openings   and closings. We're going to open a little over 66 stores, add to   that number about another 29 for Aerie side by side store. So   we're going to have 95 additional new stores that we will be   opening in the course of the year and we'll be closing around 12   stores with the majority of those being AE stores throughout the   course of the year.",
    " Dana Telsey    --   Telsey Advisory Group -- Analyst ",
    "Thank you.",
    " Operator ",
    "Thank you. Our next question comes from the line of Janine   Stichter with Jefferies. Please proceed with your question.",
    " Janine Stichter    --   Jefferies -- Analyst ",
    "Hi, good morning. Two questions for Jen on Aerie. First, just   in the bralette commentary. Curious to hear your thoughts on   what's behind the resurgence there, and if you're seeing the   bralette purchase is more of an incremental purchase that she is   using as a fashion item or is there some trade-off between bras   and bralettes? And then you mentioned strong AUR there for Aerie.   I'm wondering if you could just comment on what you're seeing in   terms of promotional activity in this space and we've seen some   competitors be very promotional. And just your thoughts on any   impact that might be having to your pricing strategy? Thank   you.",
    " Jennifer Foyle    --   Executive Vice President and Global Brand   President-Aerie ",
    "Well, let's you know, I always say that we really have always   had a strong business in bralettes. Certainly was -- it really   peaked as a trend a couple of years ago, few years ago, in fact.   But we stayed with it, and it's our business and we own it. So we   feel proud of what we've done there and it hasn't really eaten   into our core bras. In fact, we've been very disciplined in bras.   We have extended sizes as Chad has in denim, but also really   focusing on the bra silhouettes that she's demanding from us and   not being over sorted. So that's really what's going on in the   bra business. Yeah, it has been promotional out there. But we   keep on mixing our AURs up. So, you know, we're able to ride that   wave.",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    "Just to put overall margin deleverage in a perspective, total   company gross margin was down 220 basis points versus last year   in the quarter. Aerie's gross margin rate was pretty much flat.   They had a very strong quarter in spite of what was an extremely   promotional environment, particularly going head to head with   some of her competitors, which she didn't have to do.",
    " Janine Stichter    --   Jefferies -- Analyst ",
    "Really helpful color. Thank you -- thank you very much.",
    " Jennifer Foyle    --   Executive Vice President and Global Brand   President-Aerie ",
    "Thank you.",
    " Operator ",
    "Thank you. Our next question comes from the line of Marni   Shapiro with The Retail Tracker. Please proceed with your   question.",
    " Marni Shapiro    --   The Retail Tracker -- Analyst ",
    "Hey, guys. I think the Curvy line looks great. So I have two   quick questions. Chad, if you could just touch a little bit on AE   Studio, trying to understand how that fits into the big scope of   the American Eagle brand. And then, Jay, if you could touch a   little bit on the partnership with Seventh Sense. I guess, when   are you expected to launch this in stores? And do you view this   as a new customer coming into American Eagle? You've been with   the brand for a very long time. You know the customer intimately.   So I'm curious what your thoughts are on that launch?",
    " Chad Kessler    --   Executive Vice President and Global Brand President-AE ",
    "Hi, Marti, in terms of AE Studio, we saw great results. We   Don't Ask Why as a way that we could learn about test and learn   quickly about new and exciting trends. When we evolve, Don't Ask   Why or I guess I'd replaced Don't Ask Why with AE Studio. So AE   Studio is a series of monthly trend capsules that we're doing in   a very fast lead time to try to learn about new product, new   styling and trying to create more editorial fashion message for   our customer and we're seeing great response to it and learning a   lot. So Don't Ask Why was really had a very specific point of   view in terms of selling and AE Studio is -- the goal is for it   to look different every month, and it's been a great learning   experience and we will use it like we use Don't Ask Why to test   and react in the business.",
    " Marni Shapiro    --   The Retail Tracker -- Analyst ",
    "It meant to look very different than American Eagle core tops   business or is it meant to sort of blend in with the   assortment?",
    " Chad Kessler    --   Executive Vice President and Global Brand President-AE ",
    "I think it depends month to month. It's really -- I think   there will be things that we are looking to learn about, but it's   also a lot of it, how we style the clothes, right. Like trying to   show maybe outfits in a different way and trying to communicate   to the customer that you can get a different look than maybe she   expects at American Eagle.",
    " Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer ",
    "And on the issue of the Seventh Sense, we're going to be --   we're going to be issuing this coming fall and we have a special   name for it. We have a special kick-off and we're gonna surprise   everybody. So we're not going to tell you now. It will be very   exciting. We think we've done some customer research. It's been   very positive. We think there's a big opportunity -- big   opportunity for us as to get to get into the beauty business.",
    " Marni Shapiro    --   The Retail Tracker -- Analyst ",
    "So, Jay, this will be in for the holiday season then?",
    " Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer ",
    "Yes, it will be.",
    " Marni Shapiro    --   The Retail Tracker -- Analyst ",
    "Fantastic. Thanks, guys.",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    "Thanks, Marni.",
    " Operator ",
    "Thank you. Our next question comes from the line of Kimberly   Greenberger with Morgan Stanley. Please proceed with your   question.",
    " Kimberly Greenberger    --   Morgan Stanley -- Analyst ",
    "Thank you so much. I was wondering if you could look back to   last year and let us know if you've got a similarly -- a similar   comparison in October. Does it get slightly more difficult as you   get into October? And then, I wanted to just ask about the   investments in store wages. Now that you've lapped the increases   in store wages, would you expect that that would represent less   of a pressure point in SG&A moving forward? Thank you so   much.",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    "Yeah, the last question Kimberly that you ask around store   payroll, as we pointed out, we started the incremental   investments and store payroll, kind of, mid second quarter of   last year. So we've pretty much left that at this point. And you   should not expect to see that level of incremental investment   going forward. If we're able to hit our revenue guidance as we've   communicated to you, which we feel very strong, that we can we   believe we still have the ability in the third quarter to   slightly leverage SG&A rate in addition to Q4 too. So still   represents part of our strategy and the narrative going forward   for sure.",
    "And as far as looking forward to October and the third   quarter, as I said, we're coming up against some good comp   performance, but I think our revenue guidance of low-single   digits to mid-single digits again represent -- reflects August in   the bank, which is almost 50% of our sales in the quarter -- in   much more of our profits in the quarter, roughly 80% of our   profits in the quarter. So feel really good about the guidance   that we gave and our ability to hit it.",
    " Kimberly Greenberger    --   Morgan Stanley -- Analyst ",
    "Thank you, Bob.",
    " Operator ",
    "Thank you. Our next question comes from line of Janet   Kloppenburg with JJK Research. Please proceed with your   question.",
    " Janet Kloppenburg    --   JJK Research -- Analyst ",
    "Good morning everyone. Quick question for Chad and for Jay.   Chad, I know your denim business has been consistently strong for   a long time now. And I'm just wondering if that chunk of the   business is becoming outsized and if there's any worry about, you   know, a jeans slowdown and some sort of change in the bottom   cycle and what that might mean to American Eagle's growth   outlook?",
    "And for Jay it's interesting you just talked about beauty. I   was wondering if you could give us a look forward to the kinds of   growth strategies you are thinking about, whether they would be   internally developed or if you're also considering M&A   opportunities? Thank you so much.",
    " Chad Kessler    --   Executive Vice President and Global Brand President-AE ",
    "Hi Janet. Thanks. The Jeans business is amazing and continues   to grow, and as I just said, at this point I'm quite confident   we're going to have another record quarter in jeans. We find   there's even more demand than what we offer today for the   customer. We continue to see the opportunity to expand   productivity throughout the assortment with more jeans. Now, I   think that could lead to some concerns that you're saying that   jeans can get too big, but four or five years ago, when everyone   said jeans were dead, we were writing record in Jeans business   and we continue to do so. I think for us, we are the destination   for jeans and I think jeans are going to outlive everybody in   this room and on this call. And so I think what we saw prior is   when people ran away from jeans, we just consolidated our   position as the leader in the space. And I think that that is an   opportunity and a strength for us going forward.",
    "We do have a healthy bottoms business overall. So the rest of   the pants business, and even though, I spoke to some weakness in   shorts, we did write positive comps in women's shorts in the   quarter. There is -- we have a very strong bottoms business led   by our jeans, and I think people are going to continue to wear   bottoms as time goes forward.",
    " Janet Kloppenburg    --   JJK Research -- Analyst ",
    "Thanks.",
    " Chad Kessler    --   Executive Vice President and Global Brand President-AE ",
    "Thanks, Janet.",
    " Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer ",
    "And as far as the beauty business, we're just getting our toe   into the water. We're very excited about it. We think it's big   opportunity. Look, we see a lot of opportunity and we're very   gung ho as far as this year and we see a lot of opportunity like   for next year, too.",
    " Operator ",
    "Thank you. Our next question comes from line of Susan Anderson   with B. Riley FBR. Please proceed with your question.",
    " Susan Anderson    --   B. Riley FBR -- Analyst ",
    "Hi, good morning. Thanks for taking my question. On the China   tariffs, so it sounds like you don't expect a material impact   this year and next year manageable, I guess. Should we assume   that it will not be material next year also? And then also maybe   if you can give us an update on when you expect your exposure to   China sourcing to be next year, and I guess if it did go to 25%,   maybe if you could just talk about, kind of, the plan at that   level in terms of vendor concessions or would there any -- be any   plan in the future to raise prices? Thanks.",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    "Well, you know, this China tariff issue, trade war issue has   been going on for a while. And I have to tell you, our team, our   production sourcing team has been out in front of this and has   done a phenomenal job. They've been able to mitigate over   two-thirds of the tariff exposure through the partnerships and   the negotiating skills that they've had with our manufacturing   partners in China and migrating some of our production to other   geographies too. Today, China represents about 30% of our   production. We believe in the next 12 months to 18 months, we'll   be able to drive that down to 20% or below 20%, slightly below   20%.",
    "Yeah, this year's impact of terrorists is immaterial. Next   year, it's more material, it's a full year impact. We're only   going to see an impact a little bit in the fourth quarter and but   it's -- it's manageable within our total operating income number   and a lot of the other strategies that we have to drive income   growth.",
    " Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer ",
    "[Indecipherable] building your forecast too.",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    "It's definitely reflected in the guidance we gave.",
    " Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer ",
    "It's already in the guidance, too. And look, the good news is   that with the factories, we are -- we are the vendor of choice,   it is good. So we have the flexibility to move around and we are   moving around the world. And look, hopefully the President makes   a deal with China. There is probably a very good chance of a deal   getting done.",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    "And Jay, I haven't really heard any competitors disclosing   that they've been able to mitigate two-thirds of the tariff   exposure items. So I think that's a big plus for us and I think   it just demonstrates.",
    " Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer ",
    "Now let's put it this way, we don't plan to use tariffs for   any excuse or anything. We know we have to have merchandise for   competition. At the end of the day, if we have certain misses   last quarter -- last quarter, we think we can improve it next   year. We know where those opportunities lie. We know where it is.   We know where the opportunities are. We know what we have to do   merchandise wise. Actually we're working on it. We don't accept   excuses and we don't like being down. This was the first -- this   was the first quarter miss in a long time, but there's been a lot   of changes made and we feel very good about the future.",
    " Susan Anderson    --   B. Riley FBR -- Analyst ",
    "Very helpful. Thank you so much guys.",
    " Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer ",
    "Let's put this way, I feel much better about the future than   the analyst will. We're watching the stock go up and down. I got   lot more confidence in the analyst and I'll just put it this way,   shame on all the naysayers.",
    " Operator ",
    "Thank you. Our next question comes from the line of Kate   Fitzsimons with RBC Capital Markets. Please proceed with your   question.",
    " Kate Fitzsimons    --   RBC Capital Markets -- Analyst ",
    "Yes. Hi, good morning. I guess, piggybacking on that tariff   question, I'm curious kind of what your view is on price   increases to the extent that tariffs go to 25%, you know   definitely impressed that you guys are able to mitigate a lot of   the pressure internally but just curious on your views on   pricing. And then secondly, Chad, you made mention of a fashion   cycle and the changing silhouette, you seem pretty optimistic on   what you're seeing there. What are you seeing on the top to   bottom ratio now? Is that where you want it to be? You know   sounds like it's improving quarter-to-date versus 2Q maybe? Just   how should we think about the opportunity there? Thank you.",
    " Chad Kessler    --   Executive Vice President and Global Brand President-AE ",
    "I think for pricing, when we look at the tariff, I think we   just have to be very careful. I think we have to make sure we've   always been a brand that represents value. We've always been a   brand that priced our apparel to where we -- for what we built   into it and what we think the customer will perceive as a fair   ticket. I think if tariffs do go to 25% and we're still making a   percentage of our goods in China, we need to look at some of   those tweener styles where maybe there's an opportunity for a few   dollars here or there, but I think the environment will continue   to be competitive and we will continue to be a leader   representing value in the space. And so I don't think that we can   look at any sort of across the Board increases in ticket, so. But   then again, you know, we have to look at it as the news breaks   and as things come across and use our best judgment at that   time.",
    "In terms of women's changing silhouette, we are -- we do   continue to see a shift into high rises and some of the new jean   silhouettes in women's really driving a shift in both the size of   the tops as well as boxier silhouettes or longer silhouettes. And   I think it provides a great opportunity going into fall. As I   said, the back-to-school merchandise was very well received and   the categories that we will drive going forward through the fall   are the categories that drove back-to-school and I think that   provides significant opportunity in women's non-bottoms   apparel.",
    "The tops to bottoms ratio, I think, it's a bit of a tough   metric for us to look at other retailers, because of the strength   of our bottoms business. As bottoms continues to grow that means   that they continue to grow and they're part of that ratio, right.   So we continue to see bottoms grow. The goal -- my goal is that   the bottoms growth is incremental to the brand growth and that   the tops business at least hold steady if not growing along with   bottoms. But I don't see that shifting our tops to bottoms ratio   back to tops. But each -- every brand has their strength and our   strength is both our brand as well as our bottoms business and   the apparel that outfits back to those bottoms and we've seen   that drive consistent positive growth. Q2 is a hiccup, but I   think coming into Q3 and going through the fall, we'll continue   to see that drive the business in a positive way.",
    " Kate Fitzsimons    --   RBC Capital Markets -- Analyst ",
    "Great guys. Best of luck.",
    " Chad Kessler    --   Executive Vice President and Global Brand President-AE ",
    "Thanks.",
    " Operator ",
    "Thank you. Our next question comes from line of Westcott   Rochette with Evercore ISI. Please proceed with your   question.",
    " Westcott Rochette    --   Evercore ISI -- Analyst ",
    "Thanks, guys. I have a question on the interplay between the   Aerie and the American Eagle customer. And as you grow brand   awareness at Aerie and as you move into apparel, and especially   -- maybe if you go into new markets like Texas and California, do   you see that Aerie customer and the brand awareness translating   over to Eagle, an opportunity to go over to Eagle and how is that   customer kind of interact between the two brands?",
    " Chad Kessler    --   Executive Vice President and Global Brand President-AE ",
    "I think we have a really virtuous circle with the customer   base. We have two really strong brands that appeal their   customers from 15 to 25 and maybe even a little higher in Aerie.   And Aerie brings a lot of excitement with AerieREAL campaign and   bringing new customers to the brand that, yes, we actively work   to migrate into the AE business and we still have a lot of AE   customers who only shop in AE and we work to build Aerie brand   awareness and help inspire those customers to shop in the Aerie   business. So I think it's a really positive thing to have these   two brands working together and a positive thing that we share a   website. And we see even with Aerie's apparel business growing,   as Jen and I have said on earlier calls, we try to make sure that   Aerie apparel is more lounge, AE apparel is more jeans based, and   we try to not compete directly with each other and we find that   in total. It lifts the entire business, and that we can use both   brands to attract new customers and then retain those customers   and migrate those customers between the brands. It's really a   positive thing to have, two such strong brands under the same   umbrella.",
    " Judy Meehan    --   Vice President of Investor Relations ",
    "Okay. So we'll take one more question.",
    " Operator ",
    "Thank you. Our final question comes from line of Rebecca Duval   with BlueFin Research Partners. Please proceed with your   question.",
    " Rebecca Duval    --   BlueFin Research Partners -- Analyst ",
    "Good morning, and thank you for taking my question. Chad, I   was just wondering you talked a little bit, you just touched on   it briefly about the extended sizes and that you're starting to   see a new customer base come in, particularly at the AE brand.   I've seen the reaction that you -- actually, with the reviews of   the Curvy, it's pretty incredible online. But I'm wondering how   you guys are measuring that in terms of just new customer   acquisition and what are the plans on extended sizes? Are you   going to continue into tops as well or is it just going to   continue on to denim? And then along those lines, are there   different plans in terms of the marketing that we're going to see   to kind of get that message out there that you are offering the   extended sizes for the back half. Thanks.",
    " Chad Kessler    --   Executive Vice President and Global Brand President-AE ",
    "Yeah. So just sort of break into two parts. One, Curvy   represents everything from -- it was really about the silhouette   in the shape and not the size. And so Curvy has been great. When   we look at the Jeans business, it looks like Curvy is really   incremental to the Jeans business, our core Jeans business, we   would also be posting positive comps in the quarter even before   we layer in Curvy. So Curvy has been a great success and we're   very happy with that. We did a lot of specific marketing around   Curvy and getting the reach out to customers, both existing   customers who maybe felt like our jeans didn't provide the   optimal fit as well as to new customers in the brand.",
    "The extended sizing is something that I'm really excited we're   able to offer in all stores. The brand is really about   inclusivity. And I think Aerie and Jen really led the way there   and we're happy to build upon it by extending the sizes we have   in our stores. I think that's still a story of attracting a new   customer to the store. We're seeing faster pickup online, but   we're still getting the awareness out to the store customer and   we're seeing it build. We're seeing it build over time, but it's   still early days. They've only been in stores for like five   weeks. But I'm happy that we have it and I'm happy to see it   build and I do think it's an opportunity to grow the customer   base. We do expect to have the larger sizes across all of our   bottoms category. And then in tops, I think we'll see how the   reaction builds in bottoms and then see if we're able to offer it   across tops as well.",
    " Rebecca Duval    --   BlueFin Research Partners -- Analyst ",
    "Great. Thanks.",
    " Judy Meehan    --   Vice President of Investor Relations ",
    "So that concludes our call today. Thanks for your   participation and have a great day.",
    " Operator ",
    "[Operator Closing Remarks].",
    " Duration: 53 minutes ",
    " Judy Meehan    --   Vice President of Investor Relations ",
    " Jay L. Schottenstein    --   Executive Chairman and Chief Executive Officer ",
    " Chad Kessler    --   Executive Vice President and Global Brand President-AE ",
    " Jennifer Foyle    --   Executive Vice President and Global Brand   President-Aerie ",
    " Robert L. Madore    --   Executive Vice President and Chief Financial Officer ",
    " Jay Sole    --   UBS -- Analyst ",
    " Paul Lejuez    --   Citigroup -- Analyst ",
    " Oliver Chen    --   Cowen & Company -- Analyst ",
    " Tiffany Kanaga    --   Deutsche Bank -- Analyst ",
    " Dana Telsey    --   Telsey Advisory Group -- Analyst ",
    " Janine Stichter    --   Jefferies -- Analyst ",
    " Marni Shapiro    --   The Retail Tracker -- Analyst ",
    " Kimberly Greenberger    --   Morgan Stanley -- Analyst ",
    " Janet Kloppenburg    --   JJK Research -- Analyst ",
    " Susan Anderson    --   B. Riley FBR -- Analyst ",
    " Kate Fitzsimons    --   RBC Capital Markets -- Analyst ",
    " Westcott Rochette    --   Evercore ISI -- Analyst ",
    " Rebecca Duval    --   BlueFin Research Partners -- Analyst ",
    " More AEO analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than American Eagle   Outfitters     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and American Eagle   Outfitters wasn't one of them! That's right --   they think these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 02:23:36"
}