{
  "url": "https://www.nasdaq.com/article/abr-named-top-10-reit-at-dividend-channel-with-924-yield-cm1206484",
  "title": "ABR Named Top 10 REIT at Dividend Channel With 9.24% Yield - Nasdaq.com",
  "text": [
    "Arbor Realty Trust Inc (Symbol: ABR) has been named as a Top 10 Real Estate Investment Trust (REIT), according to Dividend Channel  , which published its most recent ''DividendRank''  report. The report noted that among REITs, ABR shares displayed both attractive valuation metrics and strong profitability metrics. For example, the recent ABR share price of $12.55 represents a price-to-book ratio of 1.3 and an annual dividend yield of 9.24% - by comparison, the average stock in Dividend Channel's coverage universe yields 3.9% and trades at a price-to-book ratio of 2.2. The report also cited the strong quarterly dividend history at Arbor Realty Trust Inc, and favorable long-term multi-year growth rates in key fundamental data points.      The report stated, '' Dividend investors approaching investing from a value standpoint are generally most interested in researching the strongest most profitable companies, that also happen to be trading at an attractive valuation. That's what we aim to find using our proprietary DividendRank formula, which ranks the coverage universe based upon our various criteria for both profitability and valuation, to generate a list of the top most 'interesting' stocks, meant for investors as a source of ideas that merit further research.  ''  makeArticleAd();  REITs hold a special place in the hearts of dividend investors, because they must distribute at least 90% of their taxable income each year to shareholders as dividends. While this can make for a high dividend yield, it also introduces some volatility and uncertainty into the level of payments from year to year - hu ge dividend payout  s are common when a REIT turns large profits, versus smaller payouts or even periods of no dividends in times of losses.    The current annualized dividend paid by Arbor Realty Trust Inc is $1.16/share, currently paid in quarterly installments, and its most recent dividend ex-date was on 08/14/2019. Below is a long-term dividend history chart for ABR, which the report stressed as being of key importance. Indeed, studying a company's past  dividend history  can be of good help in judging whether the most recent dividend is likely to continue.      10 Top Ranked High Yield REITs »  ",
    "  10 Top Ranked High Yield REITs » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 07:38:51"
}