{
  "url": "https://www.nasdaq.com/article/4-smart-ways-to-split-bills-with-friends-while-traveling-abroad-cm1206814",
  "title": "4 Smart Ways to Split Bills With Friends While Traveling Abroad - Nasdaq.com",
  "text": [
    " For their vacation to Italy last year, Angela Feher and a   friend from London had to figure out a workable way to share   costs. \"We looked into PayPal, and it would've cost us a fee. And   Venmo didn't work,\" says Feher, communications manager at TripIt,   a travel-planning app based in San Francisco. Despite the rise of peer-to-peer apps to send money online   free and easily, many options aren't available or have usage   restrictions outside the U.S., including Venmo, Zelle and   Square's Cash App. You'll need different cost-effective   strategies, an app or otherwise, to split meals and other   expenses on international trips with one or more friends.makeArticleAd(); First, have the right cards and cash Before leaving, consider payment options that won't charge you   for international use, and see if your traveling companions have   these, too:   Credit cards with no foreign transaction fees.      Most credit cards charge a fee, usually around 3% of the     purchase amount, for transactions made in other countries and     placed online from foreign merchants. See if you have or can     get a card that keeps foreign purchases fee-free.  Debit cards with no foreign ATM fees.      Since most U.S. banks don't have ATMs abroad, it's common to be     charged a fee to get cash overseas. But some online banks have     debit cards that don't charge foreign transaction or ATM fees,     and even reimburse you if an ATM operator does levy a     charge.  Foreign currency.      Your bank or credit union is     likely the cheapest place      to get hard currency for your travels, so visit a branch if     that's an option. Airport kiosks and foreign hotels typically     don't offer favorable exchange rates.  On her Italian getaway, Feher mostly paid for meals and   activities with a travel credit card that didn't charge foreign   transaction fees; her friend typically used euros she picked up   before leaving London. Then, choose how to split costs 1. Rotate who pays  Trading off might be easiest.    This worked best for Feher. She paid for the duo's train tickets   from Venice to Florence, for example, while her friend paid for a   pasta-making class. This strategy can work for large groups, too. Zarak Khan   celebrated his 30th birthday with 13 friends in Barcelona for a   week and they rotated who paid for meals, museum tickets and   other things. One friend tracked all expenses and found that by   week's end, only one had to pay another $14 to make everything   come out even. With this strategy, \"you give up a little bit in accuracy, but   you gain a lot in overall happiness,\" says Khan, behavioral   innovation director at Maritz, a company near St. Louis that   designs and manages incentive, loyalty and travel programs   grounded in behavioral science. \"You feel generous or you feel treated,\" Khan says. \"Everyone   wins.\" 2. Use one app to track, another to pay later  Check out a spending tracker for groups.    Instead of keeping receipts or using spreadsheets, free and   highly rated apps such as Splitwise and Splid keep IOUs organized   by group and person. You can split expenses equally or customize   the split, such as a situation where in a group of six one person   pays 75% and another pays 25% for the group's city tour. If you   want to feel in control of your travel budget, an app that   documents who owes what can be reassuring.  Reimburse back in the U.S.    When you return, you can use Venmo, cash or another form of   payment to square everyone up. This lets you avoid currency   conversion fees. 3. Send money with an international transfer app  You may want a different app to settle with friends who   live abroad.    Some apps such as TransferWise and OFX   send money online between currencies    without the steep costs banks charge for international wire   transfers. 4. Use an app's splitting feature if available  Some apps let multiple people pay.    Airbnb and Uber both offer this split feature, which can remove   the question of who pays for certain accommodations or rides.   While it won't be an option for all expenses, it's handy and   worth keeping an eye out for. Whatever way you and your friends cover costs, having a plan   can make traveling with a partner or group a lot less   stressful. Kelly Soderlund, travel trends expert at travel site Hipmunk,   notes how this can keep everyone happier. \"The last thing you want while traveling is to feel obligated   to pick up bills for friends without them appreciating or   acknowledging it,\" she says.   More From NerdWallet    4 Smart Ways to Split Bills With Friends         While Traveling Abroad   4 Smart Ways to Split Bills With Friends         While Traveling Abroad   4 Smart Ways to Split Bills With Friends         While Traveling Abroad      Spencer Tierney is a writer at NerdWallet. Email:       spencer.tierney@nerdwallet.com. Twitter: @SpencerNerd.   The article 4 Smart Ways to Split Bills With Friends While   Traveling Abroad originally appeared on NerdWallet. ",
    "For their vacation to Italy last year, Angela Feher and a   friend from London had to figure out a workable way to share   costs.",
    "\"We looked into PayPal, and it would've cost us a fee. And   Venmo didn't work,\" says Feher, communications manager at TripIt,   a travel-planning app based in San Francisco.",
    "Despite the rise of peer-to-peer apps to send money online   free and easily, many options aren't available or have usage   restrictions outside the U.S., including Venmo, Zelle and   Square's Cash App. You'll need different cost-effective   strategies, an app or otherwise, to split meals and other   expenses on international trips with one or more friends.",
    "Before leaving, consider payment options that won't charge you   for international use, and see if your traveling companions have   these, too:",
    "On her Italian getaway, Feher mostly paid for meals and   activities with a travel credit card that didn't charge foreign   transaction fees; her friend typically used euros she picked up   before leaving London.",
    " Trading off might be easiest.    This worked best for Feher. She paid for the duo's train tickets   from Venice to Florence, for example, while her friend paid for a   pasta-making class.",
    "This strategy can work for large groups, too. Zarak Khan   celebrated his 30th birthday with 13 friends in Barcelona for a   week and they rotated who paid for meals, museum tickets and   other things. One friend tracked all expenses and found that by   week's end, only one had to pay another $14 to make everything   come out even.",
    "With this strategy, \"you give up a little bit in accuracy, but   you gain a lot in overall happiness,\" says Khan, behavioral   innovation director at Maritz, a company near St. Louis that   designs and manages incentive, loyalty and travel programs   grounded in behavioral science.",
    "\"You feel generous or you feel treated,\" Khan says. \"Everyone   wins.\"",
    " Check out a spending tracker for groups.    Instead of keeping receipts or using spreadsheets, free and   highly rated apps such as Splitwise and Splid keep IOUs organized   by group and person. You can split expenses equally or customize   the split, such as a situation where in a group of six one person   pays 75% and another pays 25% for the group's city tour. If you   want to feel in control of your travel budget, an app that   documents who owes what can be reassuring.",
    " Reimburse back in the U.S.    When you return, you can use Venmo, cash or another form of   payment to square everyone up. This lets you avoid currency   conversion fees.",
    " You may want a different app to settle with friends who   live abroad.    Some apps such as TransferWise and OFX   send money online between currencies    without the steep costs banks charge for international wire   transfers.",
    " Some apps let multiple people pay.    Airbnb and Uber both offer this split feature, which can remove   the question of who pays for certain accommodations or rides.   While it won't be an option for all expenses, it's handy and   worth keeping an eye out for.",
    "Whatever way you and your friends cover costs, having a plan   can make traveling with a partner or group a lot less   stressful.",
    "Kelly Soderlund, travel trends expert at travel site Hipmunk,   notes how this can keep everyone happier.",
    "\"The last thing you want while traveling is to feel obligated   to pick up bills for friends without them appreciating or   acknowledging it,\" she says.",
    "  More From NerdWallet    4 Smart Ways to Split Bills With Friends         While Traveling Abroad   4 Smart Ways to Split Bills With Friends         While Traveling Abroad   4 Smart Ways to Split Bills With Friends         While Traveling Abroad   ",
    " More From NerdWallet ",
    "  Spencer Tierney is a writer at NerdWallet. Email:       spencer.tierney@nerdwallet.com. Twitter: @SpencerNerd.  ",
    " Spencer Tierney is a writer at NerdWallet. Email:       spencer.tierney@nerdwallet.com. Twitter: @SpencerNerd. ",
    "Spencer Tierney is a writer at NerdWallet. Email:       spencer.tierney@nerdwallet.com. Twitter: @SpencerNerd.",
    "The article 4 Smart Ways to Split Bills With Friends While   Traveling Abroad originally appeared on NerdWallet.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:45:09"
}