{
  "url": "https://www.nasdaq.com/article/will-the-new-iphone-11-revive-apples-fortune-cm1206645",
  "title": "Will the New iPhone 11 Revive Apple's Fortune? - Nasdaq.com",
  "text": [
    " Year-long anticipation finally comes to an end for all iPhone fans. Many have already marked Sep 10 to witness the \"next big product\" launch of Apple Inc. AAPL  at the Steve Jobs Theater in Cupertino, CA. The tech giant is trying its best to attract users to the series: iPhone 11, 11R and 11 Max. With fiscal third-quarter sales falling 11.8% and a huge number of users opting for Androids, the new series is like a ray of hope for Apple. The new series has multiple features like a triple camera, faster processing A13 chip and multi-angle face ID sensor.  Reasons Behind iPhone Sales Decline  Apple's iPhone business has gone through turmoil in the last few years. In fact, Apple is now no longer among the world's top three smartphone makers for the first time in a decade, thanks to a drop in iPhone sales. Currently, Samsung Electronics Co. SSNLF  , Huawei and Oppo are the top three smartphone manufacturers. As per Apple's CEO Tim Cook, iPhone owners aren't buying any newer version and instead are sticking to their existing models. As a result, the number of buyers is falling, hampering overall sales figure. Moreover, Android being less expensive, is affecting sales of pricey iPhones. Cook claims that existing trade dispute has also deeply impacted iPhone sales, as the last quarter saw a 21% year-over-year decline in sales from its high revenue zone, Greater China. Many iPhone enthusiasts believe that sales have been hurt by the fact that the product is not 5G ready yet, though its prime rival Samsung has already begun shipping its first 5G phones. Apple's war with QUALCOMM Incorporated QCOM  also took a toll in the development of the 5G enabled iPhones, which are expected to launch not before September 2020. Now that Apple has decided to buy the smartphone modem business from Intel, hopes are high that the 5G-enabled phones could be launched before the anticipated date.  What Makes iPhone 11 Series a Great Buy?  The iPhone 11 series consists of three models: iPhone 11, iPhone 11 Pro and iPhone 11 Pro Max. The highlights of the series will be the A13 chipset specially designed in association with chipmaker Taiwan Semiconductor Manufacturing Company Limited. The A13 chips will add extra processing power to iPhones. The phones will also have a two-way wireless charging system enabling faster charging speed and new multi-angle Face ID Sensors to facilitate easier unlocking of the device for users. iPhone 11, iPhone 11 Pro and iPhone 11 Pro Max will flaunt high-resolution display screen of 6.1-inch LCD, 5.8-inch OLED and 6.5-inch OLED.  After launching the dual rare camera technology in 2016, this year Apple has gone a step further planning to introduce a square-shaped, triple rear camera that will enrich photo and video quality. The iPhone 11 Pro and iPhone 11 Pro Max will feature a 12 MP triple camera setup at the back and a 12 MP selfie camera. Samsung recently launched Note 10, Note 10 Plus and Note 10 5G and Alphabet Inc.'s GOOG  Google Pixel 4 is rumored to be released by the end of September. While Apple has the Wireless PowerShare feature like Samsung Galaxy's S10, Apple enthusiasts are hoping for an Apple Pencil with the current series and a twist in the fingerprint scanning technology that can recognize a fingerprint placed anywhere on the screen.  Conclusion  The Zacks Rank #3 (Hold) company has always stood out in the smartphone market due to its focus on the users' privacy and its unique operating system. Though iPhone sales have suffered in the last few years, it is possible that the unveiling of 5G iPhones will boost the sales.You can see   the complete list of today's Zacks #1 Rank stocks   here   .  Legalizing THIS Could Be Even Bigger than   Marijuana  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana. Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Alphabet Inc. (GOOG): Free Stock Analysis Report   QUALCOMM Incorporated (QCOM): Free Stock Analysis Report   Apple Inc. (AAPL): Free Stock Analysis Report   Samsung Electronics Co. (SSNLF): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Year-long anticipation finally comes to an end for all iPhone fans. Many have already marked Sep 10 to witness the \"next big product\" launch of Apple Inc. AAPL  at the Steve Jobs Theater in Cupertino, CA.",
    "The tech giant is trying its best to attract users to the series: iPhone 11, 11R and 11 Max. With fiscal third-quarter sales falling 11.8% and a huge number of users opting for Androids, the new series is like a ray of hope for Apple. The new series has multiple features like a triple camera, faster processing A13 chip and multi-angle face ID sensor.",
    " Reasons Behind iPhone Sales Decline ",
    "Apple's iPhone business has gone through turmoil in the last few years. In fact, Apple is now no longer among the world's top three smartphone makers for the first time in a decade, thanks to a drop in iPhone sales. Currently, Samsung Electronics Co. SSNLF  , Huawei and Oppo are the top three smartphone manufacturers.",
    "As per Apple's CEO Tim Cook, iPhone owners aren't buying any newer version and instead are sticking to their existing models. As a result, the number of buyers is falling, hampering overall sales figure. Moreover, Android being less expensive, is affecting sales of pricey iPhones.",
    "Cook claims that existing trade dispute has also deeply impacted iPhone sales, as the last quarter saw a 21% year-over-year decline in sales from its high revenue zone, Greater China. Many iPhone enthusiasts believe that sales have been hurt by the fact that the product is not 5G ready yet, though its prime rival Samsung has already begun shipping its first 5G phones.",
    "Apple's war with QUALCOMM Incorporated QCOM  also took a toll in the development of the 5G enabled iPhones, which are expected to launch not before September 2020. Now that Apple has decided to buy the smartphone modem business from Intel, hopes are high that the 5G-enabled phones could be launched before the anticipated date.",
    " What Makes iPhone 11 Series a Great Buy? ",
    "The iPhone 11 series consists of three models: iPhone 11, iPhone 11 Pro and iPhone 11 Pro Max. The highlights of the series will be the A13 chipset specially designed in association with chipmaker Taiwan Semiconductor Manufacturing Company Limited.",
    "The A13 chips will add extra processing power to iPhones. The phones will also have a two-way wireless charging system enabling faster charging speed and new multi-angle Face ID Sensors to facilitate easier unlocking of the device for users.",
    "iPhone 11, iPhone 11 Pro and iPhone 11 Pro Max will flaunt high-resolution display screen of 6.1-inch LCD, 5.8-inch OLED and 6.5-inch OLED. ",
    "After launching the dual rare camera technology in 2016, this year Apple has gone a step further planning to introduce a square-shaped, triple rear camera that will enrich photo and video quality. The iPhone 11 Pro and iPhone 11 Pro Max will feature a 12 MP triple camera setup at the back and a 12 MP selfie camera.",
    "Samsung recently launched Note 10, Note 10 Plus and Note 10 5G and Alphabet Inc.'s GOOG  Google Pixel 4 is rumored to be released by the end of September. While Apple has the Wireless PowerShare feature like Samsung Galaxy's S10, Apple enthusiasts are hoping for an Apple Pencil with the current series and a twist in the fingerprint scanning technology that can recognize a fingerprint placed anywhere on the screen.",
    " Conclusion ",
    "The Zacks Rank #3 (Hold) company has always stood out in the smartphone market due to its focus on the users' privacy and its unique operating system. Though iPhone sales have suffered in the last few years, it is possible that the unveiling of 5G iPhones will boost the sales.You can see   the complete list of today's Zacks #1 Rank stocks   here   .",
    " Legalizing THIS Could Be Even Bigger than   Marijuana ",
    "Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.",
    "Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:18:00"
}