{
  "url": "https://www.nasdaq.com/article/texas-instruments-new-charger-ic-to-aid-electronics-space-cm1207238",
  "title": "Texas Instruments' New Charger IC to Aid Electronics Space - Nasdaq.com",
  "text": [
    "  Texas Instruments Incorporated TXN  or TI recently took the wraps off a new switching battery charger integrated circuit (IC), namely BQ25619. At a 4.6-V and 0.5-A output and an ultra-low termination current of 20 mA, the new battery charger IC offers 95% efficiency, 7% higher battery capacity and longer battery life. The new battery charger delivers three-in-one boost converter integration, and can be used for small medical applications like hearing aids, earbuds, wireless charging cases, IP network cameras, as well as patient monitoring devices. In addition, it can be used for personal care and fitness applications. As the company continues to leverage its expertise in the growing medical and electronics markets, as well as systems to launch compelling products for different markets like analog and embedded, we believe that this move is intended to boost top-line growth. Per a report from Statista, the personal electronics segment is expected to generate revenues of $335.5 million in 2019. Further, the report suggests that revenues are anticipated to hit $522.4 million by 2023, witnessing a CAGR of 11.7% between 2019 and 2023. User penetration in the market is projected at 23.8% for 2019 and the figure is likely to reach 34.9% by 2023. Solid prospects in this segment and TI's market position will likely aid sales of battery chargers.  Texas Instruments Incorporated Price and   Consensus         Texas Instruments Incorporated   price-consensus-chart    |   Texas Instruments Incorporated Quote    Wrapping Up  This move highlights Texas Instruments' R&D investments in several high-margin, and higher-growth areas of analog and embedded segments. The company is gradually increasing exposure in industrial and automotive markets, as well as dollar content at customers, while reducing exposure in the volatile computing market. It has been integrating different functionalities into single devices, as well as encouraging customers to opt for simpler, more power efficient and smaller form factor products that may potentially lower the cost of ownership and might be used in the smallest of applications. The launch will enhance the differentiated product pipeline and is expected to improve Texas Instruments' market share. However, the company operates in an intensely competitive industry and companies such as Analog Devices can pose stiff competition.  Zacks Rank & Other Stocks to Consider  Texas Instruments currently carries a Zacks Rank #2 (Buy). Other top-ranked stocks in the broader technology sector include Alphabet Inc. GOOGL  , Itron, Inc. ITRI  and Teradyne, Inc. TER  , each carrying a Zacks Rank #2. You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   . Long-term earnings growth for Alphabet, Itron and Teradyne is currently projected at 17.5%, 25% and 11.4%, respectively.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Alphabet Inc. (GOOGL): Free Stock Analysis Report   Texas Instruments Incorporated (TXN): Free Stock Analysis Report   Teradyne, Inc. (TER): Free Stock Analysis Report   Itron, Inc. (ITRI): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Texas Instruments Incorporated TXN  or TI recently took the wraps off a new switching battery charger integrated circuit (IC), namely BQ25619.",
    "At a 4.6-V and 0.5-A output and an ultra-low termination current of 20 mA, the new battery charger IC offers 95% efficiency, 7% higher battery capacity and longer battery life.",
    "The new battery charger delivers three-in-one boost converter integration, and can be used for small medical applications like hearing aids, earbuds, wireless charging cases, IP network cameras, as well as patient monitoring devices. In addition, it can be used for personal care and fitness applications.",
    "As the company continues to leverage its expertise in the growing medical and electronics markets, as well as systems to launch compelling products for different markets like analog and embedded, we believe that this move is intended to boost top-line growth.",
    "Per a report from Statista, the personal electronics segment is expected to generate revenues of $335.5 million in 2019. Further, the report suggests that revenues are anticipated to hit $522.4 million by 2023, witnessing a CAGR of 11.7% between 2019 and 2023. User penetration in the market is projected at 23.8% for 2019 and the figure is likely to reach 34.9% by 2023.",
    "Solid prospects in this segment and TI's market position will likely aid sales of battery chargers.",
    " Texas Instruments Incorporated Price and   Consensus ",
    "     Texas Instruments Incorporated   price-consensus-chart    |   Texas Instruments Incorporated Quote  ",
    " Texas Instruments Incorporated   price-consensus-chart    |   Texas Instruments Incorporated Quote ",
    " Wrapping Up ",
    "This move highlights Texas Instruments' R&D investments in several high-margin, and higher-growth areas of analog and embedded segments. The company is gradually increasing exposure in industrial and automotive markets, as well as dollar content at customers, while reducing exposure in the volatile computing market.",
    "It has been integrating different functionalities into single devices, as well as encouraging customers to opt for simpler, more power efficient and smaller form factor products that may potentially lower the cost of ownership and might be used in the smallest of applications.",
    "The launch will enhance the differentiated product pipeline and is expected to improve Texas Instruments' market share. However, the company operates in an intensely competitive industry and companies such as Analog Devices can pose stiff competition.",
    " Zacks Rank & Other Stocks to Consider ",
    "Texas Instruments currently carries a Zacks Rank #2 (Buy). Other top-ranked stocks in the broader technology sector include Alphabet Inc. GOOGL  , Itron, Inc. ITRI  and Teradyne, Inc. TER  , each carrying a Zacks Rank #2. You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    "Long-term earnings growth for Alphabet, Itron and Teradyne is currently projected at 17.5%, 25% and 11.4%, respectively.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:54:00"
}