{
  "url": "https://www.nasdaq.com/article/us-biodiesel-industry-leaders-urge-trumps-epa-to-lift-biodiesel-mandate-20190904-01194",
  "title": "U.S. biodiesel industry leaders urge Trump's EPA to lift biodiesel mandate - Nasdaq.com",
  "text": [
    "By Stephanie Kelly",
    "Sept 4 (Reuters) - U.S. biodiesel industry leaders told an Environmental Protection Agency regional administrator in Houston on Wednesday that they want the Trump administration to boost the volume of biodiesel that oil refiners must blend into their fuel each year, two sources familiar with the matter said.",
    "The request came days after President Donald Trump promised to deliver a to U.S. farmers related to ethanol, in response to pressure from the corn lobby over the administration's expanded use of waivers freeing small refineries from their obligation to blend biofuels (graphic).",
    "The biodiesel leaders told Region 6 Administrator Ken McQueen that the biodiesel industry has also been hurt by the waivers, not just the ethanol industry, and an increase in blending mandates would help compensate for that, the sources said.",
    "During the meeting, the group added that it does not benefit from the lifting of a summertime ban on E15, a higher-ethanol blend of gasoline, the sources said. The Trump administration earlier this year lifted the ban, hoping to give a boost to Midwest farmers struggling under his trade wars.",
    "McQueen said he would relay comments from the meeting to EPA Administrator Andrew Wheeler, the sources said.",
    "In July, requiring refiners to blend 20.04 billion gallons of biofuels into their fuel in 2020, up from 19.92 billion gallons in 2019. The proposed mandate, now under review by other government agencies before being finalized, includes 15 billion gallons of conventional biofuels like ethanol, unchanged from 2019. It also includes 5.04 billion gallons of advanced biofuels, like those made from agricultural wastes, up from 4.92 billion in 2019, the sources said (graphic).",
    "The mandate also proposed a biodiesel mandate of 2.43 billion gallons for 2021, unchanged from 2020, they said. The EPA sets biodiesel mandates a year in advance.",
    "EPA has until the end of November to finalize the proposal.",
    "Lawmakers from farm states, ethanol and biodiesel groups and corn farmers have been pushing the administration to take immediate steps to force the refining industry to make up for volumes of biofuels covered by waivers."
  ],
  "published_datetime": "2019-09-04 07:45:00"
}