{
  "url": "https://www.nasdaq.com/article/gm-will-use-google-to-power-future-infotainment-systems-20190905-00716",
  "title": "GM will use Google to power future infotainment systems - Nasdaq.com",
  "text": [
    "By Joseph White",
    "DETROIT, Sept 5 (Reuters) - General Motors Co will use embedded Google technology to power navigation, voice activated controls and other vehicle infotainment functions starting in 2021, in a win for Alphabet Inc  in the race with Amazon.com and other technology companies to control dashboards.",
    "GM said it will offer Google Assistant, Google Maps and other applications available through the Google Play app store in all its vehicle brands outside China, which is GM's largest single market. GM said the first vehicles with built-in Google infotainment technology will launch in 2021, with more models rolling out in the following years.",
    "Amazon is wooing automakers to embed its rival Alexa voice assistant technology in vehicles. ",
    "For years, GM and other automakers were reluctant to share dashboard space with Google, Apple Inc  and other tech companies. Automakers feared losing control of valuable data, and having their brands eclipsed by powerful Silicon Valley names.",
    "Consumers are, however, forcing automakers to shift gears. Connecting smartphones and apps to cars can be a clumsy experience because of automakers' poor technology, but having functionality built in from internet giants has begun to make for a smoother experience. ",
    "\"We have the ability today to give commands to vehicles with embedded voice assistants. It is very limited,\" Santiago Chamorro, GM's vice president for Global Connected Customer Experience, said in an interview. \"With Google voice assistant it is a better experience for them.\"",
    "Patrick Brady, Google's vice president of engineering, said the issue of harvesting and monetizing data is \"blown out of proportion\" when it comes to cars.",
    "\"We are working to bring services into the car,\" he said. Google will not have access to data about the way an individual drives, or data about the vehicle's maintenance needs, he said.",
    "GM could though enable customers to schedule vehicle maintenance using Google's voice commands, Chamorro said.",
    "The automaker said pricing for packages that include Google services will be set closer to vehicle launches. GM will continue to offer Apple Inc's CarPlay and AndroidAuto to allow consumers to project a version of their smartphone screen onto a dashboard screen.",
    "GM was a pioneer in offering drivers an on-board concierge service through its Onstar telematics system, which connects drivers to human operators. Some of the services those operators provide, such as turn-by-turn navigation, Google technology delivers with its automated system.",
    "Chamorro said GM will continue the Onstar service, which GM has promoted recently as a form of insurance, connecting motorists to an operator who can help in an emergency. \"That is fundamentally a human activity,\" Chamorro said. \"We have 100 trained technicians\" who can respond when an Onstar customer is in danger.",
    "For Google, the GM agreement offers the potential of embedding technology in as many as 3.6 million cars annually - the number of vehicles GM sold outside China last year. The Renault-Nissan alliance sells more than 10 million vehicles a year. Google's Brady said the company is discussing deals with other automakers but for now is focused on launching embedded systems with GM, Renault-Nissan-Mitsubishi and Volvo.",
    "\"We are mostly focusing on making those partnerships successful,\" he said."
  ],
  "published_datetime": "2019-09-05 10:00:00"
}