{
  "url": "https://www.nasdaq.com/article/uk-stocksfactors-to-watch-on-sept-5-20190905-00076",
  "title": "UK Stocks-Factors to watch on Sept. 5 - Nasdaq.com",
  "text": [
    " (Adds futures, news items)",
    "Sept 5 (Reuters) - Britain's FTSE 100 .FTSE index is seen opening 26points higher at 7,337 on Thursday, according to financial bookmakers, withfutures FFIc1 up 0.5% ahead of the cash market open.",
    "* WILLIAM HILL: William Hill PlcWMH.L said Philip Bowcock will step downas chief executive officer at the end of September after three years at thehelm. urn:newsml:reuters.com:*:nL3N25W1LR",
    "* MELROSE INDUSTRIES: Melrose Industries PlcMRON.L warned that weaknessin the global automotive market would persist in the second half of the year,but the turnaround specialist said it was confident of trading in line with itsexpectations this year. urn:newsml:reuters.com:*:nL3N25W1IW",
    "* ENQUEST: North Sea focused oil firm EnQuestENQ.L is chipping away atits debt pile, which was at around $1.6 billion at the end of June, it said,reiterating its output guidance of between 63,000 and 70,000 barrels per daythis year. urn:newsml:reuters.com:*:nV9N1MO02D",
    "* DIXONS CARPHONE: Dixons CarphoneDC.L reported another big fall inmobile phone sales in its latest quarter, though it maintained its financialguidance for the full 2019-20 year.",
    "* BOOHOO: British online fashion retailer Boohoo BOOH.L said it wastrading ahead of expectations and now expected its full-year revenue to risebetween 33% and 38%, ahead of its previous 25% to 30% guidance, which woulddeliver a corresponding rise in earnings.",
    "* BREXIT: British Prime Minister Boris Johnson's government abandonedattempts in the upper house of parliament to block a law aimed at stopping thecountry from leaving the European Union without a deal. urn:newsml:reuters.com:*:nL5N25W14U",
    "* BREXIT: The British parliament voted on Wednesday to prevent PrimeMinister Boris Johnson taking Britain out of the European Union without a dealon Oct. 31, but rejected his first bid to call a snap election two weeks beforethe scheduled exit. urn:newsml:reuters.com:*:nL5N25V2FD",
    "* HONG KONG: Hong Kong leader Carrie Lam on Wednesday withdrew anextradition bill that triggered months of often violent protests so theChinese-ruled city can move forward from a \"highly vulnerable and dangerous\"place and find solutions. urn:newsml:reuters.com:*:nL3N25V0NC",
    "* RYANAIR: RyanairRYA.I members of the British Airline Pilots Association(BALPA) announced a further seven days of strikes on Wednesday as their latestwalkout comes to an end, having caused little disruption for the low-costairline. urn:newsml:reuters.com:*:nL5N25V5LF",
    "* M&S, DIRECT LINE: Marks & SpencerMKS.L , Direct Line DLGD.L and MicroFocus MCRO.L will be relegated from London's FTSE 100 index from Sept. 23following the latest quarterly review and precious metals mining firm Polymetal POLYP.L , generic drugmaker Hikma HIK.L and aerospace and defence groupMeggitt MGGT.L will replace them, the index operator FTSE Russell said onWednesday. urn:newsml:reuters.com:*:nL5N25V5PM",
    "* CYBG: CYBGCYBGC.L said it expected to increase its provisions forlegacy costs to settle a final compensation bill for mis-selling paymentprotection insurance after a last-minute surge in customer claims by between 300million pounds and 450 million pounds. urn:newsml:reuters.com:*:nL5N25V0YV",
    "* SHELL: A U.S. judge on Wednesday rejected Exxon Mobil Corp'sXOM.N andRoyal Dutch Shell Plc'sRDSa.L effort to revive a $1.8 billion arbitrationaward against Nigeria's state-run oil company, which stemmed from a dispute overa 1993 contract to extract oil near the African country's coastline. urn:newsml:reuters.com:*:nL2N25V1T0",
    "* UK MANUFACTURING: British manufacturing is locked in a nosedive as ordersand investment dry up due to the global slowdown and the Brexit crisis, a surveyfrom trade body Make UK showed on Thursday, adding to signs of a worseningeconomic outlook. urn:newsml:reuters.com:*:nL3N25V3JN",
    "* BoE: A worst-case no-deal Brexit would inflict less severe damage onBritain's economy than previously thought because of preparations undertakensince the end of last year, Bank of England Governor Mark Carney said onWednesday. urn:newsml:reuters.com:*:nL5N25V4OG",
    "* UK SPEND: British finance minister Sajid Javid said he was \"turning thepage on austerity\" as he promised the biggest spending increases in 15 years, amove widely seen as part of Prime Minister Boris Johnson's push for an electionto break the Brexit impasse. urn:newsml:reuters.com:*:nL5N25V2Y9",
    "* COPPER: Shanghai copper jumped to a more than one-month high, while Londoncopper hit its highest in over two weeks after China and the United Statesagreed to hold trade talks. urn:newsml:reuters.com:*:nL3N25W0Y9",
    "* GOLD: Gold prices dropped as risk-on sentiment got a boost after China andthe United States agreed to hold talks to end their protracted trade dispute. urn:newsml:reuters.com:*:nL3N25W0XK",
    "* OIL: Oil prices eased on Thursday after a report showed U.S. crudeinventories rose against expectations, even as Washington and Beijing confirmedthey would hold ministerial level talks to try resolve a prolonged trade war. urn:newsml:reuters.com:*:nL3N25W0IL",
    "* EX-DIVS: Admiral GroupADML.L , Antofagasta PlcANTO.L , BHP GroupBHPB.L , CRH PlcCRH.I , Flutter EntertainmentFLTRE.I , Glencore PlcGLEN.L , Land SecuritiesLAND.L , Micro FocusMCRO.L and RSA Insurance GroupRSA.L will trade without entitlement to its latest dividend pay-out onThursday, trimming 11.6 points off the FTSE 100 according to Reuterscalculations. urn:newsml:reuters.com:*:nL5N25T2J0",
    "* Domestically focussed British stocks advanced on Wednesday afterparliament succeeded in taking steps toward averting a no-deal Brexit, whileAsia-facing banks gained on hopes that protests in Hong Kong would end, leadingthe FTSE 100 higher. The UK blue chip index closed 0.6% higher at 7,311.3. urn:newsml:reuters.com:*:nL3N25V1W1",
    "* For more on the factors affecting European stocks, please click on: LIVE/",
    "TODAY'S UK PAPERS",
    "> Financial TimesPRESS/FT",
    "> Other business headlines             PRESS/GB  (Reporting by Noor Zainab Hussain and Shanima A in Bengaluru) ((noor.hussain@thomsonreuters.com; Within UK +44 20 7542 1810; Outside UK +9180 6182 2663 or +91 80 3796 2663 ;))"
  ],
  "published_datetime": "2019-09-05 02:59:00"
}