{
  "url": "https://www.nasdaq.com/article/hurn-vs-fc-which-stock-should-value-investors-buy-now-cm1210425",
  "title": "HURN vs. FC: Which Stock Should Value Investors Buy Now? - Nasdaq.com",
  "text": [
    " Investors with an interest in Consulting Services stocks have likely encountered both Huron Consulting (HURN) and Franklin Covey (FC). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look. We have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits. Currently, Huron Consulting has a Zacks Rank of #2 (Buy), while Franklin Covey has a Zacks Rank of #3 (Hold). Investors should feel comfortable knowing that HURN likely has seen a stronger improvement to its earnings outlook than FC has recently. But this is just one piece of the puzzle for value investors. Value investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels. Our Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use. HURN currently has a forward P/E ratio of 24.42, while FC has a forward P/E of 81.18. We also note that HURN has a PEG ratio of 1.81. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. FC currently has a PEG ratio of 5. Another notable valuation metric for HURN is its P/B ratio of 2.46. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, FC has a P/B of 6.63. Based on these metrics and many more, HURN holds a Value grade of B, while FC has a Value grade of D. HURN is currently sporting an improving earnings outlook, which makes it stick out in our Zacks Rank model. And, based on the above valuation metrics, we feel that HURN is likely the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Huron Consulting Group Inc. (HURN): Free Stock Analysis Report   Franklin Covey Company (FC): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors with an interest in Consulting Services stocks have likely encountered both Huron Consulting (HURN) and Franklin Covey (FC). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.",
    "We have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits.",
    "Currently, Huron Consulting has a Zacks Rank of #2 (Buy), while Franklin Covey has a Zacks Rank of #3 (Hold). Investors should feel comfortable knowing that HURN likely has seen a stronger improvement to its earnings outlook than FC has recently. But this is just one piece of the puzzle for value investors.",
    "Value investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels.",
    "Our Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use.",
    "HURN currently has a forward P/E ratio of 24.42, while FC has a forward P/E of 81.18. We also note that HURN has a PEG ratio of 1.81. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. FC currently has a PEG ratio of 5.",
    "Another notable valuation metric for HURN is its P/B ratio of 2.46. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, FC has a P/B of 6.63.",
    "Based on these metrics and many more, HURN holds a Value grade of B, while FC has a Value grade of D.",
    "HURN is currently sporting an improving earnings outlook, which makes it stick out in our Zacks Rank model. And, based on the above valuation metrics, we feel that HURN is likely the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:40:22"
}