{
  "url": "https://www.nasdaq.com/article/is-funko-fnko-stock-outpacing-its-consumer-discretionary-peers-this-year-cm1207185",
  "title": "Is Funko (FNKO) Stock Outpacing Its Consumer Discretionary Peers This Year? - Nasdaq.com",
  "text": [
    " The Consumer Discretionary group has plenty of great stocks, but investors should always be looking for companies that are outperforming their peers. Is Funko (FNKO) one of those stocks right now? By taking a look at the stock's year-to-date performance in comparison to its Consumer Discretionary peers, we might be able to answer that question. Funko is a member of the Consumer Discretionary sector. This group includes 249 individual stocks and currently holds a Zacks Sector Rank of #11. The Zacks Sector Rank gauges the strength of our 16 individual sector groups by measuring the average Zacks Rank of the individual stocks within the groups. The Zacks Rank is a successful stock-picking model that emphasizes earnings estimates and estimate revisions. The system highlights a number of different stocks that could be poised to outperform the broader market over the next one to three months. FNKO is currently sporting a Zacks Rank of #1 (Strong Buy). The Zacks Consensus Estimate for FNKO's full-year earnings has moved 11.24% higher within the past quarter. This shows that analyst sentiment has improved and the company's earnings outlook is stronger. Based on the most recent data, FNKO has returned 77.72% so far this year. Meanwhile, the Consumer Discretionary sector has returned an average of 15.79% on a year-to-date basis. This means that Funko is performing better than its sector in terms of year-to-date returns. Breaking things down more, FNKO is a member of the Consumer Products - Discretionary industry, which includes 20 individual companies and currently sits at #110 in the Zacks Industry Rank. On average, stocks in this group have lost 7.55% this year, meaning that FNKO is performing better in terms of year-to-date returns. Investors in the Consumer Discretionary sector will want to keep a close eye on FNKO as it attempts to continue its solid performance.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Funko, Inc. (FNKO): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "The Consumer Discretionary group has plenty of great stocks, but investors should always be looking for companies that are outperforming their peers. Is Funko (FNKO) one of those stocks right now? By taking a look at the stock's year-to-date performance in comparison to its Consumer Discretionary peers, we might be able to answer that question.",
    "Funko is a member of the Consumer Discretionary sector. This group includes 249 individual stocks and currently holds a Zacks Sector Rank of #11. The Zacks Sector Rank gauges the strength of our 16 individual sector groups by measuring the average Zacks Rank of the individual stocks within the groups.",
    "The Zacks Rank is a successful stock-picking model that emphasizes earnings estimates and estimate revisions. The system highlights a number of different stocks that could be poised to outperform the broader market over the next one to three months. FNKO is currently sporting a Zacks Rank of #1 (Strong Buy).",
    "The Zacks Consensus Estimate for FNKO's full-year earnings has moved 11.24% higher within the past quarter. This shows that analyst sentiment has improved and the company's earnings outlook is stronger.",
    "Based on the most recent data, FNKO has returned 77.72% so far this year. Meanwhile, the Consumer Discretionary sector has returned an average of 15.79% on a year-to-date basis. This means that Funko is performing better than its sector in terms of year-to-date returns.",
    "Breaking things down more, FNKO is a member of the Consumer Products - Discretionary industry, which includes 20 individual companies and currently sits at #110 in the Zacks Industry Rank. On average, stocks in this group have lost 7.55% this year, meaning that FNKO is performing better in terms of year-to-date returns.",
    "Investors in the Consumer Discretionary sector will want to keep a close eye on FNKO as it attempts to continue its solid performance.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:10"
}