{
  "url": "https://www.nasdaq.com/article/acquisitive-alibaba-confronts-life-without-jack-ma-cm1210664",
  "title": "Acquisitive Alibaba Confronts Life Without Jack Ma - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "In the pantheon of U.S. companies, there have been instances where the CEO and/or founders are inextricably linked to those firms and, to some extent, the performance of the stocks. Think Warren Buffett at Berkshire Hathaway (NYSE: BKR-B ), the late Steve Jobs at Apple  (NASDAQ: AAPL ) or Jeff Bezos at Amazon  (NASDAQ: AMZN ).",
    "The best comparison offered by a Chinese company is Jack Ma of Alibaba Group (NYSE: BABA ). All Ma has done is build Alibaba into the largest e-commerce company in the world's largest internet market, while overseeing a double in Alibaba stock price since its initial public offering (IPO) roughly four years ago.",
    "Described by some as flamboyant, Ma departs the $460 billion behemoth he founded on Tuesday. He will be succeeded by softer spoken accountant Daniel Zhang. On the surface, the Ma-to-Zhange transition looks a little bit like the move to Tim Cook at Apple after Jobs passed away. Alibaba stock investors can only hope Zhang can deliver appreciation that is even in the ballpark of what Cook has delivered for Apple investors.",
    "Ma, China's richest man, has pledged to stay on in some capacity, likely mentoring management. They found hand-picked Zhang, so that could be an important factor for Alibaba stock owners.",
    "Zhang \"has the logic and critical thinking skills of a super computer, a commitment to his vision, the courage to wholeheartedly dare to take on innovative business models and industries of the future,\" said Ma when he made the announcement last year.",
    "Like Amazon in the U.S., Alibaba is an e-commerce juggernaut in China, but that status does not mean it's a true monopoly. As is the case with Amazon on domestic, Alibaba must contend with e-commerce competitors in China, including JD.com (NASDAQ: JD ) and Tencent (OTCMKTS: TCEHY ). To take the Amazon comparison even further, Alibaba's playbook is similar to its American rival in that the Chinese company has become a player in other businesses beyond online retail.",
    "In the case of Alibaba stock, catalysts include growth in the cloud computing and mobile payments arenas, among many others. To the point of spreading its week, Alibaba has recently been on a shopping spree of its own.",
    "In recent days, the company agreed to buy e-commerce business Kaola from Chinese gaming company NetEase for $2 billion. That deal is aimed at getting Alibaba in front of more luxury shoppers.",
    "\"Kaola, launched by NetEase in 2015, aggressively targets shoppers in China by offering products from top brands such as Gucci, Shisheido and Burberry, primarily sourcing goods directly from suppliers to resell to consumers,\" according toReuters.",
    "The deal also features an investment in Netease Cloud Music, which could be a catalyst down the road for Alibaba stock because it would better enable the company to compete in an arena dominated by rival Tencent.",
    "\"While TME's market position looks very strong, with more capital raised by Netease Cloud Music and possible future deeper collaboration with Alibaba's Xiami and its overall digital entertainment and SuperVIP membership program, we believe the joining force between Netease and Ali will likely strengthen Netease Cloud Music's competitive positioning against TME,\" said Citibank analyst Alicia Yap .",
    "Another catalyst for Alibaba stock is cash. At the end of the second quarter, the company had cash on hand of $33.72 billion , a year-over-year increase of almost 15%. That's a large enough stockpile to enable the company to do more acquisitions and probably some of size because with Alibaba stock commanding a market value of $460 billion, bolt-on deals are nice, but purchases of scale likely make the most sense.",
    "Additionally, Alibaba is likely to continue growing at a compound annual growth rate (CAGR) around 30%, implying the 20.34x forward earnings multiple Alibaba stock is attractive if not inexpensive. Plus, China's expanding e-commerce market, one that is helpful for competitors to Alibaba, benefits the entrenched giant, too.",
    "\"The growth in recent quarters from all platforms in the industry gives us the comfort that the growing (e-commerce) sector is probably the last to be impacted even in a prolonged period of macro turbulence,\" said Bernstein analyst Davi Dai .",
    "Todd Shriber does not own any of the aforementioned securities.",
    "The post Acquisitive Alibaba Confronts Life Without Jack Ma appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:58:25"
}