{
  "url": "https://www.nasdaq.com/article/5-internet-of-things-stocks-to-buy-now-cm1206989",
  "title": "5 Internet of Things Stocks to Buy Now - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "The internet of things has been a hot topic for years now, but with a 5G revolution right around the corner, connected devices are garnering more and more attention. Trade tension with China has made the market shaky, especially in the tech space. However, when it comes to picking stocks to buy in the technology sector, the internet of things is a great place to start.",
    "Here's a look at five stocks that offer exposure to the fast-growing internet of things market.",
    "If you're looking for internet of things stocks to buy, the first place to look is network providers. None of the connectivity needed would be possible without telecoms building and maintaining infrastructure to support it. If everything goes according to plan and T-Mobile (NASDAQ: TMUS ) and Sprint (NYSE: S ) merge, there are only three names to choose from on that list - T-Mobile, AT&T (NYSE: T ) and Verizon (NYSE: VZ ). A lot of people point to Verizon as the winner of the three, but the only telecom I'd be willing to bet on right now is T. ",
    "T stock is cheap because the firm is weighed down by a massive debt pile that it acquired beefing up its content library in preparation for a new streaming service. Not everyone believes in AT&T's path forward, which explains the firm's ultra-low valuation. However, I think T stock's future looks bright in the streaming space and its position in 5G means the company has a definite future growth catalyst. With a near 6% dividend yield and a forward price-to-earnings ratio of just 9.7, T stock is a cheap way to buy into the revolution.",
    "Another internet of things stock that can't be overlooked is Honeywell (NYSE: HON ), an American company responsible for a wide range of connected household devices. Honeywell not only makes everything from connected fire alarms to thermostats for consumers, but the firm also delivers a wide range of connected solutions at the enterprise level as well. ",
    "There's a lot to like about HON stock from its modest P/E of 18.4 to its respectable 2% dividend yield to the fact that it's been able to grow its earnings per share by 14% annually for the past three years. However, what I find most compelling about Honeywell is the fact that the firm is making big moves into the internet of things space in an unprecedented way. HON is pushing forward with connectivity as a service , a strategy that combines connected wearables with cloud-based applications in order to assist customers in creating more efficient organizations. ",
    "It would be irresponsible to talk about internet of things stocks to buy without mentioning at least one healthcare play. The healthcare space holds a lot of potential for growth when it comes to connected devices because data collection is such an important part of the industry. DexCom  (NASDAQ: DXCM ) makes glucose monitors for people living with diabetes. DXCM stock is up 43% so far this year, though it's been a bumpy ride for investors. In just two years, DXCM is up 128% as its devices gained notoriety and investors started to take notice. ",
    "Of course there is some risk buying into a stock that's been on a run up, but DexCom looks likely to keep climbing in the years ahead as it rolls out new devices at more affordable price points. DexCom is planning to roll out a new glucose monitor in late 2020 or early 2021 that will be smaller than the firm's G6 model. Its lower manufacturing costs mean it will be less expensive for consumers. Management is hoping that the new G7 model will help the firm break into other markets beyond glucose monitoring which would create an entirely new growth runway.",
    "Another industry that can't be overlooked when it comes to the internet of things is the semiconductor space. The chips that power connected devices and the networks themselves are an integral part of the overall future of the internet of things. However, choosing which semiconductor stocks to buy right now is a tricky business as the industry has been up against some pretty strong headwinds in recent months. ",
    "My pick here is Skyworks Solutions (NASDAQ: SWKS ), a Massachusetts-based semiconductor firm whose share price has been on a roller coaster ride for the past year. The government's ban on sales to Huawei has hurt SWKS stock significantly -  in the third quarter the firm saw its revenue fall 14% and EPS were down a whopping 47%. ",
    "However, the firm appears to be faring well in areas unaffected by the trade tension. The company is becoming a major player in the 5G space, and its connected chips can now be found in a variety of electronics including soundbars and smartwatches. The firm's tech is also included in Oculus headsets, Facebook's (NASDAQ: FB ) virtual reality arm.",
    "So, although you're taking on a lot of risk considering that the trade war with China looks unlikely to let up anytime soon, SWKS could offer a great deal of reward as well. Not only will its connected chips drive growth in the future, but the firm's comparisons in 2020 will be much easier after the dismal year it's had. That means investors who can stomach the risk could see a payoff in just a few months time.",
    "Payment processors will be another big beneficiary of a more connected world. As more and more devices make their way online, online payments will continue to rise. Part of the reason connected devices are gaining traction is that they reduce friction in people's lives. Cash has become friction for many people, leading developers to look for easier ways to allow people to pay for things without ever taking out their wallets. ",
    "The two largest credit card networks, Visa  (NYSE: V ) and Master Card (NYSE: MA ) will be able to continue building their networks as people continue to opt for cashless payments. Don't get me wrong, V stock is expensive - it trades at almost 29 times its future earnings, but that extra cost is worth it. Visa makes money every time someone uses their credit or debit cards, and with trillions of dollars changing hands in Visa's name each year, that translates into some pretty impressive revenue figures. ",
    "Guggenheim Securities analyst Jeff Cantwell said he also sees a lot of potential growth in Visa's business to business payments arm. Cantwell pointed out that V stock will benefit significantly as contactless payments spread and Visa pushes its way further into cross-border transactions, a $100 trillion market.",
    "As of this writing Laura Hoy was long FB and T.",
    "The post 5 Internet of Things Stocks to Buy Now appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 14:18:49"
}