{
  "url": "https://www.nasdaq.com/article/moving-average-crossover-alert-micro-focus-international-cm1210573",
  "title": "Moving Average Crossover Alert: Micro Focus International - Nasdaq.com",
  "text": [
    "  Micro Focus International plc MFGP  could be a stock to avoid from a technical perspective, as the firm is seeing unfavorable trends on the moving average crossover front. Recently, the 50 Day Moving Average for MFGP broke out below the 200 Day Simple Moving Average, suggesting short-term bearishness. This has already started to take place, as the stock has moved lower by 28.2% in the past four weeks. And with the recent moving average crossover, investors have to think that more unfavorable trading is ahead for MFGP stock. If that wasn't enough, MFGP isn't looking too great from an earnings estimate revision perspective either. It appears as though many analysts have been reducing their earnings expectations for the stock lately, which is usually not a good sign of things to come. Consider that in the last 30 days, 2 estimates have been reduced, while none has moved higher. Add this in to a similar move lower in the consensus estimate, and there is plenty of reason to be bearish here. That is why we currently have a Zacks Rank #4 (Sell) on this stock and are looking for it to underperform in the weeks ahead. So, either avoid this stock or consider jumping ship until the estimates and technical factors turn around for MFGP. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.      Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.     See the pot trades we're targeting>>         Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Micro Focus International PLC Sponsored ADR (MFGP): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Micro Focus International plc MFGP  could be a stock to avoid from a technical perspective, as the firm is seeing unfavorable trends on the moving average crossover front. Recently, the 50 Day Moving Average for MFGP broke out below the 200 Day Simple Moving Average, suggesting short-term bearishness.",
    "This has already started to take place, as the stock has moved lower by 28.2% in the past four weeks. And with the recent moving average crossover, investors have to think that more unfavorable trading is ahead for MFGP stock.",
    "If that wasn't enough, MFGP isn't looking too great from an earnings estimate revision perspective either. It appears as though many analysts have been reducing their earnings expectations for the stock lately, which is usually not a good sign of things to come.",
    "Consider that in the last 30 days, 2 estimates have been reduced, while none has moved higher. Add this in to a similar move lower in the consensus estimate, and there is plenty of reason to be bearish here.",
    "That is why we currently have a Zacks Rank #4 (Sell) on this stock and are looking for it to underperform in the weeks ahead. So, either avoid this stock or consider jumping ship until the estimates and technical factors turn around for MFGP. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.     ",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.  ",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:20:00"
}