{
  "url": "https://www.nasdaq.com/article/has-pepsico-pep-outpaced-other-consumer-staples-stocks-this-year-cm1207182",
  "title": "Has Pepsico (PEP) Outpaced Other Consumer Staples Stocks This Year? - Nasdaq.com",
  "text": [
    " Investors focused on the Consumer Staples space have likely heard of Pepsico (PEP), but is the stock performing well in comparison to the rest of its sector peers? One simple way to answer this question is to take a look at the year-to-date performance of PEP and the rest of the Consumer Staples group's stocks. Pepsico is a member of our Consumer Staples group, which includes 176 different companies and currently sits at #4 in the Zacks Sector Rank. The Zacks Sector Rank gauges the strength of our 16 individual sector groups by measuring the average Zacks Rank of the individual stocks within the groups. The Zacks Rank is a successful stock-picking model that emphasizes earnings estimates and estimate revisions. The system highlights a number of different stocks that could be poised to outperform the broader market over the next one to three months. PEP is currently sporting a Zacks Rank of #2 (Buy). Over the past three months, the Zacks Consensus Estimate for PEP's full-year earnings has moved 0.02% higher. This means that analyst sentiment is stronger and the stock's earnings outlook is improving. Based on the most recent data, PEP has returned 24.42% so far this year. At the same time, Consumer Staples stocks have gained an average of 19.67%. This shows that Pepsico is outperforming its peers so far this year. To break things down more, PEP belongs to the Beverages - Soft drinks industry, a group that includes 18 individual companies and currently sits at #151 in the Zacks Industry Rank. On average, this group has gained an average of 15.45% so far this year, meaning that PEP is performing better in terms of year-to-date returns. PEP will likely be looking to continue its solid performance, so investors interested in Consumer Staples stocks should continue to pay close attention to the company.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Pepsico, Inc. (PEP): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Investors focused on the Consumer Staples space have likely heard of Pepsico (PEP), but is the stock performing well in comparison to the rest of its sector peers? One simple way to answer this question is to take a look at the year-to-date performance of PEP and the rest of the Consumer Staples group's stocks.",
    "Pepsico is a member of our Consumer Staples group, which includes 176 different companies and currently sits at #4 in the Zacks Sector Rank. The Zacks Sector Rank gauges the strength of our 16 individual sector groups by measuring the average Zacks Rank of the individual stocks within the groups.",
    "The Zacks Rank is a successful stock-picking model that emphasizes earnings estimates and estimate revisions. The system highlights a number of different stocks that could be poised to outperform the broader market over the next one to three months. PEP is currently sporting a Zacks Rank of #2 (Buy).",
    "Over the past three months, the Zacks Consensus Estimate for PEP's full-year earnings has moved 0.02% higher. This means that analyst sentiment is stronger and the stock's earnings outlook is improving.",
    "Based on the most recent data, PEP has returned 24.42% so far this year. At the same time, Consumer Staples stocks have gained an average of 19.67%. This shows that Pepsico is outperforming its peers so far this year.",
    "To break things down more, PEP belongs to the Beverages - Soft drinks industry, a group that includes 18 individual companies and currently sits at #151 in the Zacks Industry Rank. On average, this group has gained an average of 15.45% so far this year, meaning that PEP is performing better in terms of year-to-date returns.",
    "PEP will likely be looking to continue its solid performance, so investors interested in Consumer Staples stocks should continue to pay close attention to the company.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:30:11"
}