{
  "url": "https://www.nasdaq.com/article/notable-wednesday-option-activity-amba-mo-tivo-cm1210681",
  "title": "Notable Wednesday Option Activity: AMBA, MO, TIVO - Nasdaq.com",
  "text": [
    "Looking at  options trading  activity among components of the Russell 3000 index, there is noteworthy activity today in Ambarella, Inc. (Symbol: AMBA), where a total volume of 4,690 contracts has been traded thus far today, a contract volume which is representative of approximately 469,000 underlying shares (given that every 1 contract represents 100 underlying shares). That number works out to 50.4% of AMBA's average daily trading volume over the past month, of 931,410 shares. Particularly high volume was seen for the $65 strike call option expiring September 20, 2019  , with 553 contracts trading so far today, representing approximately 55,300 underlying shares of AMBA. Below is a chart showing AMBA's trailing twelve month trading history, with the $65 strike highlighted in orange:       makeArticleAd();    Altria Group Inc (Symbol: MO) options are showing a volume of 60,279 contracts thus far today. That number of contracts represents approximately 6.0 million underlying shares, working out to a sizeable 49.5% of MO's average daily trading volume over the past month, of 12.2 million shares. Especially high volume was seen for the $43 strike put option expiring September 13, 2019  , with 9,676 contracts trading so far today, representing approximately 967,600 underlying shares of MO. Below is a chart showing MO's trailing twelve month trading history, with the $43 strike highlighted in orange:       And TiVo Corp (Symbol: TIVO) options are showing a volume of 3,328 contracts thus far today. That number of contracts represents approximately 332,800 underlying shares, working out to a sizeable 48.6% of TIVO's average daily trading volume over the past month, of 684,275 shares. Particularly high volume was seen for the $10 strike put option expiring October 18, 2019  , with 1,000 contracts trading so far today, representing approximately 100,000 underlying shares of TIVO. Below is a chart showing TIVO's trailing twelve month trading history, with the $10 strike highlighted in orange:         For the various different available expirations for AMBA options  , MO options  , or TIVO options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:26:40"
}