{
  "url": "https://www.nasdaq.com/article/validea-david-dreman-strategy-daily-upgrade-report-9122019-cm1210837",
  "title": "Validea David Dreman Strategy Daily Upgrade Report - 9/12/2019 - Nasdaq.com",
  "text": [
    "The following are today's upgrades for Validea's Contrarian Investor  model based on the published strategy of David Dreman  . This contrarian strategy finds the most unpopular mid- and large-cap stocks in the market and looks for improving fundamentals.",
    " CVR ENERGY, INC. ( CVI  )  is a mid-cap value stock in the Oil & Gas Operations industry. The rating according to our strategy based on David Dreman changed from 86% to 99% based on the firm's underlying fundamentals and the stock's valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.",
    " Company Description:  CVR Energy, Inc. (CVR Energy) is a holding company. The Company is engaged in the petroleum refining and nitrogen fertilizer manufacturing through its holdings in CVR Refining LP (CVR Refining or the Refining Partnership) and CVR Partners LP (CVR Partners or the Nitrogen Fertilizer Partnership). It operates under two business segments: petroleum (the petroleum and related businesses operated by the Refining Partnership) and nitrogen fertilizer (the nitrogen fertilizer business operated by the Nitrogen Fertilizer Partnership). The Company's Refining Partnership is an independent petroleum refiner and marketer of transportation fuels. Its Nitrogen Fertilizer Partnership produces and markets nitrogen fertilizers in the form of urea and ammonium nitrate ( UAN  ) and ammonia. The petroleum business consists of a coking medium-sour crude oil refinery in Coffeyville, Kansas and a crude oil refinery in Wynnewood, Oklahoma.",
    "The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.",
    "For a full detailed analysis using NASDAQ's Guru Analysis tool, click here ",
    "Since its inception, Validea's strategy based on David Dreman has returned 122.43% vs. 201.88% for the S&P 500. For more details on this strategy, click here ",
    " About David Dreman  : Dreman's Kemper-Dreman High Return Fund was one of the best-performing mutual funds ever, ranking as the best of 255 funds in its peer groups from 1988 to 1998, according to Lipper Analytical Services. At the time Dreman published Contrarian Investment Strategies: The Next Generation, the fund had been ranked number one in more time periods than any of the 3,175 funds in Lipper's database. In addition to managing money, Dreman is also a longtime Forbes magazine columnist.",
    " About Validea  : Validea is an  investment research  service that follows the published strategies of investment legends. Validea offers both stock analysis and model portfolios based on gurus who have outperformed the market over the long-term, including Warren Buffett, Benjamin Graham, Peter Lynch and Martin Zweig. For more information about Validea, click here ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-12 03:50:30"
}