{
  "url": "https://www.nasdaq.com/article/noteworthy-wednesday-option-activity-lad-nem-abbv-cm1210678",
  "title": "Noteworthy Wednesday Option Activity: LAD, NEM, ABBV - Nasdaq.com",
  "text": [
    "Looking at  options trading  activity among components of the Russell 3000 index, there is noteworthy activity today in Lithia Motors Inc (Symbol: LAD), where a total volume of 782 contracts has been traded thus far today, a contract volume which is representative of approximately 78,200 underlying shares (given that every 1 contract represents 100 underlying shares). That number works out to 41.9% of LAD's average daily trading volume over the past month, of 186,690 shares. Particularly high volume was seen for the $130 strike put option expiring September 20, 2019  , with 520 contracts trading so far today, representing approximately 52,000 underlying shares of LAD. Below is a chart showing LAD's trailing twelve month trading history, with the $130 strike highlighted in orange:       makeArticleAd();    Newmont Goldcorp Corp (Symbol: NEM) saw options trading volume of 31,108 contracts, representing approximately 3.1 million underlying shares or approximately 41.5% of NEM's average daily trading volume over the past month, of 7.5 million shares. Especially high volume was seen for the $32.12 strike call option expiring September 20, 2019  , with 12,000 contracts trading so far today, representing approximately 1.2 million underlying shares of NEM. Below is a chart showing NEM's trailing twelve month trading history, with the $32.12 strike highlighted in orange:       And AbbVie Inc (Symbol: ABBV) options are showing a volume of 33,328 contracts thus far today. That number of contracts represents approximately 3.3 million underlying shares, working out to a sizeable 40.7% of ABBV's average daily trading volume over the past month, of 8.2 million shares. Especially high volume was seen for the $70 strike call option expiring October 18, 2019  , with 2,803 contracts trading so far today, representing approximately 280,300 underlying shares of ABBV. Below is a chart showing ABBV's trailing twelve month trading history, with the $70 strike highlighted in orange:         For the various different available expirations for LAD options  , NEM options  , or ABBV options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 03:26:42"
}