{
  "url": "https://www.nasdaq.com/article/thyssenkrupp-to-leave-germanys-blue-chip-index-dax-mtu-aero-joins-20190905-00148",
  "title": "Thyssenkrupp to leave Germany's blue chip index DAX, MTU Aero joins - Nasdaq.com",
  "text": [
    "By Christoph Steitz and Tom Käckenhoff",
    "FRANKFURT, Sept 5 (Reuters) - Thyssenkrupp AG  will drop out of Germany's benchmark stock index this month, the stock market operator said, the latest setback for the ailing conglomerate's turnaround efforts.",
    "Thyssenkrupp will leave the DAX  on Sept. 23 and will be replaced by aircraft engine maker MTU Aero Engines AG , making it the second founding member to exit the 30-member index in the past 12 months.",
    "\"It's the decline of an industry icon,\" said Thomas Hechtfischer of shareholder advisory group DSW.",
    "The decision by stock market operator Deutsche Boerse  adds to the long list of problems at Thyssenkrupp, which last month was downgraded by ratings agencies S&P and Moody's in light of a cooling global economy.",
    "\"But they continue to be very confident that we can refinance in the bond and credit market and that of course depends on the rating and not on our index membership,\" Finance Chief Johannes Dietsch said in a podcast obtained by Reuters.",
    "For Chief Executive Guido Kerkhoff, exclusion from the DAX means another defeat in his efforts to overhaul the sprawling group by selling all or part of its prized elevators unit. ",
    "\"What's important is that we're now setting up the group in a new and more profitable way in order to win back investor trust,\" he said in a statement.",
    "SIGN OF THE TIMES",
    "The index departure means exchange-traded funds (ETFs) tracking the DAX will have to sell the stock. It will also no longer be an investment option for actively managed mutual funds which are restricted to blue chips as defined by the DAX.",
    "Thyssen, which merged with Krupp two decades ago, has been a member of the DAX since its inception in 1988. Last year, founding member Commerzbank  dropped out and was replaced by payments company Wirecard .",
    "\"The DAX should reflect Germany's industry. The most recent changes are a sign of the times. Thyssenkrupp's drop into the MDAX could change its investor base,\" said Tobias Adler, index analyst at Oddo Seydler.",
    "But he said that was not necessarily a bad thing as smaller indices have outperformed the DAX in recent years. The MDAX has gained about a quarter since January 2016, compared with a 12% rise of the DAX. The smallcap SDAX index  is up 19%.",
    "Shares in Thyssenkrupp were up 2.8%, the second biggest gainers among German blue chips.",
    "Kerkhoff said last month that being a member of a specific index was far less important than tasks that include finding new ownership structures for its other businesses such as car parts and plant engineering.",
    "That was echoed by Thyssenkrupp's largest shareholder, the Alfried Krupp von Bohlen und Halbach foundation, which holds a 21% stake: \"It is the wellbeing of the company that counts for the foundation, not which index it is listed in.\""
  ],
  "published_datetime": "2019-09-05 05:01:00"
}