{
  "url": "https://www.nasdaq.com/article/moving-average-crossover-alert-anixter-international-cm1210570",
  "title": "Moving Average Crossover Alert: Anixter International - Nasdaq.com",
  "text": [
    "  Anixter International Inc. AXE  is looking like an interesting pick from a technical perspective, as the company is seeing favorable trends on the moving average crossover front. Recently, the 50 Day Moving Average for AXE broke out above the 200 Day Simple Moving Average, suggesting a short-term bullish trend. This has already started to take place, as the stock has moved higher by 13.1% in the past four weeks. Plus, the company currently has a Zacks Rank #1 (Strong Buy) suggesting that now could definitely be the time for this breakout candidate. More bullishness may especially be the case when investors consider what has been happening for AXE on the earnings estimate revision front lately. No estimate has gone lower in the past two months, compared to 1 higher, while the consensus estimate has also moved higher too. So given this move in estimates, and the positive technical factors, investors may want to watch this breakout candidate closely for more gains in the near future. You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.      Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.     See the pot trades we're targeting>>       Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Anixter International Inc. (AXE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Anixter International Inc. AXE  is looking like an interesting pick from a technical perspective, as the company is seeing favorable trends on the moving average crossover front. Recently, the 50 Day Moving Average for AXE broke out above the 200 Day Simple Moving Average, suggesting a short-term bullish trend.",
    "This has already started to take place, as the stock has moved higher by 13.1% in the past four weeks. Plus, the company currently has a Zacks Rank #1 (Strong Buy) suggesting that now could definitely be the time for this breakout candidate.",
    "More bullishness may especially be the case when investors consider what has been happening for AXE on the earnings estimate revision front lately. No estimate has gone lower in the past two months, compared to 1 higher, while the consensus estimate has also moved higher too.",
    "So given this move in estimates, and the positive technical factors, investors may want to watch this breakout candidate closely for more gains in the near future. You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.     ",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.  ",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:21:00"
}