{
  "url": "https://www.nasdaq.com/article/conmed-corporation-cnmd-ex-dividend-date-scheduled-for-september-12-2019-cm1210288",
  "title": "CONMED Corporation (CNMD) Ex-Dividend Date Scheduled for September 12, 2019 - Nasdaq.com",
  "text": [
    "CONMED Corporation ( CNMD  ) will begin trading ex-dividend on September 12, 2019. A cash dividend payment of $0.2 per share is scheduled to be paid on October 07, 2019. Shareholders who purchased CNMD prior to the ex-dividend date are eligible for the cash dividend payment. This marks the 24th quarter that CNMD has paid the same dividend. At the current stock price of $98.02, the dividend yield is .82%.",
    "The previous trading day's last sale of CNMD was $98.02, representing a -4.43% decrease from the 52 week high of $102.56 and a 72.25% increase over the 52 week low of $56.91.",
    "CNMD is a part of the Health Care sector, which includes companies such as Medtronic plc ( MDT  ) and Varian Medical Systems, Inc. ( VAR  ). CNMD's current earnings per share, an indicator of a company's profitability, is $.97. Zacks Investment Research reports CNMD's forecasted earnings growth in 2019 as 16.86%, compared to an industry average of %.",
    "For more information on the declaration, record and payment dates, visit the CNMD Dividend History  page. Our  Dividend Calendar  has the full list of stocks that have an ex-dividend today.",
    " Interested in gaining exposure to CNMD through an Exchange Traded Fund [ETF]?   The following ETF(s) have CNMD as a top-10 holding:  Invesco S&P SmallCap Health Care ETF (   PSCH    ) First Trust Small Cap US Equity Select ETF (   RNSC    ) SPDR S&P Health Care Equipment (   XHE    ) Invesco S&P Smallcap 600 Pure Growth ETF (   RZG    ).  ",
    "The top-performing ETF of this group is PSCH with an increase of 6.71% over the last 100 days. It also has the highest percent weighting of CNMD at 2.83%.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:00:05"
}