{
  "url": "https://www.nasdaq.com/article/forexdollar-flat-as-poor-us-factory-data-offset-trade-brexit-worries-20190903-01024",
  "title": "FOREX-Dollar flat as poor U.S. factory data offset trade, Brexit worries - Nasdaq.com",
  "text": [
    "    * Pound recovers after dropping below $1.20 on Brexitjitters",
    "* Dollar index hits highest level since May 2017",
    "* U.S. factory sector contracts for first time since 2016-ISM",
    "* U.S. Treasury yields fall toward recent mid-2016 low",
    "* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh (Updates market action; adds quote, graphic)",
    "By Richard Leong",
    "NEW YORK, Sept 3 (Reuters) - The dollar was little changedon Tuesday against a basket of currencies, underpinned bysafe-haven demand on worries about U.S.-China trade tensions anda chaotic British exit from the European Union.",
    "Initial strength that propelled the dollar to a more thantwo-year peak faded following a private report that showed theU.S. manufacturing sector in August recorded its first monthlycontraction since 2016. urn:newsml:reuters.com:*:nL2N25R073",
    "\"That's a reflection on what has been going on on the tradefront,\" said Don Ellenberger, head of multi-sector strategies atFederated Investors in Pittsburgh.",
    "The steeper-than-expected decline in the factory activityindex of the Institute for Supply Management touched off a rallyin the U.S. bond market, sending benchmark 10-year yields US10YT=RR to their lowest levels since July 2016. urn:newsml:reuters.com:*:nL2N25U0O6",
    "Bloomberg News reported that Chinese and U.S. officials werestruggling to agree on a schedule for a round of tradenegotiations that had been expected this month.",
    "UK Prime Minister Boris Johnson lost his working majority inParliament when one of his Conservative lawmakers defected tothe pro-European Union Liberal Democrats. urn:newsml:reuters.com:*:nL9N25G000",
    "In late U.S. trading, the dollar index .DXY , which tracksthe greenback against versus six major currencies, was up 0.05%at 98.964. Earlier, it hit 99.37, its highest level since May2017.",
    "The euro stabilized after tumbling to a 28-month low againstthe dollar earlier Tuesday as investors priced in deepernegative interest rates for longer in the euro zone.",
    "Money markets have increased to more than 80% theprobability that the European Central Bank will cut itsbenchmark rate by 20 basis points when it meets next week. ",
    "The ECB benchmark rate now stands at minus 0.40% and the ECBhas all but promised a monetary policy stimulus package aseconomic growth falters. Monday's PMI survey showed Europeanmanufacturing contracted for seven straightmonths. urn:newsml:reuters.com:*:nL5N25Q2T8urn:newsml:reuters.com:*:nL5N25Q32W",
    "The euro EUR=EBS was little changed at  $1.0966, afterhitting $1.0926 earlier, its lowest level since mid-May 2017. Abreak below the key $1.1000 level last week had sparked heaviersell-offs.",
    "The dollar weakened against the yen JPY=EBS and the Swissfranc CHF=EBS in the aftermath of the disappointing ISMmanufacturing data. The greenback fell 0.2% to 106.045 yen anddecreased 0.3% to 0.98745 franc.",
    "Sterling was last up 0.22% at $1.209GBP=D3 after fallingto $1.1959, the lowest level since October 2016, when it plungedto $1.1491 in a flash crash. Against the euro, sterling rose to 90.7 pence, rebounding from a two-week low of 91.47 penceEURGBP=D3 .  ========================================================",
    "Currency bid prices at 2:54PM (1854 GMT) Description     RIC        Last          U.S.       Pct Change    YTD Pct    High Bid   Low Bid",
    "                                      Close                     Change               ",
    "                                       Previous                                      ",
    "                                       Session                                        Euro/Dollar     EUR=       $1.0966$1.0966    +0.00%        -4.39%     +1.0978    +1.0927 Dollar/Yen      JPY=       106.0300      106.2100   -0.17%        -3.84%     +106.3800  +105.7500 Euro/Yen        EURJPY=    116.26        116.49     -0.20%        -7.89%     +116.5600  +115.8800 Dollar/Swiss    CHF=       0.9873        0.9905     -0.32%        +0.60%     +0.9928    +0.9864 Sterling/Dolla  GBP=       1.2090        1.2066     +0.20%        -5.23%     +1.2105    +1.1959 r                                                                                        Dollar/Canadia  CAD=       1.3319        1.3325     -0.05%        -2.33%     +1.3382    +1.3323 n                                                                                        Australian/Dol  AUD=       0.6757        0.6713     +0.66%        -4.14%     +0.6763    +0.6688 lar                                                                                      Euro/Swiss      EURCHF=    1.0828        1.0866     -0.35%        -3.79%     +1.0869    +1.0821 Euro/Sterling   EURGBP=    0.9070        0.9091     -0.23%        +0.96%     +0.9148    +0.9052 NZ              NZD=       0.6325        0.6306     +0.30%        -5.84%     +0.6328    +0.6270 Dollar/Dollar                                                                            Dollar/Norway   NOK=       9.1055        9.1003     +0.06%        +5.40%     +9.1632    +9.0986 Euro/Norway     EURNOK=    9.9850        9.9832     +0.02%        +0.80%     +10.0213   +9.9790 Dollar/Sweden   SEK=       9.8281        9.8274     -0.03%        +9.64%     +9.8934    +9.8206 Euro/Sweden     EURSEK=    10.7771       10.7799    -0.03%        +5.00%     +10.8225   +10.7709 ",
    "\n<^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\nGRAPHIC-ISM U.S. factory index vs dollar index   https://tmsnrt.rs/2zK0ZwJ\nGRAPHIC-Euro lowest since May 2017   https://tmsnrt.rs/2zMVY6w\n    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^> (Reporting by Richard Leong;Additional reporting by Olga Cotaga in LondonEditing by Lisa Shumaker and Leslie Adler) ((richard.leong@thomsonreuters.com; +1 646 223 6313; ReutersMessaging: richard.leong.thomsonreuters.com@thomsonreuters.net;Twitter @RichardLeong2))"
  ],
  "published_datetime": "2019-09-03 15:09:00"
}