{
  "url": "https://www.nasdaq.com/article/is-vanguard-equity-income-admiral-veirx-a-strong-mutual-fund-pick-right-now-cm1207721",
  "title": "Is Vanguard Equity Income Admiral (VEIRX) a Strong Mutual Fund Pick Right Now? - Nasdaq.com",
  "text": [
    "Large Cap Value fund seekers should consider taking a look at Vanguard Equity Income Admiral (VEIRX). VEIRX carries a Zacks Mutual Fund Rank of 1 (Strong Buy), which is based on nine forecasting factors like size, cost, and past performance.",
    "Objective",
    "VEIRX is classified in the Large Cap Value segment by Zacks, which is an area full of possibilities. Investors interested in a stable income stream fund these mutual funds very appealing because they have a unique investing strategy. Large Cap Value funds invest in stocks with a market capitalization of $10 billion or more, but whose share prices do not reflect their intrinsic value. This tactic often leads to low P/E ratios and high dividend yields; however, these funds'high growth opportunity are often slowed, as large-cap securities are generally in stable industries with low to moderate growth prospects.",
    "History of Fund/Manager",
    "Vanguard Group is based in Malvern, PA, and is the manager of VEIRX. Vanguard Equity Income Admiral made its debut in August of 2001, and since then, VEIRX has accumulated about $30.31 billion in assets, per the most up-to-date date available. The fund's current manager is a team of investment professionals.",
    "Performance",
    "Investors naturally seek funds with strong performance. This fund has delivered a 5-year annualized total return of 9.66%, and is in the top third among its category peers. If you're interested in shorter time frames, do not dismiss looking at the fund's 3-year annualized total return of 10.4%, which places it in the top third during this time-frame.",
    "When looking at a fund's performance, it is also important to note the standard deviation of the returns. The lower the standard deviation, the less volatility the fund experiences. Compared to the category average of 10.57%, the standard deviation of VEIRX over the past three years is 10.84%. The standard deviation of the fund over the past 5 years is 10.77% compared to the category average of 10.65%. This makes the fund more volatile than its peers over the past half-decade.",
    "Risk Factors",
    "Investors should always remember the downsides to a potential investment, and this segment carries some risks one should be aware of. VEIRX lost 48.77% in the most recent bear market and outperformed its peer group by 2%. This means that the fund could possibly be a better choice than its peers during a down market environment.",
    "Investors should note that the fund has a 5-year beta of 0.87, so it is likely going to be less volatile than the market at large. Another factor to consider is alpha, as it reflects a portfolio's performance on a risk-adjusted basis relative to a benchmark-in this case, the S&P 500. With a negative alpha of -0.27, managers in this portfolio find it difficult to pick securities that generate better-than-benchmark returns.",
    "Holdings",
    "Examining the equity holdings of a mutual fund is also a valuable exercise. This can show us how the manager is applying their stated methodology, as well as if there are any inherent biases in their approach. For this particular fund, the focus is primarily on equities that are traded in the United States.",
    "This fund is currently holding about 75.74% stock in stocks, which have an average market capitalization of $140.90 billion. The fund has the heaviest exposure to the following market sectors:",
    "Expenses",
    "Costs are increasingly important for mutual fund investing, and particularly as competition heats up in this market. And all things being equal, a lower cost product will outperform its otherwise identical counterpart, so taking a closer look at these metrics is key for investors. In terms of fees, VEIRX is a no load fund. It has an expense ratio of 0.18% compared to the category average of 0.99%. VEIRX is actually cheaper than its peers when you consider factors like cost.",
    "This fund requires a minimum initial investment of $50,000, and each subsequent investment should be at least $1.",
    "Bottom Line",
    "Overall, Vanguard Equity Income Admiral ( VEIRX ) has a high Zacks Mutual Fund rank, and in conjunction with its comparatively strong performance, average downside risk, and lower fees, this fund looks like a good potential choice for investors right now.",
    "This could just be the start of your research on VEIRXin the Large Cap Value category. Consider going to www.zacks.com/funds/mutual-funds for additional information about this fund, and all the others that we rank as well for additional information. Want to learn even more? We have a full suite of tools on stocks that you can use to find the best choices for your portfolio too, no matter what kind of investor you are.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 07:00:06"
}