{
  "url": "https://www.nasdaq.com/article/reasons-to-hold-xerox-xrx-stock-in-your-portfolio-now-cm1210338",
  "title": "Reasons to Hold Xerox (XRX) Stock in Your Portfolio Now - Nasdaq.com",
  "text": [
    "  Xerox  's XRX  shares have gained a massive 58.4% year to date, significantly outperforming the 38.7% rally of the industry  it belongs to. We believe investors should hold on to the stock as Xerox has an aggressive transformation program in place aimed at improving productivity and operational efficiency, and reducing costs. This could make Xerox an attractive long-term play.     Aggressive Product Strategy to Revive Sales  Xerox's top line has been declining over the years due to decreased demand for paper-related systems and products. As a counter strategy, the company has placed an aggressive product development program for new high growth markets. It aims to introduce print and software technologies in non-traditional markets such as 3-D printing, printing on packaging, printing internet of things sensors and AI workplace assistance. This could take time to generate desirable results but will create strong niche for the company once successful. In a recent extension of partnership with HP HPQ  , Xerox now sources entry level machines from the company and supplies toners to it. Xerox now sells HP PCs, displays and accessories to its commercial customers. Further, HP has made Xerox's cloud-based content management platform DocuShare Flex available on its commercial PCs distributed in the United States. Xerox's partnership with American Express AXP  is serving the small business market better than before. With all these, Xerox expects 6% decline in revenues in 2019 followed by 3% decline in 2020 and flat revenues in 2021 on a constant-currency basis.  Bottom Line Thrives  The company's EPS and cash flow positions are in good shape driven mainly by cost cutting. For 2019, management maintained EPS guidance of $3.80 to $3.95, which indicates year-over-year increase of around 12% at mid-point. Free cash flow is expected to be between $1 billion and $1.1 billion.  Xerox Corporation EPS Diluted (TTM)           Xerox Corporation eps-diluted-ttm    |   Xerox Corporation Quote     Xerox is undertaking a number of transformation efforts including \"Project Own It\" to increase productivity and operational efficiency, reduce costs and realign business to changing market conditions. The recently completed reorganization under a new holding company should help it attain greater strategic, operational and financial flexibility.  Zacks Rank and Stocks to Consider  Xerox currently carries a Zacks Rank #3 (Hold). A better-ranked stock from the broader Zacks  Business Services   sector is Fiserv FISV  , with a Zacks Rank #1 (Strong Buy) and long-term expected EPS growth rate of 12%. You can see   the complete list of today's Zacks #1 Rank stocks   here   .  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana. Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  HP Inc. (HPQ): Free Stock Analysis Report   American Express Company (AXP): Free Stock Analysis Report   Xerox Corporation (XRX): Free Stock Analysis Report   Fiserv, Inc. (FISV): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Xerox  's XRX  shares have gained a massive 58.4% year to date, significantly outperforming the 38.7% rally of the industry  it belongs to.",
    "We believe investors should hold on to the stock as Xerox has an aggressive transformation program in place aimed at improving productivity and operational efficiency, and reducing costs. This could make Xerox an attractive long-term play.",
    " Aggressive Product Strategy to Revive Sales ",
    "Xerox's top line has been declining over the years due to decreased demand for paper-related systems and products. As a counter strategy, the company has placed an aggressive product development program for new high growth markets. It aims to introduce print and software technologies in non-traditional markets such as 3-D printing, printing on packaging, printing internet of things sensors and AI workplace assistance. This could take time to generate desirable results but will create strong niche for the company once successful.",
    "In a recent extension of partnership with HP HPQ  , Xerox now sources entry level machines from the company and supplies toners to it. Xerox now sells HP PCs, displays and accessories to its commercial customers. Further, HP has made Xerox's cloud-based content management platform DocuShare Flex available on its commercial PCs distributed in the United States. Xerox's partnership with American Express AXP  is serving the small business market better than before.",
    "With all these, Xerox expects 6% decline in revenues in 2019 followed by 3% decline in 2020 and flat revenues in 2021 on a constant-currency basis.",
    " Bottom Line Thrives ",
    "The company's EPS and cash flow positions are in good shape driven mainly by cost cutting. For 2019, management maintained EPS guidance of $3.80 to $3.95, which indicates year-over-year increase of around 12% at mid-point. Free cash flow is expected to be between $1 billion and $1.1 billion.",
    " Xerox Corporation EPS Diluted (TTM) ",
    "       Xerox Corporation eps-diluted-ttm    |   Xerox Corporation Quote  ",
    " Xerox Corporation eps-diluted-ttm    |   Xerox Corporation Quote ",
    "Xerox is undertaking a number of transformation efforts including \"Project Own It\" to increase productivity and operational efficiency, reduce costs and realign business to changing market conditions. The recently completed reorganization under a new holding company should help it attain greater strategic, operational and financial flexibility.",
    " Zacks Rank and Stocks to Consider ",
    "Xerox currently carries a Zacks Rank #3 (Hold). A better-ranked stock from the broader Zacks  Business Services   sector is Fiserv FISV  , with a Zacks Rank #1 (Strong Buy) and long-term expected EPS growth rate of 12%. You can see   the complete list of today's Zacks #1 Rank stocks   here   .",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 08:06:00"
}