{
  "url": "https://www.nasdaq.com/article/lockheed-martin-wins-41m-deal-to-support-apache-helicopter-cm1210602",
  "title": "Lockheed Martin Wins $41M Deal to Support Apache Helicopter - Nasdaq.com",
  "text": [
    "  Lockheed Martin Corp. LMT  recently secured a $40.6 million contract to supply Modernized Turret kits for the Apache attack helicopter. The deal was awarded by the U.S. Army Contracting Command, Rock Island Arsenal, IL. Work related to this contract is expected to be completed by Feb 28, 2023.  A Brief Note on Modernized Turret  Lockheed Martin's Modernized Turret (M-TUR) replaces the legacy Target Acquisition Designation Sight (TADS) system turret assembly that interfaces with Boeing's BA  Apache AH-64E aircraft and houses the M-TADS/PNVS sensors. M-TUR increases operational availability and boosts system performance for pilots. The new design incorporates reliability and maintainability improvements for significant life cycle cost savings. The turret provides reliability and maintainability improvements, resulting in operation and support cost savings of more than $500 million over the life of the Apache.  What Favors Lockheed Martin?  Over the last couple of years, the U.S. Aerospace and Defense space has been witnessing a solid growth, courtesy of President Trump's decision to discard his predecessor's budget sequestration policy. This, in turn, ushered in a golden era for prominent defense contractors like Lockheed Martin, which have been witnessing a decent uptick in order growth for their valued military equipment, ever since. Meanwhile, thanks to growing geopolitical tensions across the globe, the United States has significantly enhanced its surveillance, and the combat-proven helicopters play a crucial role in it. While demand for such military helicopters is rising, so is the need for modernizing them. This must be the rationale behind the latest contract win by Lockheed Martin.   Per a report by MarketWatch, the global military helicopter market is expected to witness a CAGR of 8.4% from 2018 to 2023. This uptick can be attributed to the need for replacing aging fleets and enhancement of capabilities pertaining to disaster relief operations. Such growth prospects can be expected to usher in more helicopter modernization contracts like the latest one for Lockheed Martin.  Price Movement  In a year's time, shares of Lockheed Martin have gained 18.3% compared with the industry  's 7.5% rise.       Zacks Rank & Key Picks      Lockheed Martin currently carries a Zacks Rank #3 (Hold). A few better-ranked stocks in the same space are L3Harris Technology Inc LHX  and Wesco Aircraft Holdings, Inc. WAIR  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   . L3Harris' long-term growth estimates currently stand at 8%. The company delivered average positive earnings surprise of 4.21% in the last four quarters. Wesco Aircraft's long-term growth estimates currently stand at 12%. The Zacks Consensus Estimate for 2019 earnings has moved 1.2% up to 85 cents over the past 60 days.  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.       Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.      See the pot trades we're targeting>>    makeArticleAd();  Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   The Boeing Company (BA): Free Stock Analysis Report   Lockheed Martin Corporation (LMT): Free Stock Analysis Report   Wesco Aircraft Holdings, Inc. (WAIR): Free Stock Analysis Report   L3Harris Technologies Inc (LHX): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Lockheed Martin Corp. LMT  recently secured a $40.6 million contract to supply Modernized Turret kits for the Apache attack helicopter. The deal was awarded by the U.S. Army Contracting Command, Rock Island Arsenal, IL.",
    "Work related to this contract is expected to be completed by Feb 28, 2023.",
    " A Brief Note on Modernized Turret ",
    "Lockheed Martin's Modernized Turret (M-TUR) replaces the legacy Target Acquisition Designation Sight (TADS) system turret assembly that interfaces with Boeing's BA  Apache AH-64E aircraft and houses the M-TADS/PNVS sensors.",
    "M-TUR increases operational availability and boosts system performance for pilots. The new design incorporates reliability and maintainability improvements for significant life cycle cost savings.",
    "The turret provides reliability and maintainability improvements, resulting in operation and support cost savings of more than $500 million over the life of the Apache.",
    " What Favors Lockheed Martin? ",
    "Over the last couple of years, the U.S. Aerospace and Defense space has been witnessing a solid growth, courtesy of President Trump's decision to discard his predecessor's budget sequestration policy. This, in turn, ushered in a golden era for prominent defense contractors like Lockheed Martin, which have been witnessing a decent uptick in order growth for their valued military equipment, ever since.",
    "Meanwhile, thanks to growing geopolitical tensions across the globe, the United States has significantly enhanced its surveillance, and the combat-proven helicopters play a crucial role in it. While demand for such military helicopters is rising, so is the need for modernizing them. This must be the rationale behind the latest contract win by Lockheed Martin.  ",
    "Per a report by MarketWatch, the global military helicopter market is expected to witness a CAGR of 8.4% from 2018 to 2023. This uptick can be attributed to the need for replacing aging fleets and enhancement of capabilities pertaining to disaster relief operations. Such growth prospects can be expected to usher in more helicopter modernization contracts like the latest one for Lockheed Martin.",
    " Price Movement ",
    "In a year's time, shares of Lockheed Martin have gained 18.3% compared with the industry  's 7.5% rise.",
    " Zacks Rank & Key Picks     ",
    "Lockheed Martin currently carries a Zacks Rank #3 (Hold). A few better-ranked stocks in the same space are L3Harris Technology Inc LHX  and Wesco Aircraft Holdings, Inc. WAIR  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    "L3Harris' long-term growth estimates currently stand at 8%. The company delivered average positive earnings surprise of 4.21% in the last four quarters.",
    "Wesco Aircraft's long-term growth estimates currently stand at 12%. The Zacks Consensus Estimate for 2019 earnings has moved 1.2% up to 85 cents over the past 60 days.",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.      ",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   ",
    "  See the pot trades we're targeting>>   ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:32:00"
}