{
  "url": "https://www.nasdaq.com/article/us-stockswhat-trade-fears-wall-street-is-back-in-rally-mode-20190905-00928",
  "title": "US STOCKS-What trade fears? Wall Street is back in rally mode - Nasdaq.com",
  "text": [
    " (For a live blog on the U.S. stock market, click LIVE/ ortype LIVE/ in a news window.)",
    "* U.S., China to hold high-level talks in October",
    "* Technology stocks boost; defensive sectors fall",
    "* U.S. services sector growth rises; private jobs jump",
    "* Indexes: Dow +1.52%, S&P 500 +1.33%, Nasdaq +1.63%       (Updates with investor comment, details, updates prices)",
    "By Noel Randewich",
    "Sept 5 (Reuters) - U.S. stocks surged on Thursday onexpectations of a de-escalation in trade tensions afterWashington and Beijing agreed to hold high-level talks nextmonth, while strong economic data eased fears of a domesticslowdown.",
    "After fears of a deepening trade war caused a sell-off inlate July and early August, leading to speculation that adecade-long bull market was ending, the S&P 500 has largelyrecovered and is now less than 2% short of its July 26 recordhigh close. The benchmark index has climbed 2.4% in the past twosessions.",
    "China and the United States agreed to hold talks in earlyOctober in Washington, boosting markets as investors bet on athaw in the trade war between the world's two largest economiesthat has taken a toll on global growth. urn:newsml:reuters.com:*:nL3N25W0JF",
    "Alternating signs of improvement and deterioration in theU.S.-China trade war, often based on tweets and comments fromTrump, have repeatedly sparked volatility on Wall Street inrecent months.  ",
    "\"Whether the talks occur or not, we'll see. And whether theyare productive, we're skeptical. But the market loves it,\" saidTim Ghriskey, Chief Investment Strategist at Inverness Counselin New York. ",
    "The S&P information technology index .SPLRCT rose 1.9%,while financials .SPSY jumped 2.1%, both rising the most amongthe 11 major S&P 500 sectors.",
    "The interest rate-sensitive S&P 500 Banks Index .SPXBK surged 2.9%, following a rise in U.S. Treasury yields. US/",
    "The ADP National Employment Report, considered a precursorto the Labor Department's more comprehensive jobs report, showedU.S. private employers' payrolls grew at the fastest pace infour months in August, led by big gains in service-sector jobs. urn:newsml:reuters.com:*:nL2N25W0EW",
    "Another private survey showed growth in U.S. servicessectors accelerated in August, rebounding from its weakest levelin nearly three years, as new orders rose to their highest levelsince February amid trade worries. urn:newsml:reuters.com:*:nL2N25V14B",
    "The upbeat reports eased concerns of an economic downturn,which was exacerbated by data on Tuesday that showed acontraction in U.S. factory activity in August. Investors willkeep a close watch on the crucial nonfarm payrolls data due onFriday. ",
    " \"Manufacturing is in a bit of a global slump, but if youlook at the other economic data, like the services and jobsreports, none of them point to an economy that is teetering on arecession,\" said Michael Antonelli, market strategist at RobertW. Baird in Milwaukee.",
    "At 2:16 p.m. ET, the Dow Jones Industrial Average .DJI wasup 1.52% at 26,756.37 points, while the S&P 500 .SPX gained1.33% to 2,976.78.",
    " The Nasdaq Composite .IXIC added 1.63% to 8,106.94.   ",
    "In deal news, insurer Prudential Financial IncPRU.N agreed to acquire online insurance start-up Assurance IQ Inc for$2.35 billion. Shares of Prudential fell 2.9%. urn:newsml:reuters.com:*:nL3N25W2KR",
    "Sectors viewed as defensive declined, with the S&P utilitiesindex .SPLRCU , real estate index .SPLRCR and consumerstaples index .SPLRCS all lower.  ",
    "Advancing issues outnumbered declining ones on the NYSE by a2.01-to-1 ratio; on Nasdaq, a 2.77-to-1 ratio favored advancers.",
    "The S&P 500 posted 55 new 52-week highs and no new lows; theNasdaq Composite recorded 70 new highs and 38 new lows. ",
    "\n<^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\nMarkets indices   https://tmsnrt.rs/2PYeCn0\n    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^> (Reporting by Noel Randewich in San Francisco, additionalreporting by Uday Sampath in BengaluruEditing by Nick Zieminski) ((noel.randewich@tr.com; Twitter handle: @randewich  (415) 6772542; Reuters Messaging:noel.randewich.thomsonreuters.com@reuters.netnetrm://UdaySampath.Kumar.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-05 02:37:00"
}