{
  "url": "https://www.nasdaq.com/article/google-target-of-new-us-antitrust-probe-by-state-attorneys-general-20190903-01019",
  "title": "Google target of new U.S. antitrust probe by state attorneys general - Nasdaq.com",
  "text": [
    "Sept 3 (Reuters) - More than 30 U.S. state attorneys general are readying an investigation into Alphabet Inc'sGoogle  for potential antitrust violations, a source knowledgeable about the probe said on Tuesday.",
    "Texas leads the group of 30-plus attorneys general, which plans to announce the probe on Sept. 9, the source said.",
    "Google said that it was cooperating with the state officials.",
    "The probe is focused on the intersection of privacy and antitrust, according to the source, who did not elaborate.",
    "Ken Paxton, the Texas attorney general, filed comments along with 42 other state officials in June that urged the Federal Trade Commission to focus on privacy and data collection in investigating potential violations of antitrust law.",
    "In the comment, the state officials argued that the big tech firms have so much user data that it is hard for newcomers to compete.",
    "Another Texas official, Assistant Attorney General Jeff Mateer, alleged in an FTC hearing in June that Google and other big tech companies were misleading in representing themselves as neutral, citing Google's balking at carrying an ad about \"what it means to be an American, the Texas attorney general's office said in a statement in June. Google eventually relented on the ad, the statement said.",
    "The tech giants, among the richest and most powerful companies in the world, are facing increasing antitrust scrutiny from Congress, federal agencies and now state attorneys general.",
    "The Justice Department said in July that it was opening a broad investigation of major digital technology firms, focusing on whether they engage in anticompetitive practices. The investigation is believed to be aimed at Google, Amazon.com Inc  and Facebook Inc , and potentially Apple Inc . ",
    "Separately, the Federal Trade Commission, which also enforces antitrust law, is also probing Amazon and Facebook to determine if they abused their massive market power in retail and social media, respectively. ",
    "The Washington Post was the first to report the development on Tuesday."
  ],
  "published_datetime": "2019-09-03 15:14:00"
}