{
  "url": "https://www.nasdaq.com/article/goldman-sachs-7-tech-stocks-with-over-20-upside-cm1206507",
  "title": "Goldman Sachs: 7 Tech Stocks With Over 20% Upside - Nasdaq.com",
  "text": [
    "August was a particularly volatile month for investors. With ongoing US-China trade tensions and recession signals from the bond market, it’s not surprising that the S&P 500 posted 11 moves of over 1%. What’s more worrying is that it is unlikely the volatility will abate anytime soon. The Cboe Volatility Index remains at elevated levels- and in any case, September is a notoriously difficult month for the markets.",
    "So where does this leave investors? Well one option is to tune in to the Street and see which stocks analysts are recommending right now. Here we take a closer look at seven stocks, all with recent bullish calls from Goldman Sachs. Furthermore, as you will see, each of these stocks shows over 20% upside potential from current levels- meaning now could be a compelling time to buy in. Let’s take a closer look at which stocks are on Goldman’s buy list now:",
    "Uber Technologies Inc (UBER)",
    "Five-star Goldman Sachs analyst Heath Terry has a buy rating and $56 price target on ride-hailing giant Uber. From current levels that indicates impressive upside potential of 72%.",
    "He clearly sees a buying opportunity from Uber’s current weakness. Indeed, the stock is currently trading at just $33- a far cry from its IPO price of $45 back in May. That’s with shares plunging 23% in August after Uber reported a huge net loss of $5.24 billion for Q219. Even without the ‘one-off’ hit of stock-based compensation, the loss still amounted to $1.3 billion- up around 30% from the first quarter.",
    "“While there are considerable risks in ownership across the space given the intense competition, regulatory issues, and operating pressures, we continue to believe the risk/reward in owning the leader in this space is favorable and we remain Buy-rated” Terry told investors. Plus Terry did note that Uber’s core ride-hailing business generated $12.19 billion in Q2 gross bookings, beating the estimated $12.11 billion.",
    "In total, UBER still earns a ‘Strong Buy’ Street consensus. In the last three months the stock has scored 20 buy ratings and 6 hold ratings. At $55 the average analyst price target falls marginally below Terry’s own estimate, and suggests upside potential of 68%.",
    "Micron Technology Inc (MU)",
    "Goldman Sachs analyst Mark Delaney recently carried out a slew of tech stock upgrades. And one of the key stocks on his upgrade list was chip maker Micron.",
    "“We are now more positive on global memory stocks. … We believe that Micron’s stock will trade more on memory pricing trends and intermediate term EPS expectations than FY20 earnings,” the three-star analyst said in a note to clients last month. He has a $56 price target on MU, suggesting 24% upside potential lies ahead. Bear in mind that’s with shares already soaring 43% year-to-date.",
    "“We now believe that inventory at the memory companies … is being depleted faster than we previously expected. In addition, we continue to expect the underlying rate of production to fall below longer-term demand growth in 2020,” added Delaney.",
    "Overall, MU shows a relatively optimistic take from the Street. That’s with a Moderate Buy consensus based on 13 buy ratings, 6 hold ratings and 2 sell ratings. However the average price target of $48 only suggests 6% upside potential from current levels.",
    "CommScope Holding Co Inc (COMM)",
    "CommScope Holding helps design, build, and manage wired and wireless networks around the world. It’s another stock that Goldman Sachs analyst Mark Delaney has recently boosted to buy.",
    "“While we were incrementally positive on the stock after the company reported a 1.17 BTB for 1Q16 with strength in both fiber and mobile, CommScope announced a small cell win on May 2nd that gives us increased confidence on its ability to be successful in this key market for 5G,” the analyst explained. He now has a buy rating on COMM with a $19 price target. Given that the stock trades at just $11, this indicates upside potential of 77%.",
    "Delaney also pointed out that the “small cell win implies CommScope is better positioned than we had thought in the $2–$2.5 billion small cell market.”",
    "Encouragingly, CommScope also earns a ‘Strong Buy’ consensus from the Street. In the last three months, 8 analysts have published buy ratings on the stock with two analysts staying sidelined. The average analyst price target works out at $20.25.",
    "Amazon.com Inc (AMZN)",
    "Amazon is another top stock on Heath Terry’s buy list. Year-to-date, the stock has climbed 18%, and Terry sees a further 35% upside for the months ahead.",
    "“We continue to believe AMZN represents the best risk/reward in Internet given the relatively early-stage shift of workloads to the cloud, the transition of traditional retail online, and share gains in its advertising business, the long-term benefits of each we believe the market continues to underestimate for Amazon…” the analyst tells investors.",
    "Even though the company released mixed Q2 earnings, Terry remains optimistic. He points out that Q2 revenue spiked 20% year-over-year, with North America retail growth driving the revenue outperformance. And despite the surprising deceleration in Amazon’s cloud service AWS, the shift to the cloud remains relatively early-stage and overall revenue growth is still accelerating, says the analyst.",
    "Indeed, the Street is now unanimously positive on AMZN stock. In the last three months, Amazon has received 29 consecutive buy ratings. Plus the average analyst price target of $2,286 indicates 29% upside potential.",
    "Twitter Inc (TWTR)",
    "President Trump’s favorite social media platform, Twitter has just posted strong Q2 results. Alongside stable revenue growth, TWTR is now looking at sequential quarters of impressive engagement growth trends. In particular, analyst Heath Terry noted that Twitter’s monetizable DAU growth accelerated to 14% in Q2 thanks to an ongoing slate of product improvements.",
    "“Twitter continues to build on ‘Information Quality’ efforts… by moderating unwanted behavior, spam accounts, and low quality tweets through product innovation, acquisition, or more active removal of violating accounts and developer applications,” Terry wrote. “Our ad partner checks suggest that these efforts have generally been well received by advertisers and … are contributing to incremental ad dollars flowing onto the platform.”",
    "“Twitter continues to focus on the relevance of its product for its core user base, particularly on Video where the company highlighted in the first quarter improved click through rates,” he added. As a result, the analyst reiterated his TWTR buy rating with a $52 price target (22% upside potential).",
    "The Street is notably more restrained on its Twitter outlook. With only 4 buy ratings, 17 hold ratings and even 3 sell ratings, the consensus is a clear Hold. What’s more, with shares already up 48% year-to-date, the average analyst price target of $41 now falls 3% below the current share price.",
    "Alibaba Group Holding Ltd (BABA)",
    "Chinese e-commerce giant Alibaba scores 100% buy ratings from the Street. No less than 15 analysts have published back-to-back buy ratings on Alibaba. Meanwhile the average analyst price target indicates 28% upside potential from current levels.",
    "One of the analysts singing the stock’s praises is Goldman Sachs’ Piyush Mubayi. This four-star analyst has a $236 price target on BABA, for upside potential of 35%. And following the company’s FQ1 earnings beat, Mubayi reiterated his Conviction Buy rating on shares. “We remain impressed with Alibaba’s overall leverage to China consumption growth given its strategy, positioning, ability to build new businesses (such as new retail) and its execution,” Mubayi said in a note to clients. “We expect Alibaba to continue to invest for future growth on multiple fronts.”",
    "“In our view, the continuous investment in cloud technology demonstrates Alibaba’s determination to solidify its leading position in the industry and take up more market share in the future,” he continued. “We believe Ant Financial will continue to be the ‘enabler’ of Alibaba’s New Retail strategy and help the company navigate the globalization road map.” For the fiscal first quarter, revenue growth decelerated 10pts, but still reflected a robust 40%+ Y/Y growth, while EBITDA accelerated 5pts to 34% Y/Y.",
    "Stitch Fix Inc (SFIX)",
    "Online personal styling service Stitch Fix has a radical data-driven way of selling clothes. It sends clients direct shipments of apparel that have been specially selected through the combination of data science and personal stylists. So far this strategy appears to be paying off. The company has just reported nine straight quarter of mid- to high- 20s% year-over-year revenue growth. And that’s on a $1.6 billion revenue run rate.",
    "“We upgrade SFIX to Buy from Neutral as we see more compelling risk/reward in the company’s ability to lean into its existing core customer base while also efficiently expanding to new categories and geographies (UK)” commented Terry on July 22. He sees significant opportunities “for further outperformance,” boosted by the increase in retail store closures (particularly in apparel).",
    "Along with his new buy rating comes a $38 price target- suggesting shares can explode by 99%. Shares have dropped recently on concerns about Amazon’s rival Prime service, but analysts are remaining on-side. “We believe the company’s data science capabilities and brand access are key competitive advantages versus Amazon and other emerging players” said Stifel Nicolaus’ Scott Devitt. This Top 100 analyst has also just upgraded SFIX to buy with a $35 price target.",
    "Overall the Street has a cautiously optimistic take on SFIX. Its Moderate Buy consensus is based on 4 recent buy ratings vs 3 hold ratings. That’s with an average analyst price target of $37.",
    "Discover the Street’s best-rated stocks with the Top Analysts’ Stocks tool ",
    "By Harriet Lefton for TipRanks.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:55:29"
}