{
  "url": "https://www.nasdaq.com/article/turkey-volkswagen-close-in-on-production-plant-deal-20190905-00179",
  "title": "Turkey, Volkswagen close in on production plant deal - Nasdaq.com",
  "text": [
    "By Orhan Coskun",
    "ISTANBUL, Sept 5 (Reuters) - Turkey is increasingly confident German carmaker Volkswagen VOWG_p.DE will build a production plant in the country after an \"extremely positive\" meeting between a senior company official and President Tayyip Erdogan this week, three Turkish sources said.",
    "Reuters reported last week that the two sides had been holding talks over Turkey's vehicle tax regime to conclude the 1 billion euro ($1.1 billion) investment. ",
    "Erdogan and a high-ranking VW official overcame most of the problems during a meeting this week, one Turkish source with knowledge of the matter said. A Volkswagen source said Erdogan had met with VW Chief Executive Herbert Diess this week.",
    "\"There were previously some small issues, such as the tax arrangements on the cars that will be sold. In the meeting, an almost complete agreement was reached,\" the Turkish source said. \"If there isn't a last minute problem, the investment will be made in Turkey.\"",
    "Steep Turkish taxes on larger cars limit most buyers and local producers to smaller engine sizes. Cars with engines of less than 1.6 litres made up 96% of Turkey's new car market in 2018. A source had said Turkey was trying to find a formula to address Volkswagen's concerns without putting existing car producers at a disadvantage.",
    "Major producers such as Fiat , Renault , Ford , Hyundai  and Toyota  produced more than 1.3 million motor vehicles in Turkey last year.",
    "Czech Prime Minister Andrej Babis said on Tuesday during a visit to Ankara that Volkswagen is making a big investment in Turkey. ",
    "A second Volkswagen source said only minor matters still had to be clarified, mainly on tax issues. The agreement was expected to be reached in a few weeks and the plant was expected to be built in the western Manisa province, the source said.",
    "\"There is no problem any longer about thinking that the investment will be made in Turkey. This decision will be announced in a short while after the final adjustments are made,\" a second Turkish source said.",
    "($1 = 0.8973 euros)"
  ],
  "published_datetime": "2019-09-05 05:34:00"
}