{
  "url": "https://www.nasdaq.com/article/walmart-is-unlikely-to-suffer-financially-after-changing-gun-policies-cm1207526",
  "title": "Walmart is Unlikely to Suffer Financially After Changing Gun Policies - Nasdaq.com",
  "text": [
    "In response to several mass shooting incidents in the US - including two inside its own stores that claimed the lives of 24 people - Walmart (WMT) announced on Tuesday that it was making sweeping changes to its policies on firearms and ammunition. The nation's largest brick and mortar retailer will discontinue the sales of ammunition for handguns and military-style assault rifles, stop selling handguns in Alaska (the last state in which handgun sales in the store still occurred) and require that customers no longer carry firearms openly while shopping in their stores.",
    "\r\n CEO Doug McMillon explained that Walmart would continue to sell shotguns, long rifles and ammunition that are intended for hunting.",
    "\r\n Walmart currently sells approximately 20% of all the ammunition in the US and McMillon estimated that that would drop to between 6% and 9% as a result of the new policies.",
    "\r\n McMillon stressed that he himself was a sportsman and gun owner, but that he also feels a strong responsibility to ensure the safety of customers and employees in the company's stores. He also implored the White House and Congress to reinstitute a ban on assault weapons and strengthen background checks for gun purchasers.",
    "\r\n McMillon acknowledged that while Walmart has a long history of supplying the needs of hunters and outdoors enthusiasts, the need to reduce risks to the public would take priority. He ended the official press release by stating that \"The status quo is unacceptable.\"",
    "\r\n Walmart typically avoids participation in any sort of political debate and the change in policy marks a significant departure from that strategy. The National Rifle Association responded critically to the Walmart decision, predicting that customers would simply buy their guns and ammunition at other stores and adding that it was \"shameful to see Walmart succumb to the pressure of anti-gun elites.\"",
    "\r\n During a trading session that saw the Dow Jones Industrial Average shed nearly 300 points- or 1.1%, shares of Dow component Walmart actually rallied modestly on the day, adding 0.4% on Tuesday.",
    "\r\n By virtue of its size, Walmart is a significant component of the major indexes and its share price is typically highly correlated to the movement of the broad markets, though it has significantly outperformed the S&P 500 during recent months of volatile markets.",
    "\r\n Even with the largest market share in ammunition sales by a wide margin, guns and ammunition make up a surprisingly small portion of Walmart's total revenues in any given period.",
    "\r\n The company does not break out firearms or ammunition sales in its financial results, but total ammunition sales in the US are estimated at $2 billion annually, meaning Walmart's self-reported 20% share of the market equals approximately $400 million. Dropping that number to 6-9% would mean a loss of over $200 million in sales - which sounds like a huge number, except that in the scale of Walmart's $514 billion of annual revenue, the shortfall is almost negligible.",
    "\r\n A day after the announcement, there have been no significant analyst downward revisions for Walmart's sales or ne t earnings .",
    "\r\n Sale's lost by Walmart are expected to be gained by Cabela's/Bass Pro Shops (CAB) , Dick's Sporting Goods (DKS) and thousands of small firearms retailers across the nation.",
    "\r\n Walmart has a massive footprint in the US, serving customers from all walks of life in everywhere from major urban areas to small rural towns. The issue of gun control is quite contentious and it remains to be seen how taking this stand will effect Walmart's total sales. Many customers are likely to applaud the effort, while some will be vehemently opposed to a perceived threat to their personal liberties.",
    "\r\n Most C-level executives conspicuously avoid wading into hot-button social and political issues in order to not alienate customers. Walmart's management is betting that support for common-sense risk reduction measures will outweigh any short-term backlash or lost sales.",
    "\r\n It's a bold move, but also a reflection of changing social values regarding firearm safety. It's also possible that the move will empower other large companies to take a public stand on gun control and other contentious issues.\r\n Biggest Tech Breakthrough in a Generation Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time. See 7 breakthrough stocks now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 01:08:00"
}