{
  "url": "https://www.nasdaq.com/article/lululemon-lulu-2nd-quarter-earnings-what-to-expect-cm1207714",
  "title": "Lululemon (LULU) 2nd Quarter Earnings: What to Expect - Nasdaq.com",
  "text": [
    "ablokhin for Getty images",
    "Yoga sports apparel specialist Lululemon (LULU) is set to report second quarter fiscal 2020 earnings results after the closing bell Thursday.",
    "LULU shares have already risen 51% year to date, including 13% gains in the past three months, besting the S&P 500 index in both spans. The company has benefited not only from strong top-line growth, LULU’s cost-cutting efforts along with innovative product launches have also given it tons of earnings power, which should carry over to the next few years. But how far can the stock, which has skyrocketed 65% from December lows, continue to go?",
    "The rebound in retail has been nothing short of impressive. For LULU, the Athleisure category in particular, not only remains hot in the U.S., international growth has also gained momentum. And combined with the operational improvements new CEO Calvin McDonald has begun to make, which resulted in a breathtaking 16% jump in LULU’s Q1 same-store sales, it would be a mistake to part with this winner now. Combined with its e-commerce momentum and supply chain improvements, LULU stock may yet be cheap despite trading at all-time highs.",
    "For the quarter that ended July, Wall Street expects the Vancouver-based apparel maker to earn 89 cents per share on revenue of $845.46 million. This compares to the year-ago quarter when earnings came to 71 cents per share on revenue of $723.5 million. For the full year, ending January 2020, earnings are expected to rise 20.5% year over year to $4.65 per share, while full-year revenue of $3.81 billion would mark a 15.7% increase year over year.",
    "As evidenced by the expected 25% surge in quarterly earnings, LULU continues to enjoy strong margin expansion. What’s more, the company is now scaling to become a full-fledged athletic brand with expansion into areas such as athletic shoes and personal care products. The company is taking on this endeavor even as Nike (NKE) and Under Armour (UA) have encroached on its yoga territory. And the result have begun to bear fruit.",
    "In Q1, LULU reported earnings of 74 cents, which beat estimates by 4 cents, while revenue grew 20% to $782 million, topping forecasts by $26 million. These measures, combined with the 16% jump in same-store sales (above the 11% rise), sent LULU stock soaring to all-time highs. Where other retailers were resorting to aggressive discounting to move inventory, LULU didn’t have that problem. With the company upping its full-year revenue guidance, the management doesn’t expect demand to weaken.",
    "The company is benefiting from a combination of factors, namely improved capabilities in personalized digital marketing and data analytics, which is driving not only more traffic, but also improved sales at the company’s site. Not only is LULU’s e-commerce sites rising impressively, the company is converting those online shoppers too as evidenced by its better-than 30% rise in the company’s Direct-to-consumer (DTC) business, which generates higher margins.",
    "On Thursday analysts and investors will want to see whether these trends can continue, particularly in light of concerns of a slowing economy and potential impacts of the trade war. And while LULU stock is not cheap, the company is executing at a premium level, which should continue to drive the shares higher.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 08:13:44"
}