{
  "url": "https://www.nasdaq.com/article/notable-tuesday-option-activity-hd-wynn-lrcx-cm1206801",
  "title": "Notable Tuesday Option Activity: HD, WYNN, LRCX - Nasdaq.com",
  "text": [
    "Looking at  options trading  activity among components of the S&P 500 index, there is noteworthy activity today in Home Depot Inc (Symbol: HD), where a total volume of 51,927 contracts has been traded thus far today, a contract volume which is representative of approximately 5.2 million underlying shares (given that every 1 contract represents 100 underlying shares). That number works out to 112.1% of HD's average daily trading volume over the past month, of 4.6 million shares. Especially high volume was seen for the $200 strike call option expiring September 20, 2019  , with 4,049 contracts trading so far today, representing approximately 404,900 underlying shares of HD. Below is a chart showing HD's trailing twelve month trading history, with the $200 strike highlighted in orange:       makeArticleAd();    Wynn Resorts Ltd (Symbol: WYNN) saw options trading volume of 24,537 contracts, representing approximately 2.5 million underlying shares or approximately 94.8% of WYNN's average daily trading volume over the past month, of 2.6 million shares. Particularly high volume was seen for the $125 strike call option expiring September 20, 2019  , with 2,403 contracts trading so far today, representing approximately 240,300 underlying shares of WYNN. Below is a chart showing WYNN's trailing twelve month trading history, with the $125 strike highlighted in orange:       And Lam Research Corp (Symbol: LRCX) saw options trading volume of 11,116 contracts, representing approximately 1.1 million underlying shares or approximately 70.7% of LRCX's average daily trading volume over the past month, of 1.6 million shares. Particularly high volume was seen for the $190 strike put option expiring November 15, 2019  , with 3,485 contracts trading so far today, representing approximately 348,500 underlying shares of LRCX. Below is a chart showing LRCX's trailing twelve month trading history, with the $190 strike highlighted in orange:         For the various different available expirations for HD options  , WYNN options  , or LRCX options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 13:43:18"
}