{
  "url": "https://www.nasdaq.com/article/3-reasons-to-trust-square-stock-even-in-a-recession-cm1207490",
  "title": "3 Reasons to Trust Square Stock Even in a Recession - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "I've been a fan of Square (NYSE: SQ ) and its disruptive force in the small business community for quite some time. For me, the long-term narrative for SQ stock has never changed. This is all about providing lesser-known outfits with the tools and resources to compete with the alpha dogs. While disruption often gets a bad rap, with Square, it's mostly positive.",
    "That said, where I don't get the warm and fuzzies is the market performance of Square stock. On a year-to-date basis, shares have slipped to a return of only 11%. While that's still respectable considering the geopolitical circumstances, SQ was up over 51% YTD as recently as late July.",
    "Unfortunately, the markets thought dimly of SQ stock following the payment-processing specialist's second-quarter earnings report . Although Square beat on both the top and bottom line, its per-share profitability guidance for Q3 was notably sub-par. Rather than an earnings per share of 22 cents that analysts forecasted, Square only sees a range between 18 cents to 20 cents.",
    "Naturally, investors got spooked and punished Square stock. While the volatility is understandable, the magnitude isn't. Yes, there are many headwinds impacting the company's core business. However, the skeptics are not giving an opportunity to let Square's positives shine.",
    "Here are three reasons why I think it's premature to give up on SQ stock, even with a possible recession:",
    "On the surface, the present environment seems incredibly negative for SQ stock. Square first jumped to prominence with its square-shaped payment processor. Neatly attaching to a smartphone, it allowed proprietors to deliver the same conveniences to their customers as they would find in a larger company.",
    "But in a recession, small businesses are often hit the hardest . It's not difficult to understand why. With limited resources relative to bigger organizations, they typically don't have the capital strength to ride out economic turmoil indefinitely. Therefore, it's also seemingly reasonable that many investors gave up on Square stock.",
    "At the same time, small businesses are much nimbler than their larger counterparts. Furthermore, this is a practical advantage that could, in some cases, see the little guy disrupt the top dog.",
    "For instance, during a recession, the overall consumer market obviously declines. Thus, some companies may adapt a different approach to sway whatever customers are available. Making this strategy and tactic change, though, is difficult for larger organizations. But small businesses can react quicker, and with Square's comprehensive application ecosystem, they're that much more effective.",
    "Prior to Square's disruption in the payments-processing industry, small business owners had very few options. They could elect to ink deals with major credit card companies like Mastercard (NYSE: MA ) or Visa (NYSE: V ), or they could go cash only if they didn't want to pay onerous fees.",
    "However, with Square's payment processor, along with recent initiatives like Square Card and their Cash app, the company provides comprehensive modern amenities at reasonable rates. They also open up the door to companies who don't want or cannot get access to traditional financial tools. Particularly, I'm thinking about cannabis-based businesses , which Square quietly but tacitly supports.",
    "Sure, it's a risky play. But it offers tremendous opportunities for Square stock, especially as legal momentum builds.",
    "But the beauty of platforms like the Cash app is its modularity . For instance, if you want immediate payment transfers to your bank account, Cash provides that for a 1.5% fee. Otherwise, normal transfers (taking one business day) are free. Plus, having all Square transactions under its ecosystem is incredibly beneficial for small businesses, saving time and costs. Logically, this adds to the fundamental value propositions for SQ stock.",
    "Finally, I think it's a smart move that Square CEO Jack Dorsey supports cryptocurrencies and the blockchain. Increasingly, the Cash app has tacked on more crypto-related functions . Over time, it will become a fully-fledged crypto resource.",
    "How do I know this? No matter what you personally think about cryptos, most millennials love them . And since they're the \"it\" generation right now, their voice matters the most.",
    "Put aside the investment narrative for SQ stock. When you simply consider its impact in the business community, Square has made profound changes. If you've shopped at independent retail companies, you've almost certainly engaged their products or services.",
    "Square wants to spread out. Rather than keeping the intuitive interface and disruptive nature domestic, management is betting that other countries will want to join.",
    "As such, I think the company has massive international opportunities, with the biggest in Japan. Even today, Japan has a cash culture that is oddly anachronistic and perhaps ironic. But Square is trying to turn this market, evangelizing the benefits of both the company and the fintech industry.",
    "If they succeed, Square stock will enjoy a long-term catalyst. In the meantime, Japan and other international channels offer revenue potential that may help shield SQ from a recession.",
    "As of this writing, Josh Enomoto did not hold a position in any of the aforementioned securities.",
    "The post 3 Reasons to Trust Square Stock Even in a Recession appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:11:59"
}