{
  "url": "https://www.nasdaq.com/article/ferroglobe-plc-gsm-q2-2019-earnings-call-transcript-cm1207425",
  "title": "Ferroglobe PLC (GSM) Q2 2019 Earnings Call Transcript - Nasdaq.com",
  "text": [
    "   Image source: The Motley Fool.   Ferroglobe PLC    (NASDAQ: GSM)        Q2 2019 Earnings Call       Sep 4, 2019 ,   9:00 a.m. ET makeArticleAd(); Contents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  Operator  Good morning, ladies and gentlemen, and welcome to the   Ferroglobe's Second Quarter Earnings Call. [Operator   Instructions] As a reminder, this conference call may be   recorded. I would now like to turn the call over to Pedro Larrea,   Ferroglobe's Chief Executive Officer. You may begin.  Pedro Larrea Paguaga    --   Chief Executive Officer  Good morning, everyone, and thank you for joining the   Ferroglobe's Second Quarter 2019 Conference Call. Joining me on   the call are Jose Maria Calvo-Sotelo, Deputy CFO and EVP   Corporate Development and Gaurav Mehta, EVP of Investor Relations   and Corporate Strategy. Before we get started with some prepared remarks, I am going   to read a brief statement. Please turn to Slide 1 at this   time. Statements made by management during this conference call that   are forward-looking are based on current expectations. Risk   factors that could cause actual results to differ materially from   these forward-looking statements can be found in Ferroglobe's   most recent SEC filings and the exhibits to those filings, which   are available on our webpage, www.ferroglobe.com. In addition, this discussion includes references to EBITDA,   adjusted EBITDA and adjusted diluted earnings per share, which   are non-IFRS measures. Reconciliation of these non-IFRS measures   may be found in our most recent SEC filings. Next slide please. We will first review the Q2 results across   our core products; next, we will update you on the corporate   initiatives we are undertaking, and particularly, the divestiture   of the hydro assets and one ferroalloy plant belonging to   FerroAtlantica in Spain; and lastly, we will provide an update on   the market outlook for the remainder of 2019. Next slide, please. As you have seen in our earnings press   release, the second quarter results clearly reflect a continued   weakening in end market demand across all of our core products   and an erosion in realized pricing across most of our   products. That said, adjusted EBITDA showed an improvement   quarter-over-quarter, as actions taken by the industry more   broadly and also actions we took in respect of our own   operations, are beginning to have a positive impact on our costs.   While we were expecting the cyclical downturn to continue through   Q2, the overall financial results for the quarter are still   disappointing. In the beginning of the year, we announced a number of   initiatives focused on operational changes, cost cutting measures   to counter a declining top line; and most importantly, ensuring   that our balance sheet was de-risked and well positioned to ride   out this cyclical downturn. We will touch on all of these areas, but I want to start by   highlighting a very important transaction. As you may have seen   in our press release; last Friday, we successfully closed the   sale of FerroAtlantica that was announced in our previous       earnings call    in the month of May. As a reminder, the entity we sold is the   owner of 10 hydroelectric facilities and of the Cee-Dumbroa   ferroalloys plant. The closing of this transaction was the centerpiece of the   cash generation plan we previously announced and is a critical   factor in de-risking our balance sheet. The transaction values   the assets at EUR170 million or approximately $188 million. Gross   proceeds from the sale are approximately $173 million after   adjustments agreed in the contract, and net proceeds are   approximately $112 million after paying the capital leases linked   to this asset. The significantly -- this significantly changes the financial   profile of the Company, bringing net debt down to around $308   million on a pro forma basis as of June 30, 2019 and brings our   total cash and cash equivalents balance to approximately $298   million on a pro forma basis. I would like to thank our team for   working relentlessly and delivering a successful outcome. This transaction was very complex in a number of respects and   we demonstrated the ability to close it expeditiously, as part of   the execution of our near-term strategy. The sale values   FerroAtlantica at 12.7 times on a cycle-average EBITDA basis,   which clearly indicates how the transaction is value enhancing   for the Company, on top of helping to improve the balance sheet   profile. Overall, we have significantly improved our debt level   and liquidity, but feels it is prudent to continue strengthening   the balance sheet even further. Another element of this is the refinancing of our existing   revolving credit facility. With the sale of FerroAtlantica behind   us, the Company is better situated to refinance on terms that   provide solid footing and flexibility for the Company in this   market environment. Given the underlying challenges in our business and the   actions we have taken, there is a lot of ground to cover on   today's call. We will provide further details on all of these   areas. So, moving to Slide 5, please; Q2 results are still reflective   overall -- of an overall industry slowdown, with revenues, EBITDA   and net income at disappointing levels. Adjusted EBITDA is above   Q1, but revenues are still declining and net income continues to   be negative. Please note that our prior quarter financials have   been restated to show the results of recently sold Spanish   hydroelectric facilities, as discontinued operations. Overall, volumes were down 6% quarter over quarter, as all   three of our major product categories were adversely impacted by   a slowdown in end-customer demand, particularly in the silicon   metal family of products. An important factor of the Q2 results   was reduced pricing across most of our products, although at a   slower rate than previous quarters in silicon metal. Specifically, average sales prices for silicon metal declined   1.6% versus Q1 2019 and average sales prices for silicon-based   alloys fell by 5.8%, while manganese-based alloys continue to   improve by 1.4% versus Q1,2019. The overall weaker volumes and   pricing during the quarter yielded an 8.5% decline in our top   line revenue versus the prior quarter. On a positive note, we realize cost improvements during the   quarter across a number of key inputs. Reported EBITDA was   negative $7.1 million in Q2 compared to $3.3 million in Q1. The   Adjusted EBITDA in the quarter was $5 million up -- 51% from $3.3   million during the prior quarter. The decline in revenues was offset by cost improvements   yielding EBITDA margin of 1.2%, an increase of 49 basis points   from the prior quarter. Given these developments, we are actively   making changes to our commercial, operational and financial   strategy, which we will discuss momentarily. Next slide, please. Q2 2019 continued to be affected by the   same headwinds we have been discussing over the past few   quarters. Our consolidated sales for the quarter have decreased   8.5% from $447 million in Q1 2019 to $409 million in Q2. Revenues   across our three primary product categories were down   quarter-on-quarter, due to the combined effects of lower volumes   and/or weaker pricing. This revenue weakness was offset with cost improvements,   resulting in a slight improvement in adjusted EBITDA. In   historical terms, the softness in revenues is still coupled with   relatively high costs in some of our inputs, if we compare to   where such costs where only a couple of years ago. Prices for manganese ore, coal, electrode components, met and   pet coke, as well as power are coming down, but are still at   relatively high levels. As has been the case in other industry   cycles, these inputs should, according to industry experts,   continue to come down, leading to a recovery in margins. The slow-down in end-market demand coupled with a relatively   soft pricing environment experienced during the first half of the   year is expected to set the backdrop for the remainder of 2019.   We expect costs to continue to improve throughout the business   which will help alleviate some of the pressure. Slide 7 please; adjusted EBITDA restated to exclude   discontinued operations increased by $1.7 million over the   previous quarter from $3.3 million in Q1 to $5 million in Q2,   2019. The biggest contributor to the improvement during the   quarter is improvement in cost across our key inputs. The cost   improvement of $14.2 million includes improved power pricing in   Spain and France which reduced costs by approximately $5.8   million. Furthermore, we realized the benefit of declining manganese   ore prices, which yielded $3.5 billion in cost savings   quarter-over-quarter. In the aggregate, the realized selling   price evolution across all products resulted in a negative impact   of $6.5 million during the quarter. Volume declines across the   portfolio negatively impacted this quarter's adjusted EBITDA by   $2.7 million, as volumes overall decreased 6%. Finally, a variety   of multiple other factors adversely impacted results by   approximately $4 million. At this time, I'll turn the call over to Gaurav who will   discuss pricing and volume trends, earnings contributions, and   market observations for each of our three products.  Gaurav Mehta    --   Executive Vice President of Corporate Strategy and Investor   Relations  Thank you, Pedro. Moving on to Slide 8, Ferroglobe's realized   average selling price for silicon metal declined by 1.6% to   $2,320 per metric ton as compared to $2,358 per metric ton in the   prior quarter. The US index pricing started flat at Q1 levels,   but eventually declined during the quarter. Similarly, the   European index showed the same trend during the quarter with both   indices extending their gradual declines year-to-date as the   demand side of the equation has eroded faster than the supply   side cutbacks. Based on recent history, industry experts believe current   pricing levels are unsustainable for many foreign producers and   feel that the current market prices should result in a further   shut down of unprofitable production capacity. As a result,   analysts now expect stabilization of prices which we're beginning   to see early signs of in the European and Chinese indices. We continue to have a decent order book with fixed price   contracts as well as with floor limits in some of our index price   contracts. These types of contracts allow us to realize average   prices that do not decline as much as the underlying index. The   bar chart on the top right hand of the slide shows a sequential   decline in volumes to levels we have not seen in recent   history. Volumes during the quarter were, once again, negatively   impacted by a slowdown across the aluminum, chemical, and solar   end markets. The net impact of the trade war and corresponding   tariffs, further destocking along of the value chain, and a   general slowdown in markets such as the automotive industry all   contributed to a sharp decline in sales volume this year. There are commercial opportunities where we consciously turn   business away because of the underlying economics. In these   instances, we may be losing share, but feel that many   transactions are being done at levels which are loss making for   any supplier. This dynamic reinforces the need to remain   disciplined and also highlights that the current pricing dynamic   is not sustainable. We saw a slight deterioration in our EBITDA from the Silicon   Metals business quarter-over-quarter. The net impact of lower   sales and lower realized prices slightly outweighed the positive   impact of lower input costs and cost improvements driven by   technical performance. On a positive note, the Canadian   International Trade Tribunal continued its anti-dumping and   countervailing duty findings with respect to imports of silicon   metal from China for a further five year period. The anti-dumping duties ranged from 47% to 235% and the   countervailing duties range from RMB1,460 to RMB1,945 per metric   ton, which has been in effect since 2013. We thank the Canadian   authorities for the diligent work. Trade cases are important in   ensuring an even playing field and protecting our investments and   we'll continue to pursue such cases as we deem appropriate. Next slide, please. In response to a drop in the end market   demand during the quarter, we're taking further action to idle   silicon metal production capacity. As a reminder, it is important   to note that we're not permanently closing capacity, but   optimizing fixed and variable costs by concentrating production   in a reduced number of facilities. When demand recovers, additional production can be brought   back on line with limited cost and no significant new   investments. Our South African plant at Polokwane underwent   regular maintenance during the winter months there and was idled   as of August 1st. The facility has three furnaces dedicated to   silicon metal with production -- combined production capacity of   59,000 tons per year. This decision addresses the need to adapt   our production capacity to the market environment and will also   help reduce our working capital, since this plant has higher   inventory requirements due to the long lead times to end   customers. To partially offset the lost production volumes from   Polokwane, we have restarted one furnace at Sabon, the facility   at sales in Europe. Pro forma for these operational changes, our   remaining silicon metal production capacity will decrease by   39,000 tons from 281,000 tons down to 242,000 tons. However, our   ability to de-stock during the second half of the year places our   total volumes available for sale above this number. Slide 10, please. Turning to silicon-based alloys, overall   EBITDA contribution from this product category improved, driven   by lower cost. During the quarter, the average selling price   decreased by 5.8% to $1,572 per metric ton, down from $1,669 per   metric ton in the first quarter of 2019. Although sales volumes   was stable during the quarter, the pricing pressure we saw at the   end [Phonetic] of the year has continued, with capacity from new   market entrants and converted capacity impacting silicon alloys   supply. Sales volume was steady at approximately 79,000 tons for Q2.   Despite continued stability in demand, we are closely tracking   the developments in the steel industry and plans for capacity   reductions by producers which could impact sales in the back part   of the year. As a result, we are considering capacity   curtailments in ferrosilicon. The Silicon-based alloys business   was positively impacted by approximately $11.8 million of cost   reduction during the quarter, including the impact of lower raw   materials and power cost. Foundry products and calcium silicon, which represent   approximately 44% of the overall silicon-based alloys business,   had sales volumes similar to the prior quarter. These are   tailor-made non-commodity products with greater stability in   prices. We're also focusing on specialty grade of ferrosilicon,   currently representing approximately 19% of the revenues in the   silicon-alloys business, which will provide higher margins going   forward. Next slide, please. The quarter-over-quarter EBITDA trend line   during Q2 and the continuation of favorable developments in the   manganese ore pricing into the current quarter is expected to   support improvement and increase contribution from this business   in the back part of 2019. To give you some context, the Chinese   index price for 44% grade ore on a CIF basis was as high as $8.15   per DMTU back in March 2018. Currently, the index is around $5.50   per DMTU. Given ore mix requirements for different grades and overall   lag due to the shipping and processing times and sales from   finished goods inventory, the current quarter results do not   fully reflect the benefit of the drop in ore prices. We expect to   see continued improvement in the EBITDA contribution of this part   of the business going forward. Our average realized price for manganese-based alloys   increased 1.4% to $1,188 per ton, up from $1,172 per ton last   quarter. Index prices for both ferromanganese and silicomanganese   have remained stable during Q2 and we have seen this continue   into the third quarter. Volumes declined marginally by 4% quarter   over quarter. Once again, we view this positively despite the recent   headlines in the steel industry. In the interests of time, and   given the number of recent developments to review during this   call, we have included some of our routinely disclosed   information as an appendix to the presentation for those who   would like those details. Next slide, please. The working capital increase during the   second quarter of $59 million was primarily driven by increased   finished goods inventory, which is a result of the quarterly   decline in operating volumes and sales. As noted previously, we   have made operational changes to address the buildup of   inventories, particularly at Polokwane, which will release cash   over the coming months. With an increase in working capital and net operating losses,   there was cash consumption during the quarter. We ended the   quarter with $188 million of cash and cash equivalents, which is   down from $217 million in the prior quarter. Slide 13, please. During the quarter, both of our gross debt   and our net debt balances increased. Our gross debt increased by   $30 million to $666 million and we ended the quarter with net   debt of $478 million. In the right hand side of the slide we show the cash   generation in more detail. The loss during the quarter was $43.7   million. Adjusting for non-cash items, our loss was $4.3 million.   Our operations use cash flows of $37.4 million during the second   quarter. This was primarily due to an increase in working   capital, offset by cash inflows from our accounts receivable   securitization program. Payments for maintenance capex were   continued at a level of $7.1 million, resulting in free cash for   a quarter of negative $44.5 million. With that, I now turn the call back to Pedro to review the   near-term outlook and corporate initiatives.  Pedro Larrea Paguaga    --   Chief Executive Officer  Thank you, Gaurav. So if we turn now to Slide 15, on our prior   calls, we have outlined a number of initiatives aimed at cash   generation, cost cutting and the overall strengthening of our   balance sheet. I'll now take a few minutes to provide updates on   the four distinct areas outlined on this slide. So turning now to Slide 16; yesterday, we announced the   successful sale of a FerroAtlantica, which closed on August 30.   The sale, which involved a number of complex elements, was   expeditiously finalized within three months, since we first   announced the deal, as we got all the approvals to meet the   various conditions to closing. The transaction yields an   effective valuation multiple of 12.7 times, based on cyclical   average EBITDA. While we launched a number of targeted non-core asset sales,   this transaction was the centerpiece of our cash generation plan.   The total transaction value was $170 million or approximately   $188 million -- sorry a EUR170 million or approximately $188   million. The uses of these funds are pro forma impact are   detailed on the following slide. As part of the transaction, we have entered into a tolling   agreement with FerroAtlantica under which we will become the   exclusive offtaker of finished goods from the ferroalloys   facility. In return for this exclusivity, Ferroglobe commits to   supplying FerroAtlantica with key raw materials over the long   term. Next slide; on slide 17, we show an illustration summarizing   the sources and uses of cash from the sales and the pro forma   impact on the balance sheet. Of the $188 million of gross   proceeds, $15 million was deducted to account for closing   adjustments, leaving net proceeds of $173 million. $60.3 million   of $173 million was immediately used to repay certain leases and   other loan obligations, and $2.5 million would be paid to   advisors, leaving a balance of $110 million as cash on our   balance sheet. The pro forma cash and cash equivalents balance as of June 30   is approximately $298 million and includes any restricted cash.   Following the debt repayment, the pro forma net debt is   approximately $308 million. While it is true that are available   cash is subject to certain covenants under our existing revolving   credit facility, we believe the overall quantum of cash on a pro   forma basis significantly de-risks the business during this down   cycle. Furthermore, we still maintain our goal of getting the net   debt down to $200 million through further cash generation and   recovery in the business. Next, slide please. The other major initiative we discussed   last quarter is the refinancing of our existing RCF, which   contains leverage-based covenants and minimum liquidity   thresholds limiting our access to cash. While we had originally   targeted a closing of the refinancing by June 30, we decided to   delay the refinancing in light of recent developments. As our confidence in closing the sale of FerroAtlantica   increased, we decided to delay the refinancing until after the   sale. With the sale now behind us, we believe we are in a more   favorable position to negotiate terms that reflect the improved   credit profile of the Company. We could pay back the entire loan   amount under the RCF with our cash position and eliminate any   covenant risk. That said, we do think that having a credit line and   additional liquidity in this time of market environment would be   beneficial, particularly to fund working capital as the business   recovers. The structure we are evaluating consists of some   combination of an asset-based revolving credit facility and a   term loan. With the benefit of the sale, we may also consider a   smaller deal, including an asset-based revolving credit facility   only, that could offer better terms and greater flexibility. At the moment, we intend to complete the financing process   around the end of Q3 and we'll update the market as necessary. It   is also worthwhile to note that the Bank group was reported to   suspend testing of the interest coverage ratio under the existing   RCF for Q2. Next slide, please. On slide 19, we provide an update of our   -- on our cost savings achieved through the first half across the   three cost cutting areas. For the year, we were expecting to   realize $10 million of savings through a reduction of corporate   overhead costs. During the first six months of the year, we have   achieved $7.7 million of this target. The improvements in overhead costs are primarily attributable   to a reduction in personal costs, reduced use of third-party   consultants and advisors as most -- as more work has been handled   in-house, particularly relating to operational and legal matters.   As part of our continued focus to cut costs, management and the   Board have decided to close our corporate headquarters in   London. We will be consolidating it with our office in Madrid, which   is currently used by a number of our senior management team and   critical support functions. By having everyone at one location,   we not only will save money, but will improve the overall flow of   communication and decision making. Members of senior management are transitioning as early as the   middle of September. Furthermore, there is a comprehensive plan   under way to hire and train personnel in Madrid, who will   ultimately replace some of the finance and accounting staff, who   will not be moving with the Company. We have allowed for adequate   transition time to ensure a smooth and effective handover of   responsibilities. The next bucket is the KTM initiative. The Key Technical   Metrics program is focused on achieving performance improvement   through increased productivity and efficiencies, including   changes to raw materials mix and focus on byproduct recycling and   change to electrode technology. To-date we have achieved only   $1.5 million of the $15 million target for the year. While we successfully adopted a number of operational and   technical changes, the financial savings is clearly behind   schedule. Some of the savings during the first six months have   been diluted by one off factors which have impacted plant   performance at a few locations. For example, our Becancour facility faced a number of   electrode breakage due to supplier quality issues, which resulted   in several stoppages this year. These types of events impact our   productivity and distort the technical metrics which we are   measuring to calculate the savings. We do remain confident in   completing the initiatives identified in our KTM and achieving   the run rate benefit. Lastly, we have been focused on reducing fixed costs at the   plant level. During the first half of the year, we achieve   savings of $7.2 million, which compares our full year 2019 target   of $15 million. It is important to note that the $7.2 million   only reflect permanent cost eliminations on items which will not   creep back in the future. For example, the cost savings from idle   plants is not captured in this number. Overall, we are on pace to   reaching our $40 million of cost savings targeted for 2019. On a   run rate basis, our target savings remain $75 million. So moving to slide 20; finally, there are some noteworthy   updates relating to a few specific items which we have discussed   in the past. With regard to the sale of smaller non-core assets,   two pending transactions have seen important developments. In   South Africa, we now have the clearance from the Competition   Courts to finalize the sale of Timberlands. We expect this   transaction to close in the coming days. The net proceeds from the sale of the Timberlands is ZAR150   million or approximately $9.4 million. Additionally, we are also   making progress on the sale of the Cored Wire facility in Poland.   At this point, we have agreed to deal terms and expect the   transaction to close in September. Net proceeds from this   transaction will be approximately $3.5 million. The sale of some remaining hydro assets in France has run into   an administrative hurdle which will limit our sales to a minority   stake in 2019. We still have a chance to close this portion of   the sale in late 2019 with the remaining portion being sold in   2020. Potential proceeds from the sale of a minority stake will   be in the range of approximately $6 million to $7 million,   depending on the ultimate percentage sold this year. Lastly, you have heard us speaking of the solar grade silicon   project in Spain in a number of occasions. As many of you are   well aware, the solar industry has been hit hard with the ongoing   trade war, which are between the US and China, which are two   important countries for the solar value chain. As a result of a sever deterioration of the broader solar   industry and collapsing prices, as well as our focus on cash   generation, we have made the decision to restructure the project   in an effort to save cost and maximize any future recovery of   value. In light of the near-term prospects, we canceled the joint   venture effective June 30, 2019 and bought out our partner's   equity stake. There was a $2.75 million cash expense associated with this,   but we avoided significantly greater ongoing fees and expenses   tied to the JV. In addition to this payment, there is   approximately $6 million in ancillary equipment which will be   transferred to the partner as well. The next step is to monetize   the project by looking for financial and/or strategic   partners. Next slide please. So if we turn to slide 22, the slower   activity during the first half of 2019 certainly confirms a   change in sentiment among our end markets. Our commercial team   routinely meets with customers across our end markets and from   then -- from them, we understand that these market conditions   continue to linger. Our sales of silicon-based alloys and manganese-based alloys   into the steel sector have not been materially impacted by a   slowdown in steel production this year as the industry continues   to produce at levels near multi-year highs. We recognize the risk   of the trade war and the potential for further cuts by the steel   producers, and we'll continue to monetize these developments. Our sales into the aluminum industry are being impacted by the   slowdown in the automotive industry globally, including the   emerging markets and trade war uncertainty, among other factors.   The slowdown in aluminum extends beyond auto sales as customers   are also experiencing a reduction in aluminum geared toward   building and construction, other transportation including   airplanes, and everyday consumer goods. Even in the chemicals side of our business, where silicon   metal ultimately goes into thousands of everyday consumer and   industrial products, our customers continue to buy cautiously and   are curtailing some of their production. Despite a relatively   strong global economy, we are hearing the larger chemical   companies mention slowdown in everyday consumer products,   particularly in emerging markets, which have been the driver of   growing sales in recent years. And finally, the picture for the photovoltaic industry has not   changed much as the industry continues to suffer from low prices.   The contradiction in this market has been the expectation from   experts for record photovoltaic installations in 2019 on the one   hand and reduced level of activity by our customers on the other   hand. Recent commentary from some of the larger solar cell producers   paint a grim picture for the remainder of the year, so we do not   see a reversal of this trend in the immediate term. Clearly, at   some point, inventory levels will hit a point where our customers   will need to restock, serving as the catalyst for recovery for   this part of the business. Next slide please. The commercial outlook across our portfolio   for 2019 continues to mirror the general sentiment of our end   markets. Given the looming uncertainties, we have taken some   actions to curtail production to support our strategy in the back   half of the year, and are prepared to take additional measures as   necessary. Our silicon metal sales will be impacted by the slowdown we   just described in the aluminum, chemicals and photovoltaic end   markets. The continued erosion of the index price into the third   quarter will certainly impact the selling prices in the second   half of the year. Our diversified portfolio of contracts with   fixed price contracts and price floors in some index [Phonetic]   contracts will help mitigate such impact on our selling   prices. Despite curtailments by global steel producers, the overall   demand picture for manganese-based alloys remains sound. With the   curtailments we made earlier in the year, we feel good about   selling out our manganese alloys production this year. The   current dynamics on the pricing of finished goods and ore should   continue to reflect more positively in the back half of the   year. In addition to declining ore prices, we continue to make   changes to the ore mix and recycling of byproducts to further   improve margin and provide greater flexibility. We have also been   developing our strategy to increase sales of refined products   which have significantly higher margins. Finally, our silicon based products, mainly ferrosilicon, is   going to be faced with the same trends tied to the broader steel   market. While ferrosilicon prices are showing some sign of   stabilization, there could be pressures from potential capacity   conversions from silicone metal or from certain pockets like   Malaysia, where we believe producers are struggling to sell   products. We are prepared to take action to curtail production as   required. The foundry business continues to grow with stable   prices. Next slide please. So all in all, the first half of the year   has been disappointing given the rate of deterioration in   end-market demand and pricing, both of which accelerated faster   than what we initially anticipated at the beginning of the year.   We're pulling on various levers to get us through this cyclical   downturn and remain confident in our ability to navigate this   environment. The successful closing of the divestiture of hydro   generating facilities and a factory in Spain is significantly   value enhancing and has certainly changed our balance sheet   profile. With nearly $300 million of cash on a pro forma basis, we have   gained optionality and flexibility. We'll retain optionality as   it relates to the refinancing process and with the cash on hand,   we have greater flexibility in running our business. We remain   focused on cash generation and cost cutting. In addition to   capturing the $75 million run rate cost cutting initiatives, we   are assessing the entire production platform and looking to   right-size the business as needed. Other cash generation initiative such as the divestiture of   the remaining non-core assets and the working down of finished   goods inventories will further help us. Despite the current   market environment, we believe in the fundamental value of our   global asset base and we are committed to recovering this value   for our stakeholders. We look forward to updating you on the   financing and other initiatives highlighted on today's call. Thank you for your time and participation this morning. At   this time, I would ask the operator to open the line up for   questions. Questions and Answers:  Operator  Thank you. [Operator Instructions] Our first question comes   from Vincent Anderson with Stifel. Your line is now open.  Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst  Yes, thanks. So just starting with manganese-alloy spreads,   what are you seeing that gives you the confidence that this   improvement can be maintained given, you know, the Chinese market   is just so fragmented and their capacity seems very ready and   willing to come back to the market the moment spreads have   increased?  Pedro Larrea Paguaga    --   Chief Executive Officer  Thank you, Vincent. Well, so far, if you look at the evolution   of manganese-alloys prices in, mainly in Europe, which is our   main market, they have been stable for the -- really for the past   12 months with small ups and downs. We believe that has to do   partly with our action in terms of cutting back production   capacity and in general with just, I think, overall players being   rational with their production capacity. So we see that outside China, the supply demand balance is now   balanced and we don't see like new supply driven shocks in the   market outside China. As you know, China has enough capacity to   serve its own market, but given transport costs and other   factors, they have not been an exporter to the rest of the world,   so we don't see that as being a threat in the near-term.  Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst  No, that's very fair and a good point. I would say that the   risk seems to be that they come in and buy any available ore in   the       global market    . So maybe if you could comment on how you've seen ore   availability kind of shape up over the course of the year?  Gaurav Mehta    --   Executive Vice President of Corporate Strategy and Investor   Relations  Well, ore availability has been, I would say, more than   plenty. Manganese ore inventories have actually been going up, in   general. And it is, I think, clear now that manganese ore   suppliers have been unable to keep prices up and the trend is   solid of those prices going down. The last comments I've seen   from analysts in the market as recently as today are talking   about concerns in the ore market about additional volumes coming   from Ghana, for instance. So, we see that market as well supplied   and we don't see reasons why today the manganese ore market would   rebound. The opposite we do see, in general, and I think most   analysts would agree that the trend is for manganese ore prices   to still go down.  Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst  That's helpful. Thank you. And could you just quickly clarify   your current silicon metal capacity? When I was doing the math, I   came up with a little over 220,000 tons, excluding the joint   venture. I think is your other Sabon Furnace also producing   silicon metal at this time?  Pedro Larrea Paguaga    --   Chief Executive Officer  Yes, we have now two Sabon furnaces producing silicon metal   now.  Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst  Okay. All right. Perfect, thank you. And then just a   clarification on the decision to switch the South African plant   off and restart in Spain, I know Spanish electricity costs have   come down, but that between currency and I assume that was the   plant that had the Eskom power agreement, you know, that would   seem very cost effective. Was the working capital build just that extreme or was it   driven more by your current focus on liquidity and that when   those get -- when those issues get resolved that would be a   potential place that you would start bringing capacity back   online?  Pedro Larrea Paguaga    --   Chief Executive Officer  It's a combination of two factors. One is, again, optimizing   cost and where we have the greater ability to eliminate not only   variable but also fixed costs. And so as I was saying during the   presentation, we are optimizing overall total cost for producing   a given amount of silicon metal. So it's really about optimizing   total cost, including by the way, of course our logistic   costs. The second is certainly also a focus on cash generation and   the fact that South Africa structurally is just a higher working   capital operation because of their distance to end-market. So the   two factors have weighed into the decision.  Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst  Great, thank you. And then just one last one and I'll turn it   over. Now that you fully own the UMG silicon joint venture, what   is the plan for handling the government issued project there? And   are there -- can you remind us is there any minimum capital   outlays required to prevent, you know if there's any acceleration   of repayment that could be tied to that if the project is   idled.  Pedro Larrea Paguaga    --   Chief Executive Officer  There is no additional capital requirement, so there is going   to be no additional capital invested in that project. We have to   go through tests run by the government in terms of whether we   meet all the requirements of the loan and as we go through those   tests, we will see whether there is a requirement to pay back a   part or all of that loan.  Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst  And when will those tests be completed?  Pedro Larrea Paguaga    --   Chief Executive Officer  Along the rest of this year.  Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst  Okay, thank you.  Operator  Thank you. And our next question comes from Sarkis   Sherbetchyan with B. Riley FBR. Your line is now open.  Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst  Thanks for taking my question here. Pedro, can you help me   understand the level of inventory you're carrying on the balance   sheet? Maybe help me understand which segments comprise the   inventory? And I have a follow-up.  Pedro Larrea Paguaga    --   Chief Executive Officer  Well, the increase in inventories, as we have said, is mostly   linked to decline volumes and mostly decline volumes in silicon   metal. So there's been a significant increase of inventories on   the silicon metal finish production. Total finished product   inventories are somewhere around half of the total inventory   numbers, and all the increase between Q1 and Q2 in terms of   inventory has come from finished products. Of the other half, like 60% is raw materials inventory. Those   are more or less stable. The trend from the beginning of the year   is of a reduction on those ones. But you always have ups and   downs on the raw materials linked to bulk shipments. So manganese   ore shipments come in 40,000 vessels, 40,000 tons vessels. So, of   course, when you have one of those cargoes, your inventory just   naturally goes up. So -- but the trend in raw materials is -- for   those to go down. The rest of inventories are spare parts and   work in progress. Again, those of being stable in the past   months. So again, we have -- we know where the inventory increase has   been. There's also a bit of inventory increase in manganese   alloys. That again, has a lot to do with specific shipments which   go in -- again, in thousands of tons from some of our plants   coming out at the end of the quarter or the beginning of the   quarter. So there is some thousand tons of a manganese alloys   inventories increase in Q2 versus Q1. But again, that is just   normal. I would say, cyclical -- short term cyclical evolution.   All in all, that is why our focus now is concentrated on reducing   finished product inventories and mainly on silicon metal.  Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst  Understood. And if I kind of think back to the comments on the   volume trends for silicon metal, for example, do you think that   if you look at the balance of the year, the volume trends you're   seeing for your order book here in the second half, would you be   able to convert the inventory to cash or do you anticipate a   further build up? Help us understand that?  Pedro Larrea Paguaga    --   Chief Executive Officer  No, we hope -- I mean, we are working and that is already   happening as we speak in the past weeks, a reduction in silicon   mental inventory and that is what we're working on, is a   reduction there. Our sales volume -- and I would say demand out   there in the silicon metal industry as a whole, is stabilizing,   and our view is that toward the end of the year, demand should   come back and we could have potentially even an increase on   silicon metal sales, but that's still to be seen. We are working   under the assumption, I would say, that our silicon metal volumes   would not increase in the rest of the year.  Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst  Got it, understood. And I think you mentioned in your prepared   comments some producers potentially switching over to   ferrosilicon. Can you kind of help us understand what you've been   seeing out in the industry? Has that been happening? And is that   what's pressuring prices or is it more so a demand issue? Help us   understand that.  Pedro Larrea Paguaga    --   Chief Executive Officer  We haven't seen for a while, I would say, any silicon metal   producer or significant silicon metal producer switching to   silicon alloys. Frankly, given where ferrosilicon prices are   right now, we don't see the point of that happening. It could, we   haven't seen a significant volume of that happening. And the   comment was more, I would say, potential rather than factual. But   there hasn't been a lot. Today, the economics of producing   ferrosilicon versus silicon metal is not necessarily   favorable.  Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst  Got it. And just switching gears to the divestiture of the   hydro assets. So that's closed, when you get the cash on your   balance sheet?  Pedro Larrea Paguaga    --   Chief Executive Officer  It is already there, as of last Friday.  Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst  Got it. And with regard to about, call it the $60 million or   so in capital lease repayment, that's already been satisfied as   well?  Pedro Larrea Paguaga    --   Chief Executive Officer  Yes. Yes, so all the moves that you see there on slide, what   number of slide is it? 18, of sources and uses of funds, those   are already -- those were done on Friday.  Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst  Thank you so much.  Pedro Larrea Paguaga    --   Chief Executive Officer  There is, I think, some final adjustments on working capital,   potentially, but those would be very minor by nature.  Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst  Thank you. That's all from me.  Operator  Thank you. This does conclude today's question-and-answer   session. I would now like to turn the call back over to Pedro   Larrea for closing remarks.  Pedro Larrea Paguaga    --   Chief Executive Officer  Well, that concludes our second quarter earnings call, and   thanks again for your participation. We look forward to hearing   from you and have all a great day.  Operator  [Operator Closing Remarks]  Duration: 46 minutes  Call participants:  Pedro Larrea Paguaga    --   Chief Executive Officer   Gaurav Mehta    --   Executive Vice President of Corporate Strategy and Investor   Relations   Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst   Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst   More GSM analysis   All earnings call transcripts        10 stocks we like better than Ferroglobe   PLC     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Ferroglobe   PLC wasn't one of them! That's right -- they think   these 10 stocks are even better buys.  See the 10 stocks        *Stock Advisor returns as of June 1, 2019      This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability.    Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "  Image source: The Motley Fool. ",
    "Image source: The Motley Fool.",
    " Ferroglobe PLC    (NASDAQ: GSM)        Q2 2019 Earnings Call       Sep 4, 2019 ,   9:00 a.m. ET ",
    " Operator ",
    "Good morning, ladies and gentlemen, and welcome to the   Ferroglobe's Second Quarter Earnings Call. [Operator   Instructions] As a reminder, this conference call may be   recorded.",
    "I would now like to turn the call over to Pedro Larrea,   Ferroglobe's Chief Executive Officer. You may begin.",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    "Good morning, everyone, and thank you for joining the   Ferroglobe's Second Quarter 2019 Conference Call. Joining me on   the call are Jose Maria Calvo-Sotelo, Deputy CFO and EVP   Corporate Development and Gaurav Mehta, EVP of Investor Relations   and Corporate Strategy.",
    "Before we get started with some prepared remarks, I am going   to read a brief statement. Please turn to Slide 1 at this   time.",
    "Statements made by management during this conference call that   are forward-looking are based on current expectations. Risk   factors that could cause actual results to differ materially from   these forward-looking statements can be found in Ferroglobe's   most recent SEC filings and the exhibits to those filings, which   are available on our webpage, www.ferroglobe.com.",
    "In addition, this discussion includes references to EBITDA,   adjusted EBITDA and adjusted diluted earnings per share, which   are non-IFRS measures. Reconciliation of these non-IFRS measures   may be found in our most recent SEC filings.",
    "Next slide please. We will first review the Q2 results across   our core products; next, we will update you on the corporate   initiatives we are undertaking, and particularly, the divestiture   of the hydro assets and one ferroalloy plant belonging to   FerroAtlantica in Spain; and lastly, we will provide an update on   the market outlook for the remainder of 2019.",
    "Next slide, please. As you have seen in our earnings press   release, the second quarter results clearly reflect a continued   weakening in end market demand across all of our core products   and an erosion in realized pricing across most of our   products.",
    "That said, adjusted EBITDA showed an improvement   quarter-over-quarter, as actions taken by the industry more   broadly and also actions we took in respect of our own   operations, are beginning to have a positive impact on our costs.   While we were expecting the cyclical downturn to continue through   Q2, the overall financial results for the quarter are still   disappointing.",
    "In the beginning of the year, we announced a number of   initiatives focused on operational changes, cost cutting measures   to counter a declining top line; and most importantly, ensuring   that our balance sheet was de-risked and well positioned to ride   out this cyclical downturn.",
    "We will touch on all of these areas, but I want to start by   highlighting a very important transaction. As you may have seen   in our press release; last Friday, we successfully closed the   sale of FerroAtlantica that was announced in our previous       earnings call    in the month of May. As a reminder, the entity we sold is the   owner of 10 hydroelectric facilities and of the Cee-Dumbroa   ferroalloys plant.",
    "The closing of this transaction was the centerpiece of the   cash generation plan we previously announced and is a critical   factor in de-risking our balance sheet. The transaction values   the assets at EUR170 million or approximately $188 million. Gross   proceeds from the sale are approximately $173 million after   adjustments agreed in the contract, and net proceeds are   approximately $112 million after paying the capital leases linked   to this asset.",
    "The significantly -- this significantly changes the financial   profile of the Company, bringing net debt down to around $308   million on a pro forma basis as of June 30, 2019 and brings our   total cash and cash equivalents balance to approximately $298   million on a pro forma basis. I would like to thank our team for   working relentlessly and delivering a successful outcome.",
    "This transaction was very complex in a number of respects and   we demonstrated the ability to close it expeditiously, as part of   the execution of our near-term strategy. The sale values   FerroAtlantica at 12.7 times on a cycle-average EBITDA basis,   which clearly indicates how the transaction is value enhancing   for the Company, on top of helping to improve the balance sheet   profile. Overall, we have significantly improved our debt level   and liquidity, but feels it is prudent to continue strengthening   the balance sheet even further.",
    "Another element of this is the refinancing of our existing   revolving credit facility. With the sale of FerroAtlantica behind   us, the Company is better situated to refinance on terms that   provide solid footing and flexibility for the Company in this   market environment.",
    "Given the underlying challenges in our business and the   actions we have taken, there is a lot of ground to cover on   today's call. We will provide further details on all of these   areas.",
    "So, moving to Slide 5, please; Q2 results are still reflective   overall -- of an overall industry slowdown, with revenues, EBITDA   and net income at disappointing levels. Adjusted EBITDA is above   Q1, but revenues are still declining and net income continues to   be negative. Please note that our prior quarter financials have   been restated to show the results of recently sold Spanish   hydroelectric facilities, as discontinued operations.",
    "Overall, volumes were down 6% quarter over quarter, as all   three of our major product categories were adversely impacted by   a slowdown in end-customer demand, particularly in the silicon   metal family of products. An important factor of the Q2 results   was reduced pricing across most of our products, although at a   slower rate than previous quarters in silicon metal.",
    "Specifically, average sales prices for silicon metal declined   1.6% versus Q1 2019 and average sales prices for silicon-based   alloys fell by 5.8%, while manganese-based alloys continue to   improve by 1.4% versus Q1,2019. The overall weaker volumes and   pricing during the quarter yielded an 8.5% decline in our top   line revenue versus the prior quarter.",
    "On a positive note, we realize cost improvements during the   quarter across a number of key inputs. Reported EBITDA was   negative $7.1 million in Q2 compared to $3.3 million in Q1. The   Adjusted EBITDA in the quarter was $5 million up -- 51% from $3.3   million during the prior quarter.",
    "The decline in revenues was offset by cost improvements   yielding EBITDA margin of 1.2%, an increase of 49 basis points   from the prior quarter. Given these developments, we are actively   making changes to our commercial, operational and financial   strategy, which we will discuss momentarily.",
    "Next slide, please. Q2 2019 continued to be affected by the   same headwinds we have been discussing over the past few   quarters. Our consolidated sales for the quarter have decreased   8.5% from $447 million in Q1 2019 to $409 million in Q2. Revenues   across our three primary product categories were down   quarter-on-quarter, due to the combined effects of lower volumes   and/or weaker pricing.",
    "This revenue weakness was offset with cost improvements,   resulting in a slight improvement in adjusted EBITDA. In   historical terms, the softness in revenues is still coupled with   relatively high costs in some of our inputs, if we compare to   where such costs where only a couple of years ago.",
    "Prices for manganese ore, coal, electrode components, met and   pet coke, as well as power are coming down, but are still at   relatively high levels. As has been the case in other industry   cycles, these inputs should, according to industry experts,   continue to come down, leading to a recovery in margins.",
    "The slow-down in end-market demand coupled with a relatively   soft pricing environment experienced during the first half of the   year is expected to set the backdrop for the remainder of 2019.   We expect costs to continue to improve throughout the business   which will help alleviate some of the pressure.",
    "Slide 7 please; adjusted EBITDA restated to exclude   discontinued operations increased by $1.7 million over the   previous quarter from $3.3 million in Q1 to $5 million in Q2,   2019. The biggest contributor to the improvement during the   quarter is improvement in cost across our key inputs. The cost   improvement of $14.2 million includes improved power pricing in   Spain and France which reduced costs by approximately $5.8   million.",
    "Furthermore, we realized the benefit of declining manganese   ore prices, which yielded $3.5 billion in cost savings   quarter-over-quarter. In the aggregate, the realized selling   price evolution across all products resulted in a negative impact   of $6.5 million during the quarter. Volume declines across the   portfolio negatively impacted this quarter's adjusted EBITDA by   $2.7 million, as volumes overall decreased 6%. Finally, a variety   of multiple other factors adversely impacted results by   approximately $4 million.",
    "At this time, I'll turn the call over to Gaurav who will   discuss pricing and volume trends, earnings contributions, and   market observations for each of our three products.",
    " Gaurav Mehta    --   Executive Vice President of Corporate Strategy and Investor   Relations ",
    "Thank you, Pedro. Moving on to Slide 8, Ferroglobe's realized   average selling price for silicon metal declined by 1.6% to   $2,320 per metric ton as compared to $2,358 per metric ton in the   prior quarter. The US index pricing started flat at Q1 levels,   but eventually declined during the quarter. Similarly, the   European index showed the same trend during the quarter with both   indices extending their gradual declines year-to-date as the   demand side of the equation has eroded faster than the supply   side cutbacks.",
    "Based on recent history, industry experts believe current   pricing levels are unsustainable for many foreign producers and   feel that the current market prices should result in a further   shut down of unprofitable production capacity. As a result,   analysts now expect stabilization of prices which we're beginning   to see early signs of in the European and Chinese indices.",
    "We continue to have a decent order book with fixed price   contracts as well as with floor limits in some of our index price   contracts. These types of contracts allow us to realize average   prices that do not decline as much as the underlying index. The   bar chart on the top right hand of the slide shows a sequential   decline in volumes to levels we have not seen in recent   history.",
    "Volumes during the quarter were, once again, negatively   impacted by a slowdown across the aluminum, chemical, and solar   end markets. The net impact of the trade war and corresponding   tariffs, further destocking along of the value chain, and a   general slowdown in markets such as the automotive industry all   contributed to a sharp decline in sales volume this year.",
    "There are commercial opportunities where we consciously turn   business away because of the underlying economics. In these   instances, we may be losing share, but feel that many   transactions are being done at levels which are loss making for   any supplier. This dynamic reinforces the need to remain   disciplined and also highlights that the current pricing dynamic   is not sustainable.",
    "We saw a slight deterioration in our EBITDA from the Silicon   Metals business quarter-over-quarter. The net impact of lower   sales and lower realized prices slightly outweighed the positive   impact of lower input costs and cost improvements driven by   technical performance. On a positive note, the Canadian   International Trade Tribunal continued its anti-dumping and   countervailing duty findings with respect to imports of silicon   metal from China for a further five year period.",
    "The anti-dumping duties ranged from 47% to 235% and the   countervailing duties range from RMB1,460 to RMB1,945 per metric   ton, which has been in effect since 2013. We thank the Canadian   authorities for the diligent work. Trade cases are important in   ensuring an even playing field and protecting our investments and   we'll continue to pursue such cases as we deem appropriate.",
    "Next slide, please. In response to a drop in the end market   demand during the quarter, we're taking further action to idle   silicon metal production capacity. As a reminder, it is important   to note that we're not permanently closing capacity, but   optimizing fixed and variable costs by concentrating production   in a reduced number of facilities.",
    "When demand recovers, additional production can be brought   back on line with limited cost and no significant new   investments. Our South African plant at Polokwane underwent   regular maintenance during the winter months there and was idled   as of August 1st. The facility has three furnaces dedicated to   silicon metal with production -- combined production capacity of   59,000 tons per year. This decision addresses the need to adapt   our production capacity to the market environment and will also   help reduce our working capital, since this plant has higher   inventory requirements due to the long lead times to end   customers.",
    "To partially offset the lost production volumes from   Polokwane, we have restarted one furnace at Sabon, the facility   at sales in Europe. Pro forma for these operational changes, our   remaining silicon metal production capacity will decrease by   39,000 tons from 281,000 tons down to 242,000 tons. However, our   ability to de-stock during the second half of the year places our   total volumes available for sale above this number.",
    "Slide 10, please. Turning to silicon-based alloys, overall   EBITDA contribution from this product category improved, driven   by lower cost. During the quarter, the average selling price   decreased by 5.8% to $1,572 per metric ton, down from $1,669 per   metric ton in the first quarter of 2019. Although sales volumes   was stable during the quarter, the pricing pressure we saw at the   end [Phonetic] of the year has continued, with capacity from new   market entrants and converted capacity impacting silicon alloys   supply.",
    "Sales volume was steady at approximately 79,000 tons for Q2.   Despite continued stability in demand, we are closely tracking   the developments in the steel industry and plans for capacity   reductions by producers which could impact sales in the back part   of the year. As a result, we are considering capacity   curtailments in ferrosilicon. The Silicon-based alloys business   was positively impacted by approximately $11.8 million of cost   reduction during the quarter, including the impact of lower raw   materials and power cost.",
    "Foundry products and calcium silicon, which represent   approximately 44% of the overall silicon-based alloys business,   had sales volumes similar to the prior quarter. These are   tailor-made non-commodity products with greater stability in   prices. We're also focusing on specialty grade of ferrosilicon,   currently representing approximately 19% of the revenues in the   silicon-alloys business, which will provide higher margins going   forward.",
    "Next slide, please. The quarter-over-quarter EBITDA trend line   during Q2 and the continuation of favorable developments in the   manganese ore pricing into the current quarter is expected to   support improvement and increase contribution from this business   in the back part of 2019. To give you some context, the Chinese   index price for 44% grade ore on a CIF basis was as high as $8.15   per DMTU back in March 2018. Currently, the index is around $5.50   per DMTU.",
    "Given ore mix requirements for different grades and overall   lag due to the shipping and processing times and sales from   finished goods inventory, the current quarter results do not   fully reflect the benefit of the drop in ore prices. We expect to   see continued improvement in the EBITDA contribution of this part   of the business going forward.",
    "Our average realized price for manganese-based alloys   increased 1.4% to $1,188 per ton, up from $1,172 per ton last   quarter. Index prices for both ferromanganese and silicomanganese   have remained stable during Q2 and we have seen this continue   into the third quarter. Volumes declined marginally by 4% quarter   over quarter.",
    "Once again, we view this positively despite the recent   headlines in the steel industry. In the interests of time, and   given the number of recent developments to review during this   call, we have included some of our routinely disclosed   information as an appendix to the presentation for those who   would like those details.",
    "Next slide, please. The working capital increase during the   second quarter of $59 million was primarily driven by increased   finished goods inventory, which is a result of the quarterly   decline in operating volumes and sales. As noted previously, we   have made operational changes to address the buildup of   inventories, particularly at Polokwane, which will release cash   over the coming months.",
    "With an increase in working capital and net operating losses,   there was cash consumption during the quarter. We ended the   quarter with $188 million of cash and cash equivalents, which is   down from $217 million in the prior quarter.",
    "Slide 13, please. During the quarter, both of our gross debt   and our net debt balances increased. Our gross debt increased by   $30 million to $666 million and we ended the quarter with net   debt of $478 million.",
    "In the right hand side of the slide we show the cash   generation in more detail. The loss during the quarter was $43.7   million. Adjusting for non-cash items, our loss was $4.3 million.   Our operations use cash flows of $37.4 million during the second   quarter. This was primarily due to an increase in working   capital, offset by cash inflows from our accounts receivable   securitization program. Payments for maintenance capex were   continued at a level of $7.1 million, resulting in free cash for   a quarter of negative $44.5 million.",
    "With that, I now turn the call back to Pedro to review the   near-term outlook and corporate initiatives.",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    "Thank you, Gaurav. So if we turn now to Slide 15, on our prior   calls, we have outlined a number of initiatives aimed at cash   generation, cost cutting and the overall strengthening of our   balance sheet. I'll now take a few minutes to provide updates on   the four distinct areas outlined on this slide.",
    "So turning now to Slide 16; yesterday, we announced the   successful sale of a FerroAtlantica, which closed on August 30.   The sale, which involved a number of complex elements, was   expeditiously finalized within three months, since we first   announced the deal, as we got all the approvals to meet the   various conditions to closing. The transaction yields an   effective valuation multiple of 12.7 times, based on cyclical   average EBITDA.",
    "While we launched a number of targeted non-core asset sales,   this transaction was the centerpiece of our cash generation plan.   The total transaction value was $170 million or approximately   $188 million -- sorry a EUR170 million or approximately $188   million. The uses of these funds are pro forma impact are   detailed on the following slide.",
    "As part of the transaction, we have entered into a tolling   agreement with FerroAtlantica under which we will become the   exclusive offtaker of finished goods from the ferroalloys   facility. In return for this exclusivity, Ferroglobe commits to   supplying FerroAtlantica with key raw materials over the long   term.",
    "Next slide; on slide 17, we show an illustration summarizing   the sources and uses of cash from the sales and the pro forma   impact on the balance sheet. Of the $188 million of gross   proceeds, $15 million was deducted to account for closing   adjustments, leaving net proceeds of $173 million. $60.3 million   of $173 million was immediately used to repay certain leases and   other loan obligations, and $2.5 million would be paid to   advisors, leaving a balance of $110 million as cash on our   balance sheet.",
    "The pro forma cash and cash equivalents balance as of June 30   is approximately $298 million and includes any restricted cash.   Following the debt repayment, the pro forma net debt is   approximately $308 million. While it is true that are available   cash is subject to certain covenants under our existing revolving   credit facility, we believe the overall quantum of cash on a pro   forma basis significantly de-risks the business during this down   cycle. Furthermore, we still maintain our goal of getting the net   debt down to $200 million through further cash generation and   recovery in the business.",
    "Next, slide please. The other major initiative we discussed   last quarter is the refinancing of our existing RCF, which   contains leverage-based covenants and minimum liquidity   thresholds limiting our access to cash. While we had originally   targeted a closing of the refinancing by June 30, we decided to   delay the refinancing in light of recent developments.",
    "As our confidence in closing the sale of FerroAtlantica   increased, we decided to delay the refinancing until after the   sale. With the sale now behind us, we believe we are in a more   favorable position to negotiate terms that reflect the improved   credit profile of the Company. We could pay back the entire loan   amount under the RCF with our cash position and eliminate any   covenant risk.",
    "That said, we do think that having a credit line and   additional liquidity in this time of market environment would be   beneficial, particularly to fund working capital as the business   recovers. The structure we are evaluating consists of some   combination of an asset-based revolving credit facility and a   term loan. With the benefit of the sale, we may also consider a   smaller deal, including an asset-based revolving credit facility   only, that could offer better terms and greater flexibility.",
    "At the moment, we intend to complete the financing process   around the end of Q3 and we'll update the market as necessary. It   is also worthwhile to note that the Bank group was reported to   suspend testing of the interest coverage ratio under the existing   RCF for Q2.",
    "Next slide, please. On slide 19, we provide an update of our   -- on our cost savings achieved through the first half across the   three cost cutting areas. For the year, we were expecting to   realize $10 million of savings through a reduction of corporate   overhead costs. During the first six months of the year, we have   achieved $7.7 million of this target.",
    "The improvements in overhead costs are primarily attributable   to a reduction in personal costs, reduced use of third-party   consultants and advisors as most -- as more work has been handled   in-house, particularly relating to operational and legal matters.   As part of our continued focus to cut costs, management and the   Board have decided to close our corporate headquarters in   London.",
    "We will be consolidating it with our office in Madrid, which   is currently used by a number of our senior management team and   critical support functions. By having everyone at one location,   we not only will save money, but will improve the overall flow of   communication and decision making.",
    "Members of senior management are transitioning as early as the   middle of September. Furthermore, there is a comprehensive plan   under way to hire and train personnel in Madrid, who will   ultimately replace some of the finance and accounting staff, who   will not be moving with the Company. We have allowed for adequate   transition time to ensure a smooth and effective handover of   responsibilities.",
    "The next bucket is the KTM initiative. The Key Technical   Metrics program is focused on achieving performance improvement   through increased productivity and efficiencies, including   changes to raw materials mix and focus on byproduct recycling and   change to electrode technology. To-date we have achieved only   $1.5 million of the $15 million target for the year.",
    "While we successfully adopted a number of operational and   technical changes, the financial savings is clearly behind   schedule. Some of the savings during the first six months have   been diluted by one off factors which have impacted plant   performance at a few locations.",
    "For example, our Becancour facility faced a number of   electrode breakage due to supplier quality issues, which resulted   in several stoppages this year. These types of events impact our   productivity and distort the technical metrics which we are   measuring to calculate the savings. We do remain confident in   completing the initiatives identified in our KTM and achieving   the run rate benefit.",
    "Lastly, we have been focused on reducing fixed costs at the   plant level. During the first half of the year, we achieve   savings of $7.2 million, which compares our full year 2019 target   of $15 million. It is important to note that the $7.2 million   only reflect permanent cost eliminations on items which will not   creep back in the future. For example, the cost savings from idle   plants is not captured in this number. Overall, we are on pace to   reaching our $40 million of cost savings targeted for 2019. On a   run rate basis, our target savings remain $75 million.",
    "So moving to slide 20; finally, there are some noteworthy   updates relating to a few specific items which we have discussed   in the past. With regard to the sale of smaller non-core assets,   two pending transactions have seen important developments. In   South Africa, we now have the clearance from the Competition   Courts to finalize the sale of Timberlands. We expect this   transaction to close in the coming days.",
    "The net proceeds from the sale of the Timberlands is ZAR150   million or approximately $9.4 million. Additionally, we are also   making progress on the sale of the Cored Wire facility in Poland.   At this point, we have agreed to deal terms and expect the   transaction to close in September. Net proceeds from this   transaction will be approximately $3.5 million.",
    "The sale of some remaining hydro assets in France has run into   an administrative hurdle which will limit our sales to a minority   stake in 2019. We still have a chance to close this portion of   the sale in late 2019 with the remaining portion being sold in   2020. Potential proceeds from the sale of a minority stake will   be in the range of approximately $6 million to $7 million,   depending on the ultimate percentage sold this year.",
    "Lastly, you have heard us speaking of the solar grade silicon   project in Spain in a number of occasions. As many of you are   well aware, the solar industry has been hit hard with the ongoing   trade war, which are between the US and China, which are two   important countries for the solar value chain.",
    "As a result of a sever deterioration of the broader solar   industry and collapsing prices, as well as our focus on cash   generation, we have made the decision to restructure the project   in an effort to save cost and maximize any future recovery of   value. In light of the near-term prospects, we canceled the joint   venture effective June 30, 2019 and bought out our partner's   equity stake.",
    "There was a $2.75 million cash expense associated with this,   but we avoided significantly greater ongoing fees and expenses   tied to the JV. In addition to this payment, there is   approximately $6 million in ancillary equipment which will be   transferred to the partner as well. The next step is to monetize   the project by looking for financial and/or strategic   partners.",
    "Next slide please. So if we turn to slide 22, the slower   activity during the first half of 2019 certainly confirms a   change in sentiment among our end markets. Our commercial team   routinely meets with customers across our end markets and from   then -- from them, we understand that these market conditions   continue to linger.",
    "Our sales of silicon-based alloys and manganese-based alloys   into the steel sector have not been materially impacted by a   slowdown in steel production this year as the industry continues   to produce at levels near multi-year highs. We recognize the risk   of the trade war and the potential for further cuts by the steel   producers, and we'll continue to monetize these developments.",
    "Our sales into the aluminum industry are being impacted by the   slowdown in the automotive industry globally, including the   emerging markets and trade war uncertainty, among other factors.   The slowdown in aluminum extends beyond auto sales as customers   are also experiencing a reduction in aluminum geared toward   building and construction, other transportation including   airplanes, and everyday consumer goods.",
    "Even in the chemicals side of our business, where silicon   metal ultimately goes into thousands of everyday consumer and   industrial products, our customers continue to buy cautiously and   are curtailing some of their production. Despite a relatively   strong global economy, we are hearing the larger chemical   companies mention slowdown in everyday consumer products,   particularly in emerging markets, which have been the driver of   growing sales in recent years.",
    "And finally, the picture for the photovoltaic industry has not   changed much as the industry continues to suffer from low prices.   The contradiction in this market has been the expectation from   experts for record photovoltaic installations in 2019 on the one   hand and reduced level of activity by our customers on the other   hand.",
    "Recent commentary from some of the larger solar cell producers   paint a grim picture for the remainder of the year, so we do not   see a reversal of this trend in the immediate term. Clearly, at   some point, inventory levels will hit a point where our customers   will need to restock, serving as the catalyst for recovery for   this part of the business.",
    "Next slide please. The commercial outlook across our portfolio   for 2019 continues to mirror the general sentiment of our end   markets. Given the looming uncertainties, we have taken some   actions to curtail production to support our strategy in the back   half of the year, and are prepared to take additional measures as   necessary.",
    "Our silicon metal sales will be impacted by the slowdown we   just described in the aluminum, chemicals and photovoltaic end   markets. The continued erosion of the index price into the third   quarter will certainly impact the selling prices in the second   half of the year. Our diversified portfolio of contracts with   fixed price contracts and price floors in some index [Phonetic]   contracts will help mitigate such impact on our selling   prices.",
    "Despite curtailments by global steel producers, the overall   demand picture for manganese-based alloys remains sound. With the   curtailments we made earlier in the year, we feel good about   selling out our manganese alloys production this year. The   current dynamics on the pricing of finished goods and ore should   continue to reflect more positively in the back half of the   year.",
    "In addition to declining ore prices, we continue to make   changes to the ore mix and recycling of byproducts to further   improve margin and provide greater flexibility. We have also been   developing our strategy to increase sales of refined products   which have significantly higher margins.",
    "Finally, our silicon based products, mainly ferrosilicon, is   going to be faced with the same trends tied to the broader steel   market. While ferrosilicon prices are showing some sign of   stabilization, there could be pressures from potential capacity   conversions from silicone metal or from certain pockets like   Malaysia, where we believe producers are struggling to sell   products. We are prepared to take action to curtail production as   required. The foundry business continues to grow with stable   prices.",
    "Next slide please. So all in all, the first half of the year   has been disappointing given the rate of deterioration in   end-market demand and pricing, both of which accelerated faster   than what we initially anticipated at the beginning of the year.   We're pulling on various levers to get us through this cyclical   downturn and remain confident in our ability to navigate this   environment. The successful closing of the divestiture of hydro   generating facilities and a factory in Spain is significantly   value enhancing and has certainly changed our balance sheet   profile.",
    "With nearly $300 million of cash on a pro forma basis, we have   gained optionality and flexibility. We'll retain optionality as   it relates to the refinancing process and with the cash on hand,   we have greater flexibility in running our business. We remain   focused on cash generation and cost cutting. In addition to   capturing the $75 million run rate cost cutting initiatives, we   are assessing the entire production platform and looking to   right-size the business as needed.",
    "Other cash generation initiative such as the divestiture of   the remaining non-core assets and the working down of finished   goods inventories will further help us. Despite the current   market environment, we believe in the fundamental value of our   global asset base and we are committed to recovering this value   for our stakeholders. We look forward to updating you on the   financing and other initiatives highlighted on today's call.",
    "Thank you for your time and participation this morning. At   this time, I would ask the operator to open the line up for   questions.",
    " Operator ",
    "Thank you. [Operator Instructions] Our first question comes   from Vincent Anderson with Stifel. Your line is now open.",
    " Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst ",
    "Yes, thanks. So just starting with manganese-alloy spreads,   what are you seeing that gives you the confidence that this   improvement can be maintained given, you know, the Chinese market   is just so fragmented and their capacity seems very ready and   willing to come back to the market the moment spreads have   increased?",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    "Thank you, Vincent. Well, so far, if you look at the evolution   of manganese-alloys prices in, mainly in Europe, which is our   main market, they have been stable for the -- really for the past   12 months with small ups and downs. We believe that has to do   partly with our action in terms of cutting back production   capacity and in general with just, I think, overall players being   rational with their production capacity.",
    "So we see that outside China, the supply demand balance is now   balanced and we don't see like new supply driven shocks in the   market outside China. As you know, China has enough capacity to   serve its own market, but given transport costs and other   factors, they have not been an exporter to the rest of the world,   so we don't see that as being a threat in the near-term.",
    " Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst ",
    "No, that's very fair and a good point. I would say that the   risk seems to be that they come in and buy any available ore in   the       global market    . So maybe if you could comment on how you've seen ore   availability kind of shape up over the course of the year?",
    " Gaurav Mehta    --   Executive Vice President of Corporate Strategy and Investor   Relations ",
    "Well, ore availability has been, I would say, more than   plenty. Manganese ore inventories have actually been going up, in   general. And it is, I think, clear now that manganese ore   suppliers have been unable to keep prices up and the trend is   solid of those prices going down. The last comments I've seen   from analysts in the market as recently as today are talking   about concerns in the ore market about additional volumes coming   from Ghana, for instance. So, we see that market as well supplied   and we don't see reasons why today the manganese ore market would   rebound. The opposite we do see, in general, and I think most   analysts would agree that the trend is for manganese ore prices   to still go down.",
    " Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst ",
    "That's helpful. Thank you. And could you just quickly clarify   your current silicon metal capacity? When I was doing the math, I   came up with a little over 220,000 tons, excluding the joint   venture. I think is your other Sabon Furnace also producing   silicon metal at this time?",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    "Yes, we have now two Sabon furnaces producing silicon metal   now.",
    " Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst ",
    "Okay. All right. Perfect, thank you. And then just a   clarification on the decision to switch the South African plant   off and restart in Spain, I know Spanish electricity costs have   come down, but that between currency and I assume that was the   plant that had the Eskom power agreement, you know, that would   seem very cost effective.",
    "Was the working capital build just that extreme or was it   driven more by your current focus on liquidity and that when   those get -- when those issues get resolved that would be a   potential place that you would start bringing capacity back   online?",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    "It's a combination of two factors. One is, again, optimizing   cost and where we have the greater ability to eliminate not only   variable but also fixed costs. And so as I was saying during the   presentation, we are optimizing overall total cost for producing   a given amount of silicon metal. So it's really about optimizing   total cost, including by the way, of course our logistic   costs.",
    "The second is certainly also a focus on cash generation and   the fact that South Africa structurally is just a higher working   capital operation because of their distance to end-market. So the   two factors have weighed into the decision.",
    " Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst ",
    "Great, thank you. And then just one last one and I'll turn it   over. Now that you fully own the UMG silicon joint venture, what   is the plan for handling the government issued project there? And   are there -- can you remind us is there any minimum capital   outlays required to prevent, you know if there's any acceleration   of repayment that could be tied to that if the project is   idled.",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    "There is no additional capital requirement, so there is going   to be no additional capital invested in that project. We have to   go through tests run by the government in terms of whether we   meet all the requirements of the loan and as we go through those   tests, we will see whether there is a requirement to pay back a   part or all of that loan.",
    " Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst ",
    "And when will those tests be completed?",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    "Along the rest of this year.",
    " Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst ",
    "Okay, thank you.",
    " Operator ",
    "Thank you. And our next question comes from Sarkis   Sherbetchyan with B. Riley FBR. Your line is now open.",
    " Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst ",
    "Thanks for taking my question here. Pedro, can you help me   understand the level of inventory you're carrying on the balance   sheet? Maybe help me understand which segments comprise the   inventory? And I have a follow-up.",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    "Well, the increase in inventories, as we have said, is mostly   linked to decline volumes and mostly decline volumes in silicon   metal. So there's been a significant increase of inventories on   the silicon metal finish production. Total finished product   inventories are somewhere around half of the total inventory   numbers, and all the increase between Q1 and Q2 in terms of   inventory has come from finished products.",
    "Of the other half, like 60% is raw materials inventory. Those   are more or less stable. The trend from the beginning of the year   is of a reduction on those ones. But you always have ups and   downs on the raw materials linked to bulk shipments. So manganese   ore shipments come in 40,000 vessels, 40,000 tons vessels. So, of   course, when you have one of those cargoes, your inventory just   naturally goes up. So -- but the trend in raw materials is -- for   those to go down. The rest of inventories are spare parts and   work in progress. Again, those of being stable in the past   months.",
    "So again, we have -- we know where the inventory increase has   been. There's also a bit of inventory increase in manganese   alloys. That again, has a lot to do with specific shipments which   go in -- again, in thousands of tons from some of our plants   coming out at the end of the quarter or the beginning of the   quarter.",
    "So there is some thousand tons of a manganese alloys   inventories increase in Q2 versus Q1. But again, that is just   normal. I would say, cyclical -- short term cyclical evolution.   All in all, that is why our focus now is concentrated on reducing   finished product inventories and mainly on silicon metal.",
    " Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst ",
    "Understood. And if I kind of think back to the comments on the   volume trends for silicon metal, for example, do you think that   if you look at the balance of the year, the volume trends you're   seeing for your order book here in the second half, would you be   able to convert the inventory to cash or do you anticipate a   further build up? Help us understand that?",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    "No, we hope -- I mean, we are working and that is already   happening as we speak in the past weeks, a reduction in silicon   mental inventory and that is what we're working on, is a   reduction there. Our sales volume -- and I would say demand out   there in the silicon metal industry as a whole, is stabilizing,   and our view is that toward the end of the year, demand should   come back and we could have potentially even an increase on   silicon metal sales, but that's still to be seen. We are working   under the assumption, I would say, that our silicon metal volumes   would not increase in the rest of the year.",
    " Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst ",
    "Got it, understood. And I think you mentioned in your prepared   comments some producers potentially switching over to   ferrosilicon. Can you kind of help us understand what you've been   seeing out in the industry? Has that been happening? And is that   what's pressuring prices or is it more so a demand issue? Help us   understand that.",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    "We haven't seen for a while, I would say, any silicon metal   producer or significant silicon metal producer switching to   silicon alloys. Frankly, given where ferrosilicon prices are   right now, we don't see the point of that happening. It could, we   haven't seen a significant volume of that happening. And the   comment was more, I would say, potential rather than factual. But   there hasn't been a lot. Today, the economics of producing   ferrosilicon versus silicon metal is not necessarily   favorable.",
    " Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst ",
    "Got it. And just switching gears to the divestiture of the   hydro assets. So that's closed, when you get the cash on your   balance sheet?",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    "It is already there, as of last Friday.",
    " Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst ",
    "Got it. And with regard to about, call it the $60 million or   so in capital lease repayment, that's already been satisfied as   well?",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    "Yes. Yes, so all the moves that you see there on slide, what   number of slide is it? 18, of sources and uses of funds, those   are already -- those were done on Friday.",
    " Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst ",
    "Thank you so much.",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    "There is, I think, some final adjustments on working capital,   potentially, but those would be very minor by nature.",
    " Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst ",
    "Thank you. That's all from me.",
    " Operator ",
    "Thank you. This does conclude today's question-and-answer   session. I would now like to turn the call back over to Pedro   Larrea for closing remarks.",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    "Well, that concludes our second quarter earnings call, and   thanks again for your participation. We look forward to hearing   from you and have all a great day.",
    " Operator ",
    "[Operator Closing Remarks]",
    " Duration: 46 minutes ",
    " Pedro Larrea Paguaga    --   Chief Executive Officer ",
    " Gaurav Mehta    --   Executive Vice President of Corporate Strategy and Investor   Relations ",
    " Vincent Anderson    --   Stifel, Nicolaus & Company Inc -- Analyst ",
    " Sarkis Sherbetchyan    --   B. Riley FBR -- Analyst ",
    " More GSM analysis ",
    " All earnings call transcripts ",
    " 10 stocks we like better than Ferroglobe   PLC     When investing geniuses David and Tom Gardner have a stock   tip, it can pay to listen. After all, the newsletter   they have run for over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks     for investors to buy right now... and Ferroglobe   PLC wasn't one of them! That's right -- they think   these 10 stocks are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " This article is a transcript of this conference call     produced for The Motley Fool. While we strive for our Foolish     Best, there may be errors, omissions, or inaccuracies in this     transcript. As with all our articles, The Motley Fool does not     assume any responsibility for your use of this content, and we     strongly encourage you to do your own research, including     listening to the call yourself and reading the company's SEC     filings. Please see our  Terms and Conditions  for additional details, including our Obligatory     Capitalized Disclaimers of Liability. ",
    "  Motley Fool Transcribers      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 12:23:31"
}