{
  "url": "https://www.nasdaq.com/article/preciousgold-climbs-on-rate-cut-bets-firm-equities-cap-gains-20190911-00562",
  "title": "PRECIOUS-Gold climbs on rate cut bets; firm equities cap gains - Nasdaq.com",
  "text": [
    "    * ECB meeting Thursday, Fed next week",
    "* Gold set to snap four-day losing streak",
    "* Palladium hits two-month high (Adds comments, updates prices)",
    "Sept 11 (Reuters) - Gold rose on Wednesday on expectationsof monetary policy easing by top central banks while globalgrowth risks continue to linger, although improved appetite forriskier assets capped bullion's gains and kept it near afour-week low.",
    "Spot gold XAU= was up 0.5% to $1,493.32 per ounce at 10:48a.m. EDT (1448 GMT). Prices fell to their lowest since Aug. 13at $1,483.90 in the previous session.",
    "U.S. gold futures GCv1 edged 0.1% higher to $1,501.20 anounce.",
    "\"If the European Central Bank (ECB) announces another cut ormore liquidity, it should boost precious metals and that'swhat's given a positive tone for gold,\" said Chris Gaffney,president of world markets at TIAA Bank.",
    "\"Low interest rates and slowing global growth are helpinggold stay well bid. It's just that to push it back to $1,500, weneed to see a rise in tensions and more expectations of lowerrates.\"",
    "Bond yields extended their steady climb and Wall Streetgained, with investor focus turning to monetary policy decisionsby the ECB on Thursday, when the bank is widely expected to cutinterest rates. MKTS/GLOBUS/",
    "The ECB decision is likely to set the tone for upcomingrate-setting decisions by the U.S. Federal Reserve and the Bankof Japan next week.",
    "While recent economic indicators might prompt a 25-basispoint interest rate reduction by the U.S. Fed, \"a major cut of50 bps (basis points) is unnecessary,\" said TIAA Bank's Gaffney.",
    "Lower interest rates decrease the opportunity cost ofholding non-yielding bullion and weigh on the dollar, makinggold cheaper for investors holding other currencies.",
    "Also on investors' radar was the U.S.-China trade ties, withChina exempting certain U.S. goods from retaliatory tariffs daysahead of the October talks in an attempt to de-escalate theprotracted dispute. urn:newsml:reuters.com:*:nL3N2621DV",
    "Spot gold is still targeting $1,453, as it has breached asupport at $1,497 per ounce, according to Reuters technicalanalyst Wang Tao. urn:newsml:reuters.com:*:nL3N2620VZ",
    "\"Weakening global growth, high risk aversion and lowinterest rates should keep prices elevated, but they areunlikely to provide a further boost given that they are, for themost part, already accounted for,\" analysts at Capital Economicswrote in a note.",
    "Among other precious metals, silver XAG= was up 0.2% to$18.06 per ounce, having hit a two-week low of $17.75 in theprevious session. ",
    "Palladium XPD= climbed 1.3% to $1,581.66 an ounce, afterhitting its highest since July 11 at $1,590. Platinum XPT= rose 0.9% to $938.40. (Reporting by Asha Sistla in Bengaluru; Editing by LisaShumaker) ((Asha.Sistla@thomsonreuters.com; If within U.S. +1 646 2238780; outside U.S. +91 80 6749 5072; Reuters Messaging: ReutersMessaging: asha.sistla.thomsonreuters.com@reuters.net))"
  ],
  "published_datetime": "2019-09-11 11:07:00"
}