{
  "url": "https://www.nasdaq.com/article/china-aug-exports-seen-up-slightly-imports-to-contract-for-4th-month-20190905-00048",
  "title": "China Aug exports seen up slightly, imports to contract for 4th month - Nasdaq.com",
  "text": [
    "BEIJING, Sept 5 (Reuters) - China's exports likely rose slightly in August as shippers raced to beat new U.S. tariffs but imports contracted for a fourth straight month, a Reuters poll showed, pointing to further strains on the economy as the Sino-U.S. trade war intensifies.",
    "August saw dramatic escalations in the bitter year-long trade row, with Washington announcing 15% tariffs on a wide range of Chinese goods from Sept. 1. Beijing hit back with retaliatory levies, and let its yuan currency fall sharply to offset some of the tariff pressure.",
    "China's August exports are expected to have grown 2% from a year earlier, according to the median estimate of 28 economists in the poll, slowing from a 3.3% rise in July.",
    "But they expect export growth to slow further in coming months, as evidenced by worsening export orders in both official and private factory surveys. More U.S. tariff measures will take effect on Oct. 1 and Dec. 15. ",
    "\"In our view, the impact of U.S. tariffs on Chinese external sector will likely kick in more notably in the fourth quarter,\" analysts from Bank of America Merrill Lynch wrote in a note.",
    "More extensive and costlier U.S. tariffs, along with weak domestic demand, is likely to make Beijing more open to policy easing in coming months, BofAML said. But even with additional support measures, it now predicts China's growth will cool to 5.7% in 2020, down from its previous forecast of 6.0%.",
    "IMPORTS STILL CONTRACTING",
    "China's imports in August likely contracted 6% from a year earlier, worsening slightly from a 5.6% decline in the preceding month, the poll showed. Sluggish domestic demand was likely the main factor in the decline, along with softening global commodity prices.",
    "Despite more than a year of growth boosting measures, domestic consumption and investment have remained weak, fueling expectations that more support is needed to prevent a sharper economic slowdown.",
    "Economists at UBS estimate the latest escalation of tariffs from Trump will lead to another 30 basis point drag on China's GDP growth in the following 12 months.",
    "In a signal that more policy loosening may be imminent, China's cabinet said on Wednesday that the country will implement both broad and targeted cuts in the reserve requirement ratio (RRR) for banks \"in a timely manner\", freeing up more funds for lending. ",
    "Some bankers and analysts also expect the PBOC to start cutting its key interest rates from this month. ",
    "U.S. President Donald Trump warned earlier this week he would be tougher on Beijing in a second term if trade talks dragged on, compounding market fears that the trade dispute between the two countries could trigger a global recession. ",
    "China and the United States agreed to hold high-level trade talks in early October in Washington, China's commerce ministry said on Thursday. "
  ],
  "published_datetime": "2019-09-05 02:04:00"
}