{
  "url": "https://www.nasdaq.com/article/amazons-gojek-investment-interest-to-boost-asian-presence-cm1206721",
  "title": "Amazon's Gojek Investment Interest to Boost Asian Presence - Nasdaq.com",
  "text": [
    "  Amazon AMZN  is making every effort to bolster presence in Asia by strengthening investments in uncharted territories.  makeArticleAd();  This is evident from its latest talks with Gojek, which is an Indonesia-based ride-hailing services company. Notably, the e-commerce giant is in early stages of talks to invest in Gojek in order to buy a stake in the startup.    The investment will offer Amazon a strong entry in Indonesia, which is one of the emerging markets of Southeast Asia due to rapid Internet usage penetration.    Further, the company's transportation initiatives will strengthen with investment in Gojek. Notably, Amazon holds several patents related to transport of passengers, on-demand transportation service through a network of self-driving vehicles and to name a few.   Indonesian Ride-Hailing Space Holds Promise    Per a report from Statista, ride hailing services market in Indonesia is expected to generate revenues of $3.6 billion in 2019. Further, the figure is likely to reach $8.3 billion by 2023 at a CAGR of 22.9% between 2019 and 2023.    Additionally, user penetration is pegged at 8% and 13.5% for 2019 and 2023, respectively.    Amazon will be able to foray into this market by investing in the widely popular and efficient, Gojek.    The competition is between Gojek and its primary rival, Grab, is likely to intensify if the deal materializes.    Further, if the investment plans materialize, Amazon's will be up against Alibaba BABA  , Alphabet GOOGL  , JD.com JD  and Tencent, which have already invested in Gojek in an attempt to reap benefits from this promising market.   Amazon.com, Inc. Price and Consensus        Amazon.com, Inc. price-consensus-chart    |   Amazon.com, Inc. Quote    Strengthening Asian Footprints  Apart from ride hailing services, Gojek offers online payments, food-delivery and other on-demand services like medicine and grocery delivery and courier services.    Consequently, Amazon's latest investment interest is expected to strengthen its presence in the abovementioned areas of the five Southeast Asian countries including Singapore, where Gojek has expanded operations.    Further, Amazon is witnessing strong Prime momentum in Singapore with Prime Now warehouse in the country. Outside of Southeast Asia, the company has been expanding presence in India rapidly on the back of its strengthening e-commerce services and regional content portfolio.    Additionally, the company owns several fulfillment centers in countries like India, Japan, China and Israel.    We believe growing investment activities of Amazon in Asia is likely to yield good returns in the long run as the emerging Asian countries hold immense growth potential driven by improving proliferation of smartphone and Internet.    Currently, Amazon carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here.    Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Amazon.com, Inc. (AMZN): Free Stock Analysis Report   Alibaba Group Holding Limited (BABA): Free Stock Analysis Report   JD.com, Inc. (JD): Free Stock Analysis Report   Alphabet Inc. (GOOGL): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Amazon AMZN  is making every effort to bolster presence in Asia by strengthening investments in uncharted territories.  makeArticleAd();  This is evident from its latest talks with Gojek, which is an Indonesia-based ride-hailing services company. Notably, the e-commerce giant is in early stages of talks to invest in Gojek in order to buy a stake in the startup.    The investment will offer Amazon a strong entry in Indonesia, which is one of the emerging markets of Southeast Asia due to rapid Internet usage penetration.    Further, the company's transportation initiatives will strengthen with investment in Gojek. Notably, Amazon holds several patents related to transport of passengers, on-demand transportation service through a network of self-driving vehicles and to name a few.   Indonesian Ride-Hailing Space Holds Promise    Per a report from Statista, ride hailing services market in Indonesia is expected to generate revenues of $3.6 billion in 2019. Further, the figure is likely to reach $8.3 billion by 2023 at a CAGR of 22.9% between 2019 and 2023.    Additionally, user penetration is pegged at 8% and 13.5% for 2019 and 2023, respectively.    Amazon will be able to foray into this market by investing in the widely popular and efficient, Gojek.    The competition is between Gojek and its primary rival, Grab, is likely to intensify if the deal materializes.    Further, if the investment plans materialize, Amazon's will be up against Alibaba BABA  , Alphabet GOOGL  , JD.com JD  and Tencent, which have already invested in Gojek in an attempt to reap benefits from this promising market.",
    "  Amazon.com, Inc. Price and Consensus        Amazon.com, Inc. price-consensus-chart    |   Amazon.com, Inc. Quote  ",
    " Amazon.com, Inc. Price and Consensus ",
    " Amazon.com, Inc. price-consensus-chart    |   Amazon.com, Inc. Quote ",
    " Strengthening Asian Footprints ",
    "Apart from ride hailing services, Gojek offers online payments, food-delivery and other on-demand services like medicine and grocery delivery and courier services.    Consequently, Amazon's latest investment interest is expected to strengthen its presence in the abovementioned areas of the five Southeast Asian countries including Singapore, where Gojek has expanded operations.    Further, Amazon is witnessing strong Prime momentum in Singapore with Prime Now warehouse in the country. Outside of Southeast Asia, the company has been expanding presence in India rapidly on the back of its strengthening e-commerce services and regional content portfolio.    Additionally, the company owns several fulfillment centers in countries like India, Japan, China and Israel.    We believe growing investment activities of Amazon in Asia is likely to yield good returns in the long run as the emerging Asian countries hold immense growth potential driven by improving proliferation of smartphone and Internet.    Currently, Amazon carries a Zacks Rank #3 (Hold). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here.    Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:51:00"
}