{
  "url": "https://www.nasdaq.com/article/has-cbre-group-cbre-outpaced-other-finance-stocks-this-year-cm1210453",
  "title": "Has CBRE Group (CBRE) Outpaced Other Finance Stocks This Year? - Nasdaq.com",
  "text": [
    " For those looking to find strong Finance stocks, it is prudent to search for companies in the group that are outperforming their peers. Is CBRE Group (CBRE) one of those stocks right now? By taking a look at the stock's year-to-date performance in comparison to its Finance peers, we might be able to answer that question. CBRE Group is one of 855 individual stocks in the Finance sector. Collectively, these companies sit at #7 in the Zacks Sector Rank. The Zacks Sector Rank gauges the strength of our 16 individual sector groups by measuring the average Zacks Rank of the individual stocks within the groups. The Zacks Rank is a proven system that emphasizes earnings estimates and estimate revisions, highlighting a variety of stocks that are displaying the right characteristics to beat the market over the next one to three months. CBRE is currently sporting a Zacks Rank of #2 (Buy). Over the past 90 days, the Zacks Consensus Estimate for CBRE's full-year earnings has moved 3.88% higher. This shows that analyst sentiment has improved and the company's earnings outlook is stronger. According to our latest data, CBRE has moved about 39.19% on a year-to-date basis. At the same time, Finance stocks have gained an average of 11.90%. This means that CBRE Group is outperforming the sector as a whole this year. To break things down more, CBRE belongs to the Real Estate - Operations industry, a group that includes 32 individual companies and currently sits at #101 in the Zacks Industry Rank. On average, this group has gained an average of 27.75% so far this year, meaning that CBRE is performing better in terms of year-to-date returns. Investors with an interest in Finance stocks should continue to track CBRE. The stock will be looking to continue its solid performance.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  CBRE Group, Inc. (CBRE): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "For those looking to find strong Finance stocks, it is prudent to search for companies in the group that are outperforming their peers. Is CBRE Group (CBRE) one of those stocks right now? By taking a look at the stock's year-to-date performance in comparison to its Finance peers, we might be able to answer that question.",
    "CBRE Group is one of 855 individual stocks in the Finance sector. Collectively, these companies sit at #7 in the Zacks Sector Rank. The Zacks Sector Rank gauges the strength of our 16 individual sector groups by measuring the average Zacks Rank of the individual stocks within the groups.",
    "The Zacks Rank is a proven system that emphasizes earnings estimates and estimate revisions, highlighting a variety of stocks that are displaying the right characteristics to beat the market over the next one to three months. CBRE is currently sporting a Zacks Rank of #2 (Buy).",
    "Over the past 90 days, the Zacks Consensus Estimate for CBRE's full-year earnings has moved 3.88% higher. This shows that analyst sentiment has improved and the company's earnings outlook is stronger.",
    "According to our latest data, CBRE has moved about 39.19% on a year-to-date basis. At the same time, Finance stocks have gained an average of 11.90%. This means that CBRE Group is outperforming the sector as a whole this year.",
    "To break things down more, CBRE belongs to the Real Estate - Operations industry, a group that includes 32 individual companies and currently sits at #101 in the Zacks Industry Rank. On average, this group has gained an average of 27.75% so far this year, meaning that CBRE is performing better in terms of year-to-date returns.",
    "Investors with an interest in Finance stocks should continue to track CBRE. The stock will be looking to continue its solid performance.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:30:11"
}