{
  "url": "https://www.nasdaq.com/article/stewart-information-fidelity-nationals-merger-falls-apart-cm1210537",
  "title": "Stewart Information & Fidelity National's Merger Falls Apart - Nasdaq.com",
  "text": [
    "  Stewart Information Services Corporation STC  and Fidelity National Financial's FNF  proposed merger falls apart, as the necessary approval by the U.S. Federal Trade Commission was not received. Markedly, Fidelity National agreed to acquire Stewart Information in a $1.2-billion cash-stock deal in March 2018.  makeArticleAd();  As agreed upon, Fidelity National will pay a reverse break-up fee of $50 million to Stewart Information, as the acquisition failed to materialize. In 2017, Stewart Information announced to review strategic alternatives and agreed to be acquired by Fidelity National.    While shares of Stewart Information gained 2.2% yesterday, that of Fidelity National lost 1.6%.    Notably, Stewart Information - a global real estate services company - has carved a niche for itself in the title insurance industry and announced that it will focus on growth of the company on a standalone basis, leveraging its strong brand and financial position. To that end, the company has announced several leadership changes: present director Frederick Eppinger will become Chief Executive Officer, Chief Executive Officer Matthew Morris will step into the position of President and President John Killea will take up the role of General Counsel and Chief Legal Officer, effective immediately.    Stewart Information has been witnessing declining revenues over the past three years. The company expects such strategic changes to boost top-line growth and pre-tax margin improvement, enable it to capitalize on growth opportunities and create value for its shareholders going forward.    Shares of Stewart Information have lost 16.6% year to date against the industry  's 5.5% growth. Nevertheless, a stable real estate market, favorable buyer demographics and interest rate cuts should help the stock to bounce back.         Both Stewart Information Services and Fidelity National carry a Zacks Rank #3 (Hold).   Stocks to Consider    Some better-ranked stocks from the property and casualty insurance industry are Hallmark Financial Services HALL  and Alleghany Y  , each sporting Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   . Hallmark Financial underwrites, markets, distributes, and services property/casualty insurance products to businesses and individuals in the United States The company delivered positive surprise of 20.00% in the las t report  ed quarter.      Alleghany provides property and casualty reinsurance and insurance products in the United States and internationally. The company delivered positive surprise of 30.80% in the last reported quarter.     Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.   See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Stewart Information Services Corporation (STC): Free Stock Analysis Report   Fidelity National Financial, Inc. (FNF): Free Stock Analysis Report   Alleghany Corporation (Y): Free Stock Analysis Report   Hallmark Financial Services, Inc. (HALL): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Stewart Information Services Corporation STC  and Fidelity National Financial's FNF  proposed merger falls apart, as the necessary approval by the U.S. Federal Trade Commission was not received. Markedly, Fidelity National agreed to acquire Stewart Information in a $1.2-billion cash-stock deal in March 2018.  makeArticleAd();  As agreed upon, Fidelity National will pay a reverse break-up fee of $50 million to Stewart Information, as the acquisition failed to materialize. In 2017, Stewart Information announced to review strategic alternatives and agreed to be acquired by Fidelity National.    While shares of Stewart Information gained 2.2% yesterday, that of Fidelity National lost 1.6%.    Notably, Stewart Information - a global real estate services company - has carved a niche for itself in the title insurance industry and announced that it will focus on growth of the company on a standalone basis, leveraging its strong brand and financial position. To that end, the company has announced several leadership changes: present director Frederick Eppinger will become Chief Executive Officer, Chief Executive Officer Matthew Morris will step into the position of President and President John Killea will take up the role of General Counsel and Chief Legal Officer, effective immediately.    Stewart Information has been witnessing declining revenues over the past three years. The company expects such strategic changes to boost top-line growth and pre-tax margin improvement, enable it to capitalize on growth opportunities and create value for its shareholders going forward.    Shares of Stewart Information have lost 16.6% year to date against the industry  's 5.5% growth. Nevertheless, a stable real estate market, favorable buyer demographics and interest rate cuts should help the stock to bounce back.",
    "   Both Stewart Information Services and Fidelity National carry a Zacks Rank #3 (Hold).   Stocks to Consider    Some better-ranked stocks from the property and casualty insurance industry are Hallmark Financial Services HALL  and Alleghany Y  , each sporting Zacks Rank #1 (Strong Buy). You can see  the complete list of today's Zacks #1 Rank stocks   here   .",
    "Hallmark Financial underwrites, markets, distributes, and services property/casualty insurance products to businesses and individuals in the United States The company delivered positive surprise of 20.00% in the las t report  ed quarter.      Alleghany provides property and casualty reinsurance and insurance products in the United States and internationally. The company delivered positive surprise of 30.80% in the last reported quarter.     Looking for Stocks with Skyrocketing Upside?    Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:48:00"
}