{
  "url": "https://www.nasdaq.com/article/refilestrong-sterling-knocks-ftse-100-despite-trade-lull-20190905-00862",
  "title": "REFILE-Strong sterling knocks FTSE 100 despite trade lull - Nasdaq.com",
  "text": [
    " (Reinstates dropped word 'said' in para 7)",
    "* FTSE 100 down 0.6%, FTSE 250 up 0.2%",
    "* Exporter stocks fall as pound surges ",
    "* Online retailer Boohoo jumps after forecast upgrade",
    "* Industrials up on upbeat forecast from European peers",
    "By Muvija M and Indranil Sarkar",
    "Sept 5 (Reuters) - London's FTSE 100 slipped on Thursday asa surge in sterling pushed exporter stocks lower, missing out ona global rally led by growing hopes of a resolution to theU.S.-China trade dispute. ",
    "The FTSE 100 .FTSE slid 0.6%, with multinationalsincluding spirits company DiageoDGE.L , pharma giantsAstraZeneca AZN.L and GlaxoSmithKline GSK.L slipping about3% as a strong pound meant the value of their U.S. earnings waslower.",
    "Sterling recorded its biggest two-day rise in 10 months asno-deal Brexit worries took a break, after lawmakers voted toprevent Prime Minister Boris Johnson from taking Britain out ofthe European Union without a deal on Oct. 31. urn:newsml:reuters.com:*:nL5N25W2OF",
    "Strength in the local currency lifted the more domesticallyfocussed mid-cap index .FTMC by 0.2%, despite a 21% slump inCYBG CYBGC.L to an all-time low. The Yorkshire Bank and VirginMoney owner said it expected to increase its provision forlegacy payment protection insurance costs. urn:newsml:reuters.com:*:nL5N25V0YV",
    "Stocks trading without dividend entitlement on the day suchas BHP BHPB.L , GlencoreGLEN.L and Micro FocusMCRO.L fellbetween 1.2%-3%, weighing heavily on the blue-chip index. MicroFocus is also set to be relegated from the index later thismonth. urn:newsml:reuters.com:*:nL5N25V5PM",
    "Meanwhile, indexes on Wall Street and Europe scaled aone-month high as agreement by China and the United States tohold high-level trade talks in October spurred hopes that thetrade dispute between the countries would be resolved. urn:newsml:reuters.com:*:nL3N25W0JF",
    "\"If one was feeling cynical, Thursday's rally could be usedto illustrate investors' refusal to learn from their pastmistakes, stung time and time again by a pair of superpowers whonever manage to deliver on their trade talk promises,\" saidSpreadex analyst Connor Campbell.",
    "The FTSE 100 had suffered its only monthly fall this year inAugust when trade tensions escalated between the world's largesteconomies. ",
    "As investors turned to riskier assets on account of renewedtrade hopes and away from safe haven gold, precious metals minerFresnillo FRES.L tumbled nearly 6% and was the steepest falleron the FTSE 100.",
    "Industrial giants BAE SystemsBAES.L and Rolls-RoyceRR.L helped limit the index's fall with gains of 1% each afterFrench engine maker SafranSAF.PA hiked a profit forecast andRafale warplanes maker Dassault AviationAVMD.PA affirmed ahigher net sales target.",
    "Another prominent gainer was turnaround specialist Melrose MRON.L which jumped 9% after its first-half profit beatestimates.          ",
    "On the mid-cap bourse, specialist media services companyFuture Plc FUTR.L surged 10% after upbeat forecast, whilepayments solutions provider Network InternationalNETW.L lost7.5% as its major shareholder Emirates NBD Bank sold stock at adiscount. urn:newsml:reuters.com:*:nL3N25W1YF",
    "AIM-listed online fashion retailer Boohoo BOOH.L shot upby 15.1% to a life high after raising its annual revenue growthforecast and small-cap oil firm EnQuestENQ.L climbed 7% afteraffirming its full-year production view and cutting debt. urn:newsml:reuters.com:*:nL5N25W16M (Reporting by Shashwat Awasthi, Muvija M and Indranil Sarkar inBengaluru; Editing by Bernard Orr) ((Shashwat.Awasthi@thomsonreuters.com; within UK: +1 646 2233403; outside UK: +91 80 61822606, +91 80 37962606;))",
    "(( For related prices, Reuters users may click on - *  UK stock report     .L     FTSE index:         0#.FTS6  techMARK 100 index: .FTT1X         FTSE futures:     0#FFI:  Gilt futures:       0#FLG:         Smallcap index:    .FTSC  FTSE 250 index:     .FTMC          FTSE 350 index:    .FTLC  Market digest:      .AD.L          Top 10 by vol:     .AV.L  Top price gainers:  .NG.L          Top % gainers:     .PG.L  Top price losers:   .NL.L          Top % losers:      .PL.L",
    "  * For related news, click on - * UK hot stocks:      [HOT and GB]     Wall Street:          .N  Gilts report:       GB/            Euro bond report GVD/EUR  Pan European stock report: .EUTokyo stocks:       .T             HK stocks:           .HK  Sterling report:    GBP/           Dollar report:      USD/",
    "  * For company prices, click on - * Company directory:  UKEQ          By sector:          FTAX",
    "  * For pan-European market data, click on - * European Equities speed guide................ EUR/EQUITY  FTSE Eurotop 300 index........................... .FTEU3  DJ STOXX index................................... .STOXX  Top 10 STOXX sectors........................ .PGL.STOXXS  Top 10 EUROSTOXX sectors................... .PGL.STOXXES  Top 10 Eurotop 300 sectors.................. .PGL.FTEU3S  Top 25 European pct gainers.................... .PG.PEUR  Top 25 European pct losers..................... .PL.PEUR ))"
  ],
  "published_datetime": "2019-09-05 01:00:00"
}