{
  "url": "https://www.nasdaq.com/article/the-stock-market-is-still-in-the-battle-zone-cm1206833",
  "title": "The Stock Market Is Still in the Battle Zone - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "The stock market dodged a bullet in August. It may not be quite so lucky in September.",
    "Let me explain…",
    "For the month of August, the S&P 500 lost almost 2%. That's not good. But, it's nowhere near as bad as it looked a week ago, and nowhere near as bad as it could have been. If the market had broken to the downside of its recent trading range - which it looked close to doing so last week - the target for the S&P 500 would have been around 2750.",
    "That's not a disaster. It's a drop of only about 9% from the all-time high reached in July. It would have been painful, for sure. But most folks could probably handle it.",
    "What is much more difficult to handle would have been the bearish setup that sort of move would have created on the long-term chart.",
    "Take a look at this monthly chart of the S&P 500 plotted along with its 20-month  exponential moving average (EMA) …",
    "Longtime readers know I use this chart to determine the long-term trend of the broad stock market. If the S&P 500 is trading above its 20-month EMA, then we're in a bull market. If the index is below the line, then the bear is in charge.",
    "If the S&P 500 had declined to the lower target of about 2750, then it would have closed the month of August below its 20-month EMA. And that would have called into question the viability of the long-term bull market.",
    "So, like I said… the market dodged a bullet.",
    "But it's still in the battle zone. It won't take much of a decline in September to shift the longer-term trend to bearish. And, with the significant negative divergence on momentum indicators like the  MACD  and  RSI , the next decline phase could be a BIG one.",
    "For now, though, we can all breathe a collective sigh of relief. The market didn't fall apart in August. And  the short-term pattern looks more bullish than bearish . But, traders should keep a watchful eye on this long-term chart of the S&P as we get through September. It could be setting us up for a scary October.",
    "Best regards and good trading,",
    "Jeff Clark",
    "P.S.  While there's the potential for a scary October, I'm not worried… It's a trader's market right now. That's because no matter which way the market moves, traders can make a fortune - especially if they use my strategy.",
    "It's the strategy I use in  Jeff Clark Trader . I handpick just three stocks to trade - over and over again - to help you fund a comfortable retirement. And these three stocks are the best ways to make money off this volatile market… no matter how much experience you have with trading options.",
    "Click here and see what  Jeff Clark Trader  is all about. It's only $19 for a whole year. But you'll want to act quickly - that price won't last long.",
    "America's Top Options Expert",
    "For the past 36 years, millionaire trader Jeff Clark's options strategies have helped everyday people have the chance to retire wealthy.",
    "Which is why Jeff's now offering his complete Blueprint, and a year of his guidance, for just $19.",
    "That's right… for a limited time it's all yours for less than 20 bucks.",
    "Because Jeff knows that every $1 you use on his strategies could turn into a windfall in a short amount of time.",
    "Get started here.",
    "The post The Stock Market Is Still in the Battle Zone appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:16:31"
}