{
  "url": "https://www.nasdaq.com/article/why-shares-of-usa-technologies-are-crashing-today-cm1207439",
  "title": "Why Shares of USA Technologies Are Crashing Today - Nasdaq.com",
  "text": [
    " What happened Shares of   USA Technologies    (NASDAQ: USAT) fell more than 17% on Wednesday morning after the   networking and cashless transaction company admitted it is   unlikely to meet a Sept. 9 deadline to file its financial   statements with the Securities and Exchange Commission. The   company is seeking additional time, but if it fails to get it,   USA Technologies could face a delisting due to its issues. So what USA Technologies has had a tough run in 2019, with its shares   losing more than half of their value on one February day   after the company revealed its auditor, RSM, was   resigning    . In conjunction with the resignation, USA Technologies' board   said that some financial statements and related press releases   are not reliable.   Image source: Getty Images.makeArticleAd();  The issues surfaced during   an internal probe     that USA Technologies initiated late last year. USA   Technologies is behind in filing its annual report for the fiscal   year ending June 30, 2018, and recen   t quarterly   report    s. USA Technologies is not in compliance with Nasdaq listing   rules, which require companies to timely file all required   periodic financial reports, but it believes it will be able to   file by Sept. 23. USA Technologies has submitted a letter to the   Nasdaq Hearings Panel requesting an exemption until that date to   get into compliance. Now what There is no assurance that the Nasdaq panel will grant the   extension, though the exchanges tend to give companies   considerable leeway if they are attempting to be as transparent   with investors as possible and are seemingly working toward   resolving their issues. USA Technologies seems to be on the right   track. The company has some heavy hitters in its camp. Hedge fund   Hudson Executive Capital, which is run by former   JPMorgan Chase     CFO Douglas Braunstein,   disclosed a 12% stake     in May. USA Technologies has its share of challenges, and is a long   way from being among the   top tech stocks to invest in    . But the market's reaction on Wednesday seems overdone. For   investors with a high risk tolerance, this is a situation worth   watching closely.   10 stocks we like better than USA Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and USA Technologies wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Lou Whiteman      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of   USA Technologies    (NASDAQ: USAT) fell more than 17% on Wednesday morning after the   networking and cashless transaction company admitted it is   unlikely to meet a Sept. 9 deadline to file its financial   statements with the Securities and Exchange Commission. The   company is seeking additional time, but if it fails to get it,   USA Technologies could face a delisting due to its issues.",
    "USA Technologies has had a tough run in 2019, with its shares   losing more than half of their value on one February day   after the company revealed its auditor, RSM, was   resigning    . In conjunction with the resignation, USA Technologies' board   said that some financial statements and related press releases   are not reliable.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "The issues surfaced during   an internal probe     that USA Technologies initiated late last year. USA   Technologies is behind in filing its annual report for the fiscal   year ending June 30, 2018, and recen   t quarterly   report    s.",
    "USA Technologies is not in compliance with Nasdaq listing   rules, which require companies to timely file all required   periodic financial reports, but it believes it will be able to   file by Sept. 23. USA Technologies has submitted a letter to the   Nasdaq Hearings Panel requesting an exemption until that date to   get into compliance.",
    "There is no assurance that the Nasdaq panel will grant the   extension, though the exchanges tend to give companies   considerable leeway if they are attempting to be as transparent   with investors as possible and are seemingly working toward   resolving their issues. USA Technologies seems to be on the right   track.",
    "The company has some heavy hitters in its camp. Hedge fund   Hudson Executive Capital, which is run by former   JPMorgan Chase     CFO Douglas Braunstein,   disclosed a 12% stake     in May.",
    "USA Technologies has its share of challenges, and is a long   way from being among the   top tech stocks to invest in    . But the market's reaction on Wednesday seems overdone. For   investors with a high risk tolerance, this is a situation worth   watching closely.",
    "  10 stocks we like better than USA Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and USA Technologies wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than USA Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and USA Technologies wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Lou Whiteman      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:54:00"
}