{
  "url": "https://www.nasdaq.com/article/a-big-bet-on-india-and-southeast-asia-will-give-amzn-its-next-leg-up-cm1210682",
  "title": "A Big Bet on India and Southeast Asia Will Give AMZN Its Next Leg Up - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "Amazon (NASDAQ: AMZN ) stock might have been trading sideways for the last one year, but the bull run is far from over for AMZN stock. Being a $900 billion market capitalization company, Amazon can be discussed from various perspectives and business segments. This coverage will focus on the potential growth markets for AMZN in the next 3-5 years.",
    "According to PwC , India's contribution to the global middle class consumption would be at par with China by 2025. Further, by 2027, India's middle class is expected to overtake that of U.S. and China.",
    "To put things into perspective, Alibaba Group (NYSE: BABA ) reported annual revenue of $56 billion for the year ended March 2019. Further, JD.com (NASDAQ: JD ) reported annual revenue of $67 billion for the year ended December 2018.",
    "If we compare this with India's largest e-commerce players, Amazon India reported revenue of $3.2 billion for the last financial year. Further, Walmart's (NYSE: WMT ) Flipkart reported revenue of $3.8 billion for the same period.",
    "The key point is - if India's consumption surges in the next 5-7 years, the two biggest players will multiply their revenue by 10 to 15 times. Even amidst competition from other players.",
    "It is therefore not surprising to see AMZN bear losses in India as it tries to fight competition and increase its customer base.",
    "Recently, AMZN opened its largest campus in the world in India. This is Amazon's first office outside the United States and will house more than 15,000 employees. It is a sign that the company is betting big on India.",
    "The launch of Amazon fresh is also a move towards making inroads in the grocery market, which has an estimated market size of $500 billion. Importantly, only 0.2% of the market size is online and the potential is huge even if online share increases to 5% or 10%. Of course, it's not happening overnight, but there is no doubt on impending growth.",
    "Clearly, Amazon stands to benefit from the huge untapped potential in India.",
    "Amazon has not been very aggressive in terms of inorganic growth in the past. However, the company might be looking at acquisitions to make inroads in the Southeast Asian markets.",
    "Before talking about the SEA markets, I would like to mention that AMZN reported cash and equivalents of $41 billion as of June 2019. With ample cash buffer, the company the company has headroom for acquisitions.",
    "My view is strengthened by reports that Amazon is looking to invest in Gojek to boost presence in Southeast Asia. With intense competition, it makes sense to acquire and gain market share than to grow organically.",
    "If Amazon does buy stake in Gojek, it would be a bullish move considering the Indonesian market potential. The country is home to 260 million people and is one of the fastest growing e-commerce markets in the world.",
    "Alibaba Group has an advantage in the Southeast Asian markets with investment in Lazada . The latter is the largest player in the e-commerce market in Southeast Asia. However, with low e-commerce penetration, the market has headroom to absorb more players.",
    "AMZN has been delivering 20% revenue growth (on an average) and I believe that the growth momentum will sustain in the coming years.",
    "In particular, I am bullish on the company's plans for new markets. I believe that India and Southeast Asia can support strong growth in the next 5 years.",
    "However, that does not imply that growth will not sustain in other regions. It is worth mentioning that even with the U.S. manufacturing sector in recession, the consumer confidence remains high. With expansionary monetary policies, Amazon is likely to benefit. The upcoming festive season also provides a near-term growth trigger.",
    "Further, even with strong competition in the content streaming segment, Amazon Prime has the advantage of higher financial muscles. Netflix (NASDAQ: NFLX ) is faced with sustained cash burn and does not have the financial headroom even close to Amazon. I believe Amazon will continue to have an edge when it comes to investment in content creation and acquisition.",
    "Overall, Amazon stock is worth buying at current levels and I believe that the stock is set to surge higher after the current consolidation.",
    "As of this writing, Faisal Humayun did not hold a position in any of the aforementioned securities.",
    "The post A Big Bet on India and Southeast Asia Will Give AMZN Its Next Leg Up appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:37:56"
}