{
  "url": "https://www.nasdaq.com/article/why-is-becton-dickinson-bdx-up-41-since-last-earnings-report-cm1208065",
  "title": "Why Is Becton Dickinson (BDX) Up 4.1% Since Last Earnings Report? - Nasdaq.com",
  "text": [
    " A month has gone by since the las t earnings  report for Becton Dickinson (BDX). Shares have added about 4.1% in that time frame, outperforming the S&P 500. Will the recent positive trend continue leading up to its next earnings release, or is Becton Dickinson due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important drivers.  Becton, Dickinson Beats on Q3 Earnings, Guidance   Intact  BD reported third-quarter fiscal 2019 EPS of $3.08, which beat the Zacks Consensus Estimate of $3.05. The bottom line also improved 5.8% on a year-over-year basis and rose 14.8% at cc. The company raked in revenues of $4.35 billion, surpassing the Zacks Consensus Estimate by 0.06%. The reported figure increased 0.6% from the year-ago quarter. At cc, revenues rose 5.7%.  Segment Details   BD Medical  In the quarter under review, BD Medical segmen t report  ed worldwide revenues of $2.31 billion, up 2.9% from the year-ago quarter and 6% at cc. Per management, the segment's results were driven by performance in the Medication Management Solutions, Medication Delivery Solutions and Pharmaceutical Systems units.  BD Life Sciences  Worldwide revenues in the segment totaled $1.06 billion, down 1.9% year over year but increased 5.4% at cc.  BD Interventional  This segment generated worldwide revenues of $0.98 billion, up 2.8% from the year-ago quarter. At cc, revenues grew 5.2%. The segment's results reflect strong performance by the Urology and Critical Care and Surgery sub-units.  Geographic Results   US  In the fiscal third quarter, revenues in the United States improved 4.4% to $2.44 billion. Revenues grew 5% at cc. Per management, growth in the United States was driven by performance of the BD Medical and BD Interventional segments.  International  Revenues outside the United States grossed $1.91 billion, down 1.6% from the year-ago quarter. At cc, the segment grew 6.5%. Per management, international revenue growth in the third quarter was strong in China and EMEA.  Margin Analysis  In the quarter, gross profit amounted to $2.07 billion, up 2.9% from the prior-year quarter tally. Gross margin was 47.7%, up 60 bps from the prior-year quarter. Operating income in the quarter grossed $626 million, down 22.3% from the year-ago quarter. As a percentage of revenues, operating margin in the quarter was 14.4%, up 240 bps year over year. Adjusted operating income amounted to $716 million, up 9.6% from the year-ago figure.  Guidance Reaffirmed  For fiscal 2019, the company continues to expect revenue growth of 8-9%. At cc, revenues are anticipated to increase 5-6%. Adjusted EPS is expected between $11.65 and $11.75, indicating growth of 12% at cc. However, this includes unfavorable impact of foreign currency.   How Have Estimates Been Moving Since Then?  In the past month, investors have witnessed a downward trend in fresh estimates.  VGM Scores  At this time, Becton Dickinson has a nice Growth Score of B, a grade with the same score on the momentum front. Charting a somewhat similar path, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy. Overall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Becton Dickinson has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Becton, Dickinson and Company (BDX): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "A month has gone by since the las t earnings  report for Becton Dickinson (BDX). Shares have added about 4.1% in that time frame, outperforming the S&P 500.",
    "Will the recent positive trend continue leading up to its next earnings release, or is Becton Dickinson due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important drivers.  Becton, Dickinson Beats on Q3 Earnings, Guidance   Intact  BD reported third-quarter fiscal 2019 EPS of $3.08, which beat the Zacks Consensus Estimate of $3.05. The bottom line also improved 5.8% on a year-over-year basis and rose 14.8% at cc. The company raked in revenues of $4.35 billion, surpassing the Zacks Consensus Estimate by 0.06%. The reported figure increased 0.6% from the year-ago quarter. At cc, revenues rose 5.7%.  Segment Details   BD Medical  In the quarter under review, BD Medical segmen t report  ed worldwide revenues of $2.31 billion, up 2.9% from the year-ago quarter and 6% at cc. Per management, the segment's results were driven by performance in the Medication Management Solutions, Medication Delivery Solutions and Pharmaceutical Systems units.  BD Life Sciences  Worldwide revenues in the segment totaled $1.06 billion, down 1.9% year over year but increased 5.4% at cc.  BD Interventional  This segment generated worldwide revenues of $0.98 billion, up 2.8% from the year-ago quarter. At cc, revenues grew 5.2%. The segment's results reflect strong performance by the Urology and Critical Care and Surgery sub-units.  Geographic Results   US  In the fiscal third quarter, revenues in the United States improved 4.4% to $2.44 billion. Revenues grew 5% at cc. Per management, growth in the United States was driven by performance of the BD Medical and BD Interventional segments.  International  Revenues outside the United States grossed $1.91 billion, down 1.6% from the year-ago quarter. At cc, the segment grew 6.5%. Per management, international revenue growth in the third quarter was strong in China and EMEA.  Margin Analysis  In the quarter, gross profit amounted to $2.07 billion, up 2.9% from the prior-year quarter tally. Gross margin was 47.7%, up 60 bps from the prior-year quarter. Operating income in the quarter grossed $626 million, down 22.3% from the year-ago quarter. As a percentage of revenues, operating margin in the quarter was 14.4%, up 240 bps year over year. Adjusted operating income amounted to $716 million, up 9.6% from the year-ago figure.  Guidance Reaffirmed  For fiscal 2019, the company continues to expect revenue growth of 8-9%. At cc, revenues are anticipated to increase 5-6%. Adjusted EPS is expected between $11.65 and $11.75, indicating growth of 12% at cc. However, this includes unfavorable impact of foreign currency. ",
    " Becton, Dickinson Beats on Q3 Earnings, Guidance   Intact ",
    "BD reported third-quarter fiscal 2019 EPS of $3.08, which beat the Zacks Consensus Estimate of $3.05. The bottom line also improved 5.8% on a year-over-year basis and rose 14.8% at cc.",
    "The company raked in revenues of $4.35 billion, surpassing the Zacks Consensus Estimate by 0.06%. The reported figure increased 0.6% from the year-ago quarter. At cc, revenues rose 5.7%.",
    " Segment Details ",
    " BD Medical ",
    "In the quarter under review, BD Medical segmen t report  ed worldwide revenues of $2.31 billion, up 2.9% from the year-ago quarter and 6% at cc. Per management, the segment's results were driven by performance in the Medication Management Solutions, Medication Delivery Solutions and Pharmaceutical Systems units.",
    " BD Life Sciences ",
    "Worldwide revenues in the segment totaled $1.06 billion, down 1.9% year over year but increased 5.4% at cc.",
    " BD Interventional ",
    "This segment generated worldwide revenues of $0.98 billion, up 2.8% from the year-ago quarter. At cc, revenues grew 5.2%. The segment's results reflect strong performance by the Urology and Critical Care and Surgery sub-units.",
    " Geographic Results ",
    " US ",
    "In the fiscal third quarter, revenues in the United States improved 4.4% to $2.44 billion. Revenues grew 5% at cc. Per management, growth in the United States was driven by performance of the BD Medical and BD Interventional segments.",
    " International ",
    "Revenues outside the United States grossed $1.91 billion, down 1.6% from the year-ago quarter. At cc, the segment grew 6.5%. Per management, international revenue growth in the third quarter was strong in China and EMEA.",
    " Margin Analysis ",
    "In the quarter, gross profit amounted to $2.07 billion, up 2.9% from the prior-year quarter tally. Gross margin was 47.7%, up 60 bps from the prior-year quarter.",
    "Operating income in the quarter grossed $626 million, down 22.3% from the year-ago quarter. As a percentage of revenues, operating margin in the quarter was 14.4%, up 240 bps year over year.",
    "Adjusted operating income amounted to $716 million, up 9.6% from the year-ago figure.",
    " Guidance Reaffirmed ",
    "For fiscal 2019, the company continues to expect revenue growth of 8-9%. At cc, revenues are anticipated to increase 5-6%.",
    "Adjusted EPS is expected between $11.65 and $11.75, indicating growth of 12% at cc. However, this includes unfavorable impact of foreign currency.",
    " How Have Estimates Been Moving Since Then? ",
    "In the past month, investors have witnessed a downward trend in fresh estimates.",
    " VGM Scores ",
    "At this time, Becton Dickinson has a nice Growth Score of B, a grade with the same score on the momentum front. Charting a somewhat similar path, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Becton Dickinson has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:31:21"
}