{
  "url": "https://www.nasdaq.com/article/forexsinous-trade-thaw-sparks-risk-rally-as-ecb-looms-20190912-00016",
  "title": "FOREX-Sino-U.S. trade thaw sparks risk rally as ECB looms - Nasdaq.com",
  "text": [
    "    * Risk currencies rally after Trump postpones tariffs",
    "* Dollar at six-week peak vs yen, yuan jumps",
    "* Euro slides ahead of ECB meeting",
    "SINGAPORE, Sept 12 (Reuters) - The dollar rose to a six-weekhigh against the safe-haven yen on Thursday after an exchange ofolive branches between Washington and Beijing on trade stokedinvestors' appetite for risk.",
    "Export-driven Asian currencies from Taiwan to Australiarallied on the buoyant mood as the world's two largest economieseach granted concessions in their heated tariff dispute.",
    "The improved sentiment comes in an otherwise cautious weekin foreign exchange, as investors await a key European CentralBank meeting later on Thursday, at which policymakers areexpected to ease policy to support flagging growth.",
    "China on Wednesday exempted a basket of U.S. goods from its tariffs, while U.S. President Donald Trump said in a tweet hewould delay a scheduled tariff hike by two weeks in October.",
    "\"The nascent thaw in U.S. and China trade relations appearsto be gathering momentum,\" said Jeffrey Halley, senior marketanalyst for Asia Pacific at brokerage OANDA in Singapore, whoadded a warning that it was unlikely to last.",
    "\"Just as the presidential tweet on tariffs this morning hasinjected more momentum...we are only one social media postingaway from a thoroughly unpredictable President turning sentimenton its head,\" he said.    ",
    "The ebbing hostilities supported broader \"risk-on\" trading.Asian currencies climbed and stocks rose. Safety assets such asbonds and the yen were sold.",
    "The yen JPY=EBS dropped 0.5% against a rising Australiandollar AUD=D3 and hit 108.16 against the greenback, itsweakest since Aug. 1. The Aussie hit a six-week high and theChinese yuan CNH= rose 0.4% to a three-week high of 7.0855against the dollar.",
    "The Taiwan dollar had its best day in a month, rising 0.5%to 30.948 per U.S. dollar. The South Korean won KRW= stood at1183.08 per dollar, its strongest since the end of July.",
    "Outside of Asia, expectations for ECB easing this week haveweighed on the euro. The single currency EUR=EBS has shed 3.5%since June and fell to a one-week low of $1.0983 overnight. Itwas steady at $1.1013 by mid-session in Asia.",
    "With growth slowing, the ECB has all but promised moresupport for the economy in one of the most closely watchedmeetings in years. urn:newsml:reuters.com:*:nL5N2622HL",
    "The ECB is almost certain to cut rates, promise to keeprates low for longer and provide banks relief from the sideeffects of negative rates. However, new asset purchases, pricedin by markets, are not a done deal with some conservativepolicymakers opposing the move.",
    "\"Market reaction will likely hinge on the confirmation of arate cut,\" said David de Garis, a director of economics andmarkets at National Australia Bank in London.",
    "\"The real kicker though will not be whether QE isre-started, but crucially, whether it leaves markets feeling theECB is running out of room, or hamstrung by internalopposition,\" he said. \"What markets would not want to hear isduring the press conference evidence of a disagreement.\"",
    "Sterling also dipped after a Scottish court ruled onWednesday that Prime Minister Boris Johnson's suspension of theBritish Parliament was unlawful, prompting immediate calls forlawmakers to return to work as the government and Parliamentbattle over the future of Brexit. urn:newsml:reuters.com:*:nL5N2620Z5",
    "The British pound GBP=D3 fell as much as 0.4% to $1.2313overnight, and hovered around $1.2330 in Asian hours.",
    " (Reporting by Tom Westbrook; Editing by Sam Holmes) ((tom.westbrook@tr.com; +61466355340;))"
  ],
  "published_datetime": "2019-09-12 12:59:00"
}