{
  "url": "https://www.nasdaq.com/article/top-ranked-income-stocks-to-buy-for-september-5th-cm1208216",
  "title": "Top Ranked Income Stocks to Buy for September 5th - Nasdaq.com",
  "text": [
    "Here are four stocks with buy rank and strong income characteristics for investors to consider today, September 5th:",
    "Navios Maritime Partners LP(NMM) : This operator of dry cargo carriers has witnessed the Zacks Consensus Estimate for its current year earnings increasing 59.7% over the last 60 days.",
    "Navios Maritime Partners LP price-consensus-chart | Navios Maritime Partners LP Quote",
    "This Zacks Rank #1 (Strong Buy) company has a dividend yield of 7.2%, compared with the industry average of 0%. Its five-year avera ge dividend yield is 13.9%.",
    "Navios Maritime Partners LP dividend-yield-ttm | Navios Maritime Partners LP Quote",
    "Consolidated Communications Holdings, Inc. (CNSL): This telecommunications company has witnessed the Zacks Consensus Estimate for its current year earnings increasing 45.5% over the last 60 days.",
    "Consolidated Communications Holdings, Inc. price-consensus-chart | Consolidated Communications Holdings, Inc. Quote",
    "This Zacks Rank #2 (Buy) company has a dividend yield of 38.5%, compared with the industry average of 0%. Its five-year average dividend yield is 10%.",
    "Consolidated Communications Holdings, Inc. dividend-yield-ttm | Consolidated Communications Holdings, Inc. Quote",
    "Franklin Street Properties Corp. (FSP): This real estate investment trust company has witnessed the Zacks Consensus Estimate for its current year earnings increasing 2.4% over the last 60 days.",
    "Franklin Street Properties Corp. price-consensus-chart | Franklin Street Properties Corp. Quote",
    "This Zacks Rank #2 company has a dividend yield of 4.7%, compared with the industry average of 4.3%. Its five-year average dividend yield is 6.3%.",
    "Franklin Street Properties Corp. dividend-yield-ttm | Franklin Street Properties Corp. Quote",
    "Avianca Holdings S.A. (AVH): This airline has witnessed the Zacks Consensus Estimate for its current year earnings increasing more than 100% over the last 60 days.",
    "Avianca Holdings S.A. price-consensus-chart | Avianca Holdings S.A. Quote",
    "This Zacks Rank #2 company has a dividend yield of 4.7%, compared with the industry average of 0%. Its five-year average dividend yield is 3.6%.",
    "Avianca Holdings S.A. dividend-yield-ttm | Avianca Holdings S.A. Quote",
    "See the full list of top ranked stocks here.",
    "Find more top income stocks with some of our great premium screens.",
    "It's Illegal in 42 States, But Investors Will Make Billions Legally",
    "In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    "That's twice as much as they spend on marijuana, legally or otherwise.",
    "Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special Report revealing 5 top stocks to watch in this space.",
    "See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 11:47:00"
}