{
  "url": "https://www.nasdaq.com/article/illumina-ilmn-stock-sinks-as-market-gains-what-you-should-know-cm1207610",
  "title": "Illumina (ILMN) Stock Sinks As Market Gains: What You Should Know - Nasdaq.com",
  "text": [
    " Illumina (ILMN) closed the most recent trading day at $271.71, moving -0.17% from the previous trading session. This move lagged the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%. Heading into today, shares of the genetic testing tools company had lost 6.77% over the past month, lagging the Medical sector's loss of 1.27% and the S&P 500's loss of 0.68% in that time. ILMN will be looking to display strength as it nears its nex t earnings  release. The company is expected to report EPS of $1.41, down 7.24% from the prior-year quarter. Meanwhile, our latest consensus estimate is calling for revenue of $870.91 million, up 2.1% from the prior-year quarter. For the full year, our Zacks Consensus Estimates are projecting earnings of $6.04 per share and revenue of $3.52 billion, which would represent changes of +5.59% and +5.64%, respectively, from the prior year. Investors might also notice recent changes to analyst estimates for ILMN. These recent revisions tend to reflect the evolving nature of short-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. ILMN is currently a Zacks Rank #4 (Sell). Digging into valuation, ILMN currently has a Forward P/E ratio of 45.04. This valuation marks a premium compared to its industry's average Forward P/E of 26.54. Meanwhile, ILMN's PEG ratio is currently 2.54. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Medical - Biomedical and Genetics industry currently had an average PEG ratio of 1.73 as of yesterday's close. The Medical - Biomedical and Genetics industry is part of the Medical sector. This industry currently has a Zacks Industry Rank of 95, which puts it in the top 38% of all 250+ industries. The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Illumina, Inc. (ILMN): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Illumina (ILMN) closed the most recent trading day at $271.71, moving -0.17% from the previous trading session. This move lagged the S&P 500's daily gain of 1.08%. Meanwhile, the Dow gained 0.91%, and the Nasdaq, a tech-heavy index, added 1.31%.",
    "Heading into today, shares of the genetic testing tools company had lost 6.77% over the past month, lagging the Medical sector's loss of 1.27% and the S&P 500's loss of 0.68% in that time.",
    "ILMN will be looking to display strength as it nears its nex t earnings  release. The company is expected to report EPS of $1.41, down 7.24% from the prior-year quarter. Meanwhile, our latest consensus estimate is calling for revenue of $870.91 million, up 2.1% from the prior-year quarter.",
    "For the full year, our Zacks Consensus Estimates are projecting earnings of $6.04 per share and revenue of $3.52 billion, which would represent changes of +5.59% and +5.64%, respectively, from the prior year.",
    "Investors might also notice recent changes to analyst estimates for ILMN. These recent revisions tend to reflect the evolving nature of short-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.",
    "Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.",
    "The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. ILMN is currently a Zacks Rank #4 (Sell).",
    "Digging into valuation, ILMN currently has a Forward P/E ratio of 45.04. This valuation marks a premium compared to its industry's average Forward P/E of 26.54.",
    "Meanwhile, ILMN's PEG ratio is currently 2.54. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Medical - Biomedical and Genetics industry currently had an average PEG ratio of 1.73 as of yesterday's close.",
    "The Medical - Biomedical and Genetics industry is part of the Medical sector. This industry currently has a Zacks Industry Rank of 95, which puts it in the top 38% of all 250+ industries.",
    "The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.",
    "Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:50:10"
}