{
  "url": "https://www.nasdaq.com/article/germany-aims-to-host-libya-conference-to-stabilise-oil-producer-20190911-00612",
  "title": "Germany aims to host Libya conference to stabilise oil producer - Nasdaq.com",
  "text": [
    "By Ulf Laessing and Mahmoud Mourad",
    "CAIRO, Sept 11 (Reuters) - Germany aims to host a conference about Libya this year in conjunction with the United Nations to try to stabilise the oil- producing country, where rival factions have been fighting over the capital, Germany's ambassador to Libya said on Wednesday.",
    "The plans, which are still in the early stages according to diplomats, are the first major diplomatic push since eastern forces loyal to Khalifa Haftar in April launched an offensive to take Tripoli, held by the internationally recognised government of Premier Fayez al-Serraj.",
    "U.N. Libya envoy Ghassan Salame last month unveiled plans for an international conference to bring together foreign powers backing rival groups on the ground, without naming a venue.",
    "\"Germany therefore initiated a consultation process with key international partners. With sufficient preparatory work these efforts could lead towards a meaningful international event this fall,\" Oliver Owcza, Germany's ambassador, said on Twitter.",
    "He gave no details on the event, announced just after German Chancellor Angela Merkel told parliament the situation in the north African country risked destabilising the whole of Africa.",
    "Diplomatic sources said the event would be held in Berlin in October or November.",
    "Libya's conflict has increasingly become a proxy war between  foreign powers which have been backing various armed groups since the 2011 uprising against Muammar Gaddafi. The former rebels have been fighting each other since then.",
    "Haftar, who is allied to a parallel government in the east, has for years enjoyed the military support of Egypt and the United Arab Emirates, U.N. reports say.",
    "Turkey has been backing Serraj, sending his forces combat drones and vehicles since the start of the war, which has balanced out a military edge for the LNA, diplomats say.",
    "Salame thinks Germany can mediate, as it is seen as impartial in the conflict, in contrast to France and Italy, which have been competing for influence and have vast oil and gas interests in Libya, diplomats say.",
    "Both countries brought Haftar and Serraj, along with  regional players, together at summits in Paris and Palermo last year, but failed to achieve a breakthrough.",
    "Germany has strong ties with Turkey and Egypt, whose bilateral ties have been strained since the Egyptian military, then led by Abdel al-Fattah al-Sisi, ousted Islamist President Mohamed Mursi in 2013 after mass protests against his rule.",
    "\"Germany would be a good idea for the fact that it hasn't been exactly involved in supporting either side of the conflict but also because of its influence in the European Union and beyond,\" said Emad Badi, a Libya researcher.",
    "The conference's goal would be to push foreign players to enforce an existing arms embargo and for a ceasefire to allow Libyans to hold talks on power-sharing and eventual elections, diplomats say.",
    "Key obstacles will be to get Turkey to sit with top officials from Egypt and the UAE, they say.",
    "The Turkish delegation withdrew at the last conference held by Italy after Turkey Vice President Fuat Oktay was not allowed to join meetings among Haftar, Serraj, Sisi and Europeans.",
    "UAE Minister of State for Foreign Affairs Anwar Gargash said on Tuesday that he was not aware of any Berlin conference plans but added that the UAE supported a political solution."
  ],
  "published_datetime": "2019-09-11 12:15:00"
}