{
  "url": "https://www.nasdaq.com/article/why-is-emerson-electric-emr-up-01-since-last-earnings-report-cm1208053",
  "title": "Why Is Emerson Electric (EMR) Up 0.1% Since Last Earnings Report? - Nasdaq.com",
  "text": [
    " A month has gone by since the las t earnings  report for Emerson Electric (EMR). Shares have added about 0.1% in that time frame, underperforming the S&P 500. Will the recent positive trend continue leading up to its next earnings release, or is Emerson Electric due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important drivers.  Emerson Q3 Earnings In Line With Estimates, Up   Y/Y  Emerson third-quarter fiscal 2019 (ended Jun 30, 2019) earnings of 94 cents per share came in line with the Zacks Consensus Estimate. Notably, the company's earnings matched estimates in the las t report  ed quarter as well. On a year-over-year basis, the bottom line increased 7% from 88 cents on the back of healthy sales growth.  Organic Sales and Acquired Assets Drive Revenues  Emerson's revenues were $4,684 million in the quarter, reflecting growth of 5% from the year-ago quarter. Underlying sales expanded 2% as favorable trends in key served markets supported operations. In addition, acquired assets boosted sales by 5% and forex woes had a 2% adverse impact. However, the top line lagged the Zacks Consensus Estimate of $4,814 million. The company reports net sales under two segments - Automation Solutions, and Commercial & Residential Solutions. The segmental information is briefly discussed below: Automation Solutions revenues were $3,025 million, increasing 5.4% year over year. Underlying sales in the quarter grew 3% while acquired assets expanded sales by 5%. Forex woes adversely impacted sales by 3%. Commercial & Residential Solutions segment generated revenues of $1,662 million in the fiscal third quarter, up 4.4% year over year. Underlying sales were down 1%, while acquired assets expanded sales by 6%. Forex woes adversely impacted sales by 1%. Under this segment, Climate Technologies' sales declined 3% year over year to $1,199 million while that from Tools & Home Products increased 30.1% to $463 million.  Gross Margin  In the quarter under review, Emerson's cost of sales increased 6.7% year over year to $2,683 million. It represented 57.3% of net revenues compared with 56.4% in the year-ago quarter. Gross margin was down 90 basis points (bps) to 42.7% due to acquired assets and unfavorable mix. Selling, general and administrative expenses (SG&A) expanded 6.4% to $1,126 million. As a percentage of sales, SG&A expenses were 24%, up from 23.7%.  Balance Sheet and Cash Flow  Exiting the fiscal third quarter, Emerson had cash and cash equivalents of $1,603 million, down from $3,411 million at the year-end quarter. Long-term debt balance increased 38.7% to $4,336 million. Notably, during the first nine months of fiscal 2019, the company raised $1,691 million from long-term debts while repaid debts of $655 million. In the first three quarters of fiscal 2019, it generated net cash of $1,802 million from operating activities, reflecting decline of 3.5% from the year-ago period. Capital expenditure was $395 million, up from $314 million. During the first nine months of fiscal 2019, the company paid dividends amounting $909 million and repurchased shares worth $1,000 million.  Outlook  For fiscal 2019 (ending September 2019), the company anticipates net sales to increase 6%, with underlying sales to be up 3%. Earnings per share are predicted to be $3.60-$3.70 for the fiscal, consistent with the earlier guidance. Emerson estimates Automation Solutions net sales to be up 5%, while Commercial & Residential Solutions sales are projected to be flat.   How Have Estimates Been Moving Since Then?  In the past month, investors have witnessed an upward trend in estimates review.  VGM Scores  Currently, Emerson Electric has a strong Growth Score of A, though it is lagging a bit on the Momentum Score front with a B. Following the exact same course, the stock was allocated a grade of B on the value side, putting it in the top 40% for this investment strategy. Overall, the stock has an aggregate VGM Score of A. If you aren't focused on one strategy, this score is the one you should be interested in.  Outlook  Estimates have been broadly trending upward for the stock, and the magnitude of these revisions has been net zero. Notably, Emerson Electric has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Emerson Electric Co. (EMR): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "A month has gone by since the las t earnings  report for Emerson Electric (EMR). Shares have added about 0.1% in that time frame, underperforming the S&P 500.",
    "Will the recent positive trend continue leading up to its next earnings release, or is Emerson Electric due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recen t earnings report  in order to get a better handle on the important drivers.  Emerson Q3 Earnings In Line With Estimates, Up   Y/Y  Emerson third-quarter fiscal 2019 (ended Jun 30, 2019) earnings of 94 cents per share came in line with the Zacks Consensus Estimate. Notably, the company's earnings matched estimates in the las t report  ed quarter as well. On a year-over-year basis, the bottom line increased 7% from 88 cents on the back of healthy sales growth.  Organic Sales and Acquired Assets Drive Revenues  Emerson's revenues were $4,684 million in the quarter, reflecting growth of 5% from the year-ago quarter. Underlying sales expanded 2% as favorable trends in key served markets supported operations. In addition, acquired assets boosted sales by 5% and forex woes had a 2% adverse impact. However, the top line lagged the Zacks Consensus Estimate of $4,814 million. The company reports net sales under two segments - Automation Solutions, and Commercial & Residential Solutions. The segmental information is briefly discussed below: Automation Solutions revenues were $3,025 million, increasing 5.4% year over year. Underlying sales in the quarter grew 3% while acquired assets expanded sales by 5%. Forex woes adversely impacted sales by 3%. Commercial & Residential Solutions segment generated revenues of $1,662 million in the fiscal third quarter, up 4.4% year over year. Underlying sales were down 1%, while acquired assets expanded sales by 6%. Forex woes adversely impacted sales by 1%. Under this segment, Climate Technologies' sales declined 3% year over year to $1,199 million while that from Tools & Home Products increased 30.1% to $463 million.  Gross Margin  In the quarter under review, Emerson's cost of sales increased 6.7% year over year to $2,683 million. It represented 57.3% of net revenues compared with 56.4% in the year-ago quarter. Gross margin was down 90 basis points (bps) to 42.7% due to acquired assets and unfavorable mix. Selling, general and administrative expenses (SG&A) expanded 6.4% to $1,126 million. As a percentage of sales, SG&A expenses were 24%, up from 23.7%.  Balance Sheet and Cash Flow  Exiting the fiscal third quarter, Emerson had cash and cash equivalents of $1,603 million, down from $3,411 million at the year-end quarter. Long-term debt balance increased 38.7% to $4,336 million. Notably, during the first nine months of fiscal 2019, the company raised $1,691 million from long-term debts while repaid debts of $655 million. In the first three quarters of fiscal 2019, it generated net cash of $1,802 million from operating activities, reflecting decline of 3.5% from the year-ago period. Capital expenditure was $395 million, up from $314 million. During the first nine months of fiscal 2019, the company paid dividends amounting $909 million and repurchased shares worth $1,000 million.  Outlook  For fiscal 2019 (ending September 2019), the company anticipates net sales to increase 6%, with underlying sales to be up 3%. Earnings per share are predicted to be $3.60-$3.70 for the fiscal, consistent with the earlier guidance. Emerson estimates Automation Solutions net sales to be up 5%, while Commercial & Residential Solutions sales are projected to be flat. ",
    " Emerson Q3 Earnings In Line With Estimates, Up   Y/Y ",
    "Emerson third-quarter fiscal 2019 (ended Jun 30, 2019) earnings of 94 cents per share came in line with the Zacks Consensus Estimate. Notably, the company's earnings matched estimates in the las t report  ed quarter as well.",
    "On a year-over-year basis, the bottom line increased 7% from 88 cents on the back of healthy sales growth.",
    " Organic Sales and Acquired Assets Drive Revenues ",
    "Emerson's revenues were $4,684 million in the quarter, reflecting growth of 5% from the year-ago quarter. Underlying sales expanded 2% as favorable trends in key served markets supported operations. In addition, acquired assets boosted sales by 5% and forex woes had a 2% adverse impact.",
    "However, the top line lagged the Zacks Consensus Estimate of $4,814 million.",
    "The company reports net sales under two segments - Automation Solutions, and Commercial & Residential Solutions. The segmental information is briefly discussed below:",
    "Automation Solutions revenues were $3,025 million, increasing 5.4% year over year. Underlying sales in the quarter grew 3% while acquired assets expanded sales by 5%. Forex woes adversely impacted sales by 3%.",
    "Commercial & Residential Solutions segment generated revenues of $1,662 million in the fiscal third quarter, up 4.4% year over year. Underlying sales were down 1%, while acquired assets expanded sales by 6%. Forex woes adversely impacted sales by 1%. Under this segment, Climate Technologies' sales declined 3% year over year to $1,199 million while that from Tools & Home Products increased 30.1% to $463 million.",
    " Gross Margin ",
    "In the quarter under review, Emerson's cost of sales increased 6.7% year over year to $2,683 million. It represented 57.3% of net revenues compared with 56.4% in the year-ago quarter. Gross margin was down 90 basis points (bps) to 42.7% due to acquired assets and unfavorable mix. Selling, general and administrative expenses (SG&A) expanded 6.4% to $1,126 million. As a percentage of sales, SG&A expenses were 24%, up from 23.7%.",
    " Balance Sheet and Cash Flow ",
    "Exiting the fiscal third quarter, Emerson had cash and cash equivalents of $1,603 million, down from $3,411 million at the year-end quarter. Long-term debt balance increased 38.7% to $4,336 million.",
    "Notably, during the first nine months of fiscal 2019, the company raised $1,691 million from long-term debts while repaid debts of $655 million.",
    "In the first three quarters of fiscal 2019, it generated net cash of $1,802 million from operating activities, reflecting decline of 3.5% from the year-ago period. Capital expenditure was $395 million, up from $314 million.",
    "During the first nine months of fiscal 2019, the company paid dividends amounting $909 million and repurchased shares worth $1,000 million.",
    " Outlook ",
    "For fiscal 2019 (ending September 2019), the company anticipates net sales to increase 6%, with underlying sales to be up 3%.",
    "Earnings per share are predicted to be $3.60-$3.70 for the fiscal, consistent with the earlier guidance.",
    "Emerson estimates Automation Solutions net sales to be up 5%, while Commercial & Residential Solutions sales are projected to be flat.",
    " How Have Estimates Been Moving Since Then? ",
    "In the past month, investors have witnessed an upward trend in estimates review.",
    " VGM Scores ",
    "Currently, Emerson Electric has a strong Growth Score of A, though it is lagging a bit on the Momentum Score front with a B. Following the exact same course, the stock was allocated a grade of B on the value side, putting it in the top 40% for this investment strategy.",
    "Overall, the stock has an aggregate VGM Score of A. If you aren't focused on one strategy, this score is the one you should be interested in.",
    " Outlook ",
    "Estimates have been broadly trending upward for the stock, and the magnitude of these revisions has been net zero. Notably, Emerson Electric has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:31:24"
}