{
  "url": "https://www.nasdaq.com/article/forexdollar-edges-higher-on-trade-brexit-worries-20190903-00907",
  "title": "FOREX-Dollar edges higher on trade, Brexit worries - Nasdaq.com",
  "text": [
    "    * Pound recovers after dropping below $1.20 on Brexitjitters",
    "* Dollar index hits highest level since May 2017",
    "* U.S. factory sector contracts for first time since 2016 -ISM",
    "* U.S. Treasury yields fall toward recent mid-2016 low",
    "* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh (Updates market action, changes dateline, previous LONDON)",
    "By Richard Leong",
    "NEW YORK, Sept 3 (Reuters) - The dollar climbed on Tuesdayto its strongest level in over two years against a basket ofcurrencies as traders favored the greenback on worries aboutU.S.-China trade tensions and a chaotic British exit from theEuropean Union.",
    "The dollar's initial gains abated in the wake of a privatereport that showed the U.S. manufacturing sector recorded itsfirst monthly contraction since 2016 in August. urn:newsml:reuters.com:*:nL2N25R073",
    "Last month's steeper-than-expected decline in the factoryactivity index from Institute for Supply Management also touchedoff a rally in the U.S. bond market, sending benchmark 10-yearyields US10YT=RR to their lowest levels since July 2016. urn:newsml:reuters.com:*:nL2N25U0O6",
    "\"This is a safe-haven trade rather than a rate-differentialtrade,\" said Steven Englander, global head of G10 FX research atStandard Chartered in New York.",
    "Bloomberg News reported that Chinese and U.S. officials arestruggling to agree on a schedule for a round of tradenegotiations that had been expected this month.",
    "UK Prime Minister Boris Johnson lost his working majority inparliament when one of his Conservative lawmakers defected tothe pro-European Union Liberal Democrats. urn:newsml:reuters.com:*:nL9N25G000",
    "At 11:44 a.m. (1544 GMT), an index that tracks the dollarversus six major currencies .DXY was up 0.11% at 99.022. Ithit 99.37 earlier Tuesday, which was its highest since May 2017.",
    "The euro stabilized after tumbling to a 28-month low againstthe dollar earlier Tuesday as investors priced in deepernegative interest rates for longer in the euro zone.",
    "Money markets have increased to more than 80% theprobability that the European Central Bank will cut itsbenchmark rate by 20 basis points when it meets next week. ",
    "The ECB benchmark rate now stands at minus 0.40% and it has all but promised a monetary policy stimulus package as economicgrowth falters. Monday's PMI survey showed Europeanmanufacturing contracted for seven straightmonths. urn:newsml:reuters.com:*:nL5N25Q2T8urn:newsml:reuters.com:*:nL5N25Q32W",
    "The euro EUR=EBS was little changed on the day at $1.09645. It fell to $1.0926 earlier, its lowest since mid-May2017. A break below the key $1.1000 level last week had sparkedheavier sell-offs.",
    "The dollar weakened against the yen and the Swiss franc inthe aftermath of disappointing ISM manufacturing data.",
    "The greenback fell 0.37% to 105.87 yen and decreased 0.31%to 0.98735 franc.",
    "Sterling was last up 0.2% at $1.2087GBP=D3 after fallingto $1.1959, the lowest since October 2016, when it plunged to$1.1491 in a flash crash. Against the euro, sterling rose to 90.7 pence, rebounding from a two-week low of 91.47 penceEURGBP=D3 .  ========================================================",
    "Currency bid prices at 11:43AM (1543 GMT) Description     RIC        Last          U.S.       Pct Change    YTD Pct    High Bid   Low Bid",
    "                                      Close                     Change               ",
    "                                       Previous                                      ",
    "                                       Session                                        Euro/Dollar     EUR=       $1.0964$1.0966    -0.02%        -4.40%     +1.0978    +1.0927 Dollar/Yen      JPY=       105.8700      106.2100   -0.32%        -3.99%     +106.3800  +105.7500 Euro/Yen        EURJPY=    116.07        116.49     -0.36%        -8.04%     +116.5600  +115.8800 Dollar/Swiss    CHF=       0.9874        0.9905     -0.31%        +0.61%     +0.9928    +0.9865 Sterling/Dolla  GBP=       1.2090        1.2066     +0.20%        -5.23%     +1.2102    +1.1959 r                                                                                        Dollar/Canadia  CAD=       1.3331        1.3325     +0.05%        -2.24%     +1.3382    +1.3323 n                                                                                        Australian/Dol  AUD=       0.6756        0.6713     +0.64%        -4.16%     +0.6758    +0.6688 lar                                                                                      Euro/Swiss      EURCHF=    1.0828        1.0866     -0.35%        -3.79%     +1.0869    +1.0821 Euro/Sterling   EURGBP=    0.9067        0.9091     -0.26%        +0.91%     +0.9148    +0.9052 NZ              NZD=       0.6323        0.6306     +0.27%        -5.87%     +0.6326    +0.6270 Dollar/Dollar                                                                            Dollar/Norway   NOK=       9.1054        9.1003     +0.06%        +5.38%     +9.1632    +9.0986 Euro/Norway     EURNOK=    9.9833        9.9832     +0.00%        +0.78%     +10.0213   +9.9790 Dollar/Sweden   SEK=       9.8420        9.8274     +0.13%        +9.80%     +9.8934    +9.8239 Euro/Sweden     EURSEK=    10.7937       10.7799    +0.13%        +5.16%     +10.8225   +10.7709 ",
    "\n<^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\nGRAPHIC: Euro lowest since May 2017   https://tmsnrt.rs/2zMVY6w\n    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^> (Reporting by Richard Leong;Additional reporting by Olga Cotaga in LONDONEditing by Frances Kerry and Lisa Shumaker) ((richard.leong@thomsonreuters.com; +1 646 223 6313; ReutersMessaging: richard.leong.thomsonreuters.com@thomsonreuters.net;Twitter @RichardLeong2))"
  ],
  "published_datetime": "2019-09-03 11:59:00"
}