{
  "url": "https://www.nasdaq.com/article/gnndy-or-rmd-which-is-the-better-value-stock-right-now-cm1207994",
  "title": "GNNDY or RMD: Which Is the Better Value Stock Right Now? - Nasdaq.com",
  "text": [
    " Investors with an interest in Medical - Products stocks have likely encountered both GN STORE NORD (GNNDY) and ResMed (RMD). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look. There are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits. GN STORE NORD has a Zacks Rank of #2 (Buy), while ResMed has a Zacks Rank of #3 (Hold) right now. Investors should feel comfortable knowing that GNNDY likely has seen a stronger improvement to its earnings outlook than RMD has recently. But this is just one factor that value investors are interested in. Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels. The Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors. GNNDY currently has a forward P/E ratio of 22.22, while RMD has a forward P/E of 35.18. We also note that GNNDY has a PEG ratio of 1.39. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. RMD currently has a PEG ratio of 3.32. Another notable valuation metric for GNNDY is its P/B ratio of 7.66. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, RMD has a P/B of 9.56. These metrics, and several others, help GNNDY earn a Value grade of B, while RMD has been given a Value grade of D. GNNDY stands above RMD thanks to its solid earnings outlook, and based on these valuation figures, we also feel that GNNDY is the superior value option right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  GN STORE NORD (GNNDY): Free Stock Analysis Report   ResMed Inc. (RMD): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Investors with an interest in Medical - Products stocks have likely encountered both GN STORE NORD (GNNDY) and ResMed (RMD). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.",
    "There are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits.",
    "GN STORE NORD has a Zacks Rank of #2 (Buy), while ResMed has a Zacks Rank of #3 (Hold) right now. Investors should feel comfortable knowing that GNNDY likely has seen a stronger improvement to its earnings outlook than RMD has recently. But this is just one factor that value investors are interested in.",
    "Value investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels.",
    "The Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors.",
    "GNNDY currently has a forward P/E ratio of 22.22, while RMD has a forward P/E of 35.18. We also note that GNNDY has a PEG ratio of 1.39. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. RMD currently has a PEG ratio of 3.32.",
    "Another notable valuation metric for GNNDY is its P/B ratio of 7.66. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, RMD has a P/B of 9.56.",
    "These metrics, and several others, help GNNDY earn a Value grade of B, while RMD has been given a Value grade of D.",
    "GNNDY stands above RMD thanks to its solid earnings outlook, and based on these valuation figures, we also feel that GNNDY is the superior value option right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 09:40:11"
}