{
  "url": "https://www.nasdaq.com/article/japan-manufacturers-mood-hits-612year-low--reuters-tankan-20190911-00882",
  "title": "Japan manufacturers' mood hits 6-1/2-year low - Reuters Tankan - Nasdaq.com",
  "text": [
    "By Tetsushi Kajimoto",
    "TOKYO, Sept 12 (Reuters) - Business confidence among Japanese manufacturers has soured to hit the weakest level in 6-1/2 years, the Reuters Tankan poll for September showed, underscoring fears that the U.S.-China trade war is undermining Japan's export-led economy.",
    "The monthly poll, which tracks the Bank of Japan's (BOJ) key tankan quarterly survey, found the service-sector mood improving from August - a sign solid domestic demand might offset external pains - but the reading was lower than three months ago.",
    "The September results point to a deterioration in the quarterly BOJ tankan due at 2350 GMT on Sept. 30.",
    "Manufacturers' mood is expected to swing to a zero reading over the next three months but non-manufacturers' sentiment is seen worsening.",
    "Sliding business confidence among manufacturers could dampen capital expenditure - a rare bright spot in the world's third-largest economy - while the bleak outlook at non-manufacturers indicated worries about a hit from a sales tax hike to 10% from 8% scheduled to take effect on Oct. 1.",
    "And there's a sign that capital expenditure may have already peaked out.",
    "Government data out this week showed Japan's economy grew at a slower-than-estimated 1.3% annualised in the April-June quarter as the trade war prompted a downward revision of business spending.",
    "In the Reuters poll of 504 large and mid-sized companies, managers of 260 responded on condition of anonymity.",
    "\"The U.S.-China confrontation has led to delays and cancellations in orders and sales,\" a manager of a chemicals firm wrote in the survey.",
    "\"The sales tax hike, anxiety about the future, and slowdown in private consumption\" are weighing on our business confidence, said a food processing company manager.",
    "The minus 7 reading for manufacturers' sentiment was down three points from the previous month, weighed on by materials firms such as oil refinery, chemicals, steel/nonferrous metals, according to the survey conducted between Aug. 29 to Sept. 9.",
    "The manufacturers' index has dropped 13 points compared with three months earlier. It is expected to recover to zero in December.",
    "The service-sector index improved to 19 from 13 in August, led by wholesalers/retailers and transportation/utility firms.",
    "Compared with three months earlier, the service-sector index was down three points in September. The index is seen worsening to 10 in the next three months.",
    "The BOJ's last tankan out in July showed big manufacturers' business confidence fell to a nearly three-year low in the quarter to June.",
    "The Reuters Tankan indexes are calculated by subtracting the percentage of pessimistic respondents from optimistic ones. A negative figure means pessimists outnumber optimists.",
    "\nGraphic on Reuters Tankan, BOJ tankan"
  ],
  "published_datetime": "2019-09-11 07:00:00"
}