{
  "url": "https://www.nasdaq.com/article/slack-loss-forecast-bigger-than-expected-shares-plunge-20190904-01099",
  "title": "Slack loss forecast bigger than expected, shares plunge - Nasdaq.com",
  "text": [
    "By Arjun Panchadar",
    "Sept 4 (Reuters) - Slack Technologies Inc  forecast slowing revenue growth in the second half and a bigger-than-expected third-quarter loss in its first report as a public company on Wednesday, as it faces intense competition from Microsoft Corp  and others.",
    "Shares of the workplace messaging platform tumbled 13% in extended trading. Up to Wednesday's close, they had lost 19.3% from their debut price of $38.50 in June.",
    "The company forecast a third-quarter loss of 8 to 9 cents a share. Analysts on average were expecting a loss of 7 cents per share, according to IBES data from Refinitiv.",
    "It also forecast revenue in the range of $154 million to $156 million, representing growth of 46% to 48%, which is slower than the 58% this quarter and the 67% increase in the first quarter.",
    "Slack topped second-quarter revenue expectations, however, and posted a smaller-than-expected loss for the quarter ended July 31. The company posted revenue of $145 million, beating estimates of $141.3 million.",
    "It said revenue was hit by $8.2 million of credits related to a service disruption in the quarter.",
    "\"I imagine the reaction is picking on the year-over-year revenue growth deceleration from Q1 to Q2. Slack did have an outage in Q2, which led to $8.2 million in credits … adjusted for this factor, growth would have been 66% Y/Y, which is a solid trend,\" D.A. Davidson analyst Rishi Jaluria said.",
    "EXPENSES SOAR",
    "Slack competes with Microsoft Teams, a chat add-on for Microsoft Office365 users. Other similar platforms include Workplace by Facebook Inc  and Cisco Systems Inc's  Webex Teams.",
    "Microsoft disclosed in July it had over 13 million daily active users, above Slack's more than 10 million.",
    "Slack's total operating expenses in the quarter skyrocketed 317.6% to $477.5 million. It said sales and marketing expenses were expected to accelerate in the second half and exceed 50% of revenue.",
    "Slack went public via a direct listing on June 20, instead of the more popular initial public offering route. Its shares soared nearly 50% in their public trading debut, valuing it at more than $23 billion. ",
    "It said it had over 100,000 paid customers at the end of the quarter.",
    "The company also said it was seeing great traction in its \"shared channels\" feature, which is currently in beta and will be available to all Slack customers later this month.",
    "Slack's adjusted second-quarter loss of 14 cents per share was smaller than the 18 cents analysts had expected. Slack also raised its full-year revenue forecast and now expects its loss for the year to be smaller.",
    "Slack said net loss attributable to common stockholders ballooned to $359.6 million, or 98 cents per share, in the second quarter, from $31.9 million, or 26 cents per share, a year earlier, primarily because of $307 million of stock-based compensation. "
  ],
  "published_datetime": "2019-09-04 04:50:00"
}