{
  "url": "https://www.nasdaq.com/article/an-ugly-patch-for-ulta-beauty-and-rough-weather-ahead-for-a-few-industries-cm1207927",
  "title": "An Ugly Patch for Ulta Beauty, and Rough Weather Ahead for a Few Industries - Nasdaq.com",
  "text": [
    "Wall Street is by nature a forward-looking place. Last quarter's results are old news almost before the earnings reports arrive. When investors assess companies, they're less interested in \"What have you done for me lately?\" and more interested in \"What will you do for me later?\" So it should come as little surprise that the 30% pummeling the market gave to shares of Ulta Beauty (NASDAQ: ULTA) on Friday was driven not by its second-quarter numbers -- which were strong -- but by its tepid forecast. And speaking of forecasts, while it's impossible to predict specific weather events with any accuracy more than a handful of days in advance, we can predict that, overall, there will be a growing number of natural disasters as climate change advances. And that will affect certain industries in ways that investors need to factor into their calculations.",
    "In this MarketFoolery podcast, host Chris Hill and senior analyst Jason Moser take the long-term view on both of those points, and also discuss the rapid growth of legal sports gambling apps.",
    "To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center . A full transcript follows the video.",
    "10 stocks we like better than Ulta Beauty\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Ulta Beauty wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "This video was recorded on Sept. 3, 2019.",
    "Chris Hill: It's Tuesday, Sept. 3. Welcome to MarketFoolery ! I'm Chris Hill. Joining me in studio, the one and only Jason Moser. Happy September!",
    "Jason Moser: Yeah, man! I can't believe it is September! That's pretty crazy, isn't it?",
    "Hill: I checked the calendar and everything. It really is September!",
    "Hill: School's back in session. The kids are already complaining about wanting summer to come back. I like the change in seasons. I do enjoy fall. It's a good time.",
    "Hill: Yeah. Dunkin' Donuts , breaking out those pumpkin spice Munchkins. I'm in favor of that.",
    "Moser: Those are good.",
    "Hill: We're going to talk sports betting. We're definitely going to talk about Hurricane Dorian. Let's start with something that happened last Friday, though. We got a bunch of emails and tweets about this. This is Ulta Salon. On Friday, the stock fell 28%. The second-quarter results looked good. They cut guidance for the full fiscal year. I'm wondering, was it that bad? Or was the stock just that expensive? Or was it something else entirely?",
    "Moser:  I think a fair combination of the two, probably, is the best answer there. I'm glad you mentioned that the quarter itself was good, because it was a good quarter. I mean, I guess technically, they missed expectations by a tiny bit. But who cares about that, really? You're talking about sales up 12%. Comps up 6.2%. Earnings per share grew 12.2%. It was a good quarter. Really, it was the guidance that I think freaked the market out. For the most part, you can't guide back the way they did and expect the market to not react. They took earnings per share guidance back significantly. And when I say significantly, it was in a range between $12.83 cents to $13.03, and they pulled that all the way back to a range of $11.86 cents to $12.06. Pretty significant guide back there. And the stock was not cheap by conventional metrics. I mean, it was trading at around 40 times earnings before this happened. Now, there's a reason why it trades at 40 times earnings, or, it did. It had been performing so well up to this point. Now, you've got the stock trading at around 20 times full-year estimates, the revisions. It certainly looks a bit more interesting now that it did last week.",
    "Hill: I want to go back to the same-store sales for a second. As you said, they're north of 6%. For all of the retailers we've been talking about over the last month or so on this show and on Motley Fool Money , a lot of them would kill to have same-store sales in north of 6%. But that was the thing that struck me in the guidance. It was not just the revenue number -- was it revenue or earnings that they ratcheted back by $1 a share?",
    "Moser: It was earnings.",
    "Hill: Earnings. It wasn't just that, it was the fact that they lowered full-year same-store sales from 6% to 4%, which means, having just put up more than 6% -- and we're halfway through the fiscal year, so, clearly, they're warning Wall Street, \"The next couple of comp numbers that you see are going to be,\" I mean, I don't think they'll be negative. That would be probably pretty shocking, if they were just flat-out negative. But certainly, they're probably going to be somewhere in the neighborhood of 2% to 3%.",
    "Moser: More than likely, I think. I feel like this is a misstep on management's part. I don't want to throw CEO Mary Dillon under the bus because I'm sure this wasn't solely her fault. But the fact is, they did a poor job of managing expectations here. That is such a significant guide down now.",
    "I do think the good news out of all this, it really does appear that it is less a business thing and more of a general market thing. In other words, it's not an Ulta-specific problem as much as it is a problem with headwinds in the cosmetics space writ large. We're talking about all sorts of companies that are having trouble in the cosmetics space right now. Cosmetics represents about 50% of Ulta's overall business, so it matters. Now, what is the cause of the headwinds in the space? She seems to believe it is more about hitting a lull in innovation and newness of products. There's this lull right now in innovation in the space. They've done a lot in a short period of time since she took over, and the space now has hit a lull. But when we talk about this space, investors need to remember, this is a big market opportunity. It is a global market opportunity. All-in, you're talking about, the U.S. beauty products and salon services industry represents about $145 billion in sales according to IBISWorld and Euromonitor. One hundred and forty-five billion dollars, and you break that down in all of these different markets, whether it's cosmetics or salon or whatever. That's the nice part about Ulta's business -- it's diversified away from just cosmetics. It is more things. Granted, cosmetics is a big part of the business. With all of that said, there are reasons to believe that they will be able to recover from this. This is one of the leaders in the space. When we talk about innovating, this is a company that is leading the way when it comes to innovation. So, I don't think this is something where investors need to be concerned that we have a business that's falling off a cliff or getting ready to get Amazon -ed, as much as it is a company just in a market right now that's seeing some headwinds.",
    "Hill: Last Thursday, the stock was at $337 a share. Right now, it's at $233. [laughs] Do you buy at this price?",
    "Moser:  Listen, I'll be very clear. This is a recommendation in our augmented reality service. I like this business a lot. I don't know probably as much about makeup as I should, but I've learned a lot in the process of researching the business. And I do live in a house full of women, so that helps. I get at least some insight as to what's going on in the space. One thing I do see with companies like this, and we're seeing it more and more, is that partnerships matter a lot. Partnerships with well-known people, celebrities. For example, you see this relationship that they formed with Kim Kardashian West, and this KKW Beauty by Kim Kardashian is coming to Ulta in the back half of the year. That's a relationship that I think stands to help the company out. We talked a little while back about Amazon and how they formed a relationship with Lady Gaga as they make their foray into this space. You look at how important this Kim Kardashian thing could be, I mean, she's got 147 million Instagram followers. One hundred and forty-seven million. That's staggering. Lady Gaga? Thirty-seven million. Now, I don't use Instagram. I just researched those numbers this morning. But to me, that's 147 vs. 37, man. That's a big difference, OK?",
    "When you form relationships with people that have that kind of reach, I think those types of relationships help businesses like Ulta on the innovation side, for sure. And, you can market to the entire world, because so many people care about what these celebrities are using, products that they're using. Again, I think, personally, this is an opportunity to buy a good business at a sale price. It may not get back to that 40 times multiple anytime soon, but this is not a retailer that's getting Amazon-ed. It's not a bad business. It's a good business that's in a bit of tough stretch. They made a misstep on the guidance part of it, but I think that opens a window for investors.",
    "Hill: That was one of the things I was thinking. Every once in a while, we'll talk about a company that, four to six weeks before their quarterly results are due to be made public, they will come out and issue some sort of guide down, and we'll see a stock drop 10% or something like this. That kind of warning. This is a nice reminder of, this is the kind of thing that can happen if you don't do that. Because every once in a while, someone will be like, \"Why did they guide down? They have a little time to turn it around.\" It's like, because, if they don't, and it doesn't turn around, then this kind of thing happens.",
    "Moser: Yeah. I hate the expectations thing. I just prefer companies not even play that game if you don't have to. But I understand some are going to because they more or less have to, or feel like they have to. This was clearly a mismanaged number on their part. But, the flip side to that is, sometimes it can benefit investors in the form of opportunities. It's all about recognizing bad businesses vs. good businesses in a tough time. I think in Ulta's case, it's clearly the latter there. They'll recover from this, I think, no problem.",
    "Hill: As we speak, Hurricane Dorian is now a Category 2 storm. Warnings have been issued for Florida, Georgia, South Carolina. Later in the week, expected to -- at least on its current path -- hit on North Carolina and Virginia. For anyone listening who is in any of those areas, please, please, get out of the way of the storm. Please do what you need to do. We've already heard from some of our colleagues who are dealing with this. Everybody, stay as safe as possible.",
    "I wanted to get your thoughts on this. One of the stories this morning was the publicly traded cruise stocks. Royal Caribbean (NYSE: RCL) , Carnival Cruise Line (NYSE: CCL) (NYSE: CUK) , those stocks down a bit as they're going to feel an economic impact from this. The home improvement stocks -- Home Depot (NYSE: HD)  and Lowe's (NYSE: LOW)  --  down a little bit today, more so than the market. I just looked at those two categories and thought, well, if I'm thinking about extreme weather rising over the next 10 to 20 years, I feel like home improvement stocks are more of a buy signal than cruise stocks. But, when we were chatting earlier, you mentioned a third category that I hadn't thought of when thinking about any kind of extreme weather, and that's insurers.",
    "Moser:  When you talk about the home improvement sector, Home Depot and Lowe's are two businesses that I think are going to be around for the rest of our days. Those are companies that you really can just own and almost forget about owning them, because they're just going to continue to serve a massive market opportunity there. And then, when it comes to insurers, insurers are the companies that help us manage through these times. Whether you're a homeowner, or a renter, or you have a car, you have to have insurance for virtually everything major that you're doing in your life. It's another market that I don't think is going to be disrupted, ever. We have needs for insurance in our lives.",
    "I think that the thing that people want to make sure, when they're looking at insurance companies -- and this has just been my experience -- I think you just always have to go with the bigger, more reputable companies in the space. They're the ones that are built to be able to handle massive catastrophes like Dorian, for example, or any of the number of storms or earthquakes or whatever may happen. Those are the companies that have the financial resources to be able to deal with these issues. There are many nightmares, I am sure, in regard to people trying to file claims and dealing with their insurance companies as they recover. That's just part and parcel of the business. That's going to be just the way that is, unfortunately. I wouldn't let that deter you from necessarily investing in an insurer, though. Berkshire Hathaway , we talk about the company a lot. Travelers is another one that really has a stellar reputation in the space. Listeners probably remember, I did work there for a year. It's a very good business. I think, from that perspective, it's always worth considering. But I think you have to make sure you're going with the insurers that are big and reputable and specialize in this kind of stuff.",
    "I'll throw a little shoutout there for a buddy of mine who works at Travelers still. Ironically, his name is Dorian, Dorian Wynn. Dorian is going to jump on an episode of Industry Focus here with me soon, and we're going to talk about this type of thing. Dorian is a catastrophe claims adjuster in Georgia, and he specializes in hurricane preparations and evacuations. He has seen a lot of this stuff. The purpose of the interview, it's going to hopefully help people figure out how to approach these things before this type of thing happens, and how to deal with the aftermath of getting your life back in order. Certainly, he's seen his fair share. Again, having been at Travelers for the time that I was there, you just see how well-run insurers operate. We had to deal with insurers that were not so well-run. You'd see a big difference there.",
    "It's a market that is going to continue to exist for many, many decades to come. So, yeah, I think insurers are kind of a no-brainer.",
    "Hill: Make sure you're flexible on when you time this recording of the interview. Something tells me he's going to be pretty busy for the next two weeks.",
    "Moser: [laughs] Yeah, unfortunately, I do think he is going to be very busy. It's interesting to see how these storms and these natural disasters play out. At the time, we're seeing it, and we see the impact that it has at the local level, but then, you have to pan back a little bit and look at it from the national level. And you realize that, nationally speaking, it's not as impactful, thankfully, to the U.S. economy on a national scale. Certainly local, obviously, it's a big deal. But it's interesting to see the difference between property damage vs. actual lost output. The property damage is by far and away the biggest loss when it comes to these types of events. Lost output, it's not nearly as great. Part of that is because ultimately, that output comes back around. It's more or less just delayed. I think that's important to remember. While a lot of those big numbers really are due to property damage, the lost output isn't so big, and it does come back, which means that when you see these headlines going on, you're going to see some stocks take a little bit of a dip there. And you can feel pretty good knowing that they will come back around because that output does eventually get back in place, it's just delayed a little bit.",
    "Hill: College football season kicked off this past weekend. The NFL kicks off Thursday night. Maybe not surprisingly, sports betting is on the rise, especially in New Jersey. I learned this morning thanks to The Wall Street Journal , New Jersey just surpassed Nevada in monthly sports bets. That's a little surprising, when you consider it's been a little over a year that New Jersey legalized sports betting. It's less surprising when you learn that 80% of the bets that are placed in New Jersey are placed online.",
    "Moser: Even more so, it's mobile. It's not about Jersey, it's about that phone that you have in your pocket. Listen, I feel like this is basically just like the marijuana market. You cannot stop it. The only way is to look forward and be a part of it. If you sleep on this and you're not a part of it, then you're going to be missing out on an opportunity here. Those that get in early will help shape the space, and they'll benefit greatly from it. And we will see more and more states continue to legalize stuff like this. Because ultimately, consenting adults are going to get what they want to get. And now, you've basically opened Pandora's box here. You can't put it back in. Or, the toothpaste is out of the tube. However you want to put it. You can use all sorts of sayings here to get the point across.",
    "I'm not the biggest gambler in the world. I mean, I enjoy forking over a few bucks to play fantasy football every year just because it keeps the season interesting and it's relatively easy to do. But I do understand, and I appreciate, the concerns in regard to gambling and making it easier, in that it's going to hasten those who may be developing a problem. It's going to help them develop that problem a lot more quickly, no question. If you can just place a bet by going onto your phone... it's the same thing, ultimately, as what e-commerce has done for us. It's a lot easier now to buy anything you want, whenever you want. In most cases, you're not handing over any cash or using a credit card to swipe. The action of giving something away is not there, which can be very dangerous. One show, we even talked about, what was it, drunk shopping? [laughs] People come home hammered from a night of having fun, and then they start perusing Amazon.",
    "Hill: Yeah, Amazon, the hidden winner in alcohol consumption.",
    "Moser: I can see where something like this -- that's going to be an effect. That's going to be a byproduct of this. That's going to be something that we need to figure out how to handle. You want to keep an eye on the people that are close to you in your life so that you can try to help them if they need it.",
    "But, the bottom line is, it's not going to stop. And I think investors need to approach it from that position.",
    "Hill: I like the comparison you made to the marijuana industry . I think it's apt in a couple of ways. One of which is, we're in the early stages. If someone wants to stand up and point to a public company and say, \"This company is absolutely going to be a big winner in this space,\" please feel free to do so, but right now, when you look at the number of states that are considering legislation to legalize sports betting in some way -- and, by the way, the number of states just in this year alone, according to the Journal , 18 states this year alone brought up legislation, and it got shut down. So, I think you're right, this is not going to go away; but I think that there is enough trepidation about it that there are a bunch of states willing to say, \"We're not doing this here.\" But, I think that as they wrestle with this issue, it's important for investors to recognize that one of the things that states are wrestling with is the balance between mobile betting and in-person betting. It's easier, in some ways, to track construction, jobs, etc., all that sort of thing, to in-person locations, than it is to just say, \"We're going to go ahead and approve this app. Anyone who wants to throw an app open, they can do it.\"",
    "Moser: Yeah. One of the things that I think will probably come from this -- that it should ultimately be a good thing, I think -- is that as mobile betting continues to take share, mobile betting, ultimately, you fund that through a payment provider. You pay via any of the number of different payment providers that are out there, whether it's Square or PayPal or MasterCard or Visa , whatever you're using. There's an electronic transaction that's being recorded, as opposed to just going to the local casino or local shop and throwing down some cash for a wager, and there's really no record of it going forward. We talk about all of the benefits that data offer, I think there's going to be data that comes from all of this that will help shape the space. Hopefully, it will also help individuals in maintaining their sanity, and not letting this get out of hand and become too big of a problem.",
    "Very early stages. When people ask me about this market and the companies that I like in it, I do fall back to those payment companies. Regardless of win or lose, that money's got to get from point A to point B. The companies that are out there facilitating that process, they know what they're doing. They do it really well. So, those are the ones that I tend to fall back on.",
    "Hill: What's the name of your fantasy football team?",
    "Moser: Oh, Chris...I'm in two leagues this year. I had to keep it simple. I'm not getting any younger, so I didn't want to remember too many names. It's a little tip of the cap to where we work here. I am the TMF Stawk Pickas.",
    "Hill: Nice.",
    "Moser: It's stock spelled S-T-A-W-K, so it's a little play on the word. It's supposed to make me feel more confident, and feel like I have a little bit more street cred, you know? An intimidation factor. When people feel like they've got me on their matchup that week, they're going to see the name and maybe think, \"Ooh, man, he spells it differently. He must be good.\" We'll see. I usually suck at it, but it's fun anyway.",
    "Hill: Same name in both leagues?",
    "Moser: Yeah. Very different teams, though. I will say, I employed a very wide receiver-friendly draft this go-around. I just focused on getting as many wide receivers as I could. You're starting at least two, if not three, and you've got that flex position. It's a passing league now, for sure.",
    "Hill: Good luck!",
    "Moser: Thanks!",
    "Hill: Jason Moser, thanks for being here!",
    "Moser: You got it!",
    "Hill: As always, people on the program may have interest in the stocks they talk about, and The Motley Fool may have formal recommendations for or against, so don't buy or sell stocks based solely on what you hear. That's going to do it for this edition of MarketFoolery ! The show's mixed by Dan Boyd. I'm Chris Hill. Thanks for listening! We'll see you tomorrow!",
    "John Mackey, CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Chris Hill owns shares of AMZN and PYPL. Jason Moser owns shares of AMZN, MA, PYPL, SQ, and V. The Motley Fool owns shares of and recommends AMZN, BRK-B, MA, PYPL, SQ, and V. The Motley Fool has the following options: long January 2021 $120 calls on Home Depot, short September 2019 $70 puts on SQ, short October 2019 $97 calls on PYPL, long January 2021 $200 calls on BRK-B, and short January 2021 $200 puts on BRK-B. The Motley Fool recommends Carnival, DNKN, Home Depot, Lowe's, and Ulta Beauty. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:00:07"
}