{
  "url": "https://www.nasdaq.com/article/blast-at-kabul-us-embassy-on-911-anniversary-4-defense-picks-cm1210558",
  "title": "Blast at Kabul US Embassy on 9/11 Anniversary: 4 Defense Picks - Nasdaq.com",
  "text": [
    " Per major media sources, a large explosion took place near Kabul's U.S. Embassy after midnight on the anniversary of 9/11. We believe this sudden strike is in response to U.S. President Donald Trump's abrupt cancellation of peace talks with major Taliban leaders over the weekend. While withdrawal from such a major peace talk, which could have ended America's longest war, can prove to be detrimental for Afghan socio-economic balance, it comes as good news for U.S. defense stocks. This is because these kind of tensions boost defense products and equipment demand, thereby driving the aerospace-defense industry.  Why Did Trump Exit From Peace Talks?  U.S. diplomats have been in talks with Taliban representatives for the past few months about a plan to withdraw thousands of American troops in exchange for security guarantees by the Taliban. In fact, per a Reuters report, U.S. and Taliban negotiators even formed a peace deal draft last week that could have led to a drawdown in U.S. troops from Afghanistan. However, the death of several civilians and two members of the NATO mission in Kabul last week due to two Taliban car bomb blasts enraged Trump. He cited the death of U.S. service members in those blasts as a betrayal on Taliban's part and called off the talks.  Will the Attack Revive Terror?  This year marks the 18th anniversary of the Al Qaeda attacks that killed more than 3,000 people in New York, Washington and Pennsylvania. A U.S.-led invasion shortly after the 2001 attack toppled the Taliban, which had harbored Osama bin Laden, the Al-Qaida leader. Currently about 14,000 U.S. troops are deployed in the country, which President Trump has repeatedly termed as unnecessary. This is why the peace talks were initiated. Of course, Taliban wants U.S. troops out of Afghanistan but until it shows enough commitment to keep peace in the nation, America will not withdraw troops. While the United States cancelled peace talks with Taliban protesting its last week's attack, promising to maintain military pressure on the latter, Taliban threatened to kill more Americans in a stunning reversal of efforts to force a deal. So, the situation is now somewhat of a vicious circle with the United States and Taliban threatening each other. This is making the socio-political state in Afghanistan miserable. The latest blast near Kabul's U.S. Embassy is a proof of that.  Defense Stocks to Buy  Considering, Taliban's latest threat to kill more Americans, we may anticipate more such attacks in the coming days and counter attacks from U.S. troops. Even after so many years, the geo-political tensions have remained the same, if not worsened. However, U.S. defense stocks are poised to gain with America being the largest weapons supplier across the globe. Moreover, keeping in mind the current U.S. administration's optimistic defense budget over the past couple of years, adding defense stocks appears to be a prudent move for investors. Here we have selected four defense stocks that carry a favorable Zacks Rank #1 (Strong Buy) or #2 (Buy) and boast solid growth prospects. You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .  Transdigm Group TDG  : This Zacks Rank #1 company surpassed the Zacks Consensus Estimate for earnings in the past four quarter, with an average surprise of 10.71%. It boasts a solid long-term earnings growth rate of 12.6%.  Aerojet Rocketdyne Holdings AJRD  : This Zacks Rank #1 company surpassed the Zacks Consensus Estimate for earnings in the last four quarters, with an average surprise of 25.46%. It boasts a solid long-term earnings growth rate of 5.5%.  L3Harris Technologies LHX  : This Zacks Rank #2 company surpassed the Zacks Consensus Estimate for earnings in the last four quarters, with an average surprise of 4.21%. It boasts a solid long-term earnings growth rate of 8%.  Leidos Holdings LDOS  : This Zacks Rank #2 company surpassed the Zacks Consensus Estimate for earnings in the last four quarters, with an average surprise of 6.51%. It boasts a solid long-term earnings growth rate of 7.5%.  Looking for Stocks with Skyrocketing Upside?  makeArticleAd();  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>      Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Leidos Holdings, Inc. (LDOS): Free Stock Analysis Report   Transdigm Group Incorporated (TDG): Free Stock Analysis Report   Aerojet Rocketdyne Holdings, Inc. (AJRD): Free Stock Analysis Report   L3Harris Technologies Inc (LHX): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Per major media sources, a large explosion took place near Kabul's U.S. Embassy after midnight on the anniversary of 9/11. We believe this sudden strike is in response to U.S. President Donald Trump's abrupt cancellation of peace talks with major Taliban leaders over the weekend.",
    "While withdrawal from such a major peace talk, which could have ended America's longest war, can prove to be detrimental for Afghan socio-economic balance, it comes as good news for U.S. defense stocks. This is because these kind of tensions boost defense products and equipment demand, thereby driving the aerospace-defense industry.",
    " Why Did Trump Exit From Peace Talks? ",
    "U.S. diplomats have been in talks with Taliban representatives for the past few months about a plan to withdraw thousands of American troops in exchange for security guarantees by the Taliban. In fact, per a Reuters report, U.S. and Taliban negotiators even formed a peace deal draft last week that could have led to a drawdown in U.S. troops from Afghanistan.",
    "However, the death of several civilians and two members of the NATO mission in Kabul last week due to two Taliban car bomb blasts enraged Trump. He cited the death of U.S. service members in those blasts as a betrayal on Taliban's part and called off the talks.",
    " Will the Attack Revive Terror? ",
    "This year marks the 18th anniversary of the Al Qaeda attacks that killed more than 3,000 people in New York, Washington and Pennsylvania. A U.S.-led invasion shortly after the 2001 attack toppled the Taliban, which had harbored Osama bin Laden, the Al-Qaida leader.",
    "Currently about 14,000 U.S. troops are deployed in the country, which President Trump has repeatedly termed as unnecessary. This is why the peace talks were initiated. Of course, Taliban wants U.S. troops out of Afghanistan but until it shows enough commitment to keep peace in the nation, America will not withdraw troops. While the United States cancelled peace talks with Taliban protesting its last week's attack, promising to maintain military pressure on the latter, Taliban threatened to kill more Americans in a stunning reversal of efforts to force a deal. So, the situation is now somewhat of a vicious circle with the United States and Taliban threatening each other. This is making the socio-political state in Afghanistan miserable. The latest blast near Kabul's U.S. Embassy is a proof of that.",
    " Defense Stocks to Buy ",
    "Considering, Taliban's latest threat to kill more Americans, we may anticipate more such attacks in the coming days and counter attacks from U.S. troops.",
    "Even after so many years, the geo-political tensions have remained the same, if not worsened. However, U.S. defense stocks are poised to gain with America being the largest weapons supplier across the globe. Moreover, keeping in mind the current U.S. administration's optimistic defense budget over the past couple of years, adding defense stocks appears to be a prudent move for investors. Here we have selected four defense stocks that carry a favorable Zacks Rank #1 (Strong Buy) or #2 (Buy) and boast solid growth prospects. You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    " Transdigm Group TDG  : This Zacks Rank #1 company surpassed the Zacks Consensus Estimate for earnings in the past four quarter, with an average surprise of 10.71%. It boasts a solid long-term earnings growth rate of 12.6%.",
    " Aerojet Rocketdyne Holdings AJRD  : This Zacks Rank #1 company surpassed the Zacks Consensus Estimate for earnings in the last four quarters, with an average surprise of 25.46%. It boasts a solid long-term earnings growth rate of 5.5%.",
    " L3Harris Technologies LHX  : This Zacks Rank #2 company surpassed the Zacks Consensus Estimate for earnings in the last four quarters, with an average surprise of 4.21%. It boasts a solid long-term earnings growth rate of 8%.",
    " Leidos Holdings LDOS  : This Zacks Rank #2 company surpassed the Zacks Consensus Estimate for earnings in the last four quarters, with an average surprise of 6.51%. It boasts a solid long-term earnings growth rate of 7.5%.",
    " Looking for Stocks with Skyrocketing Upside?  makeArticleAd();  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.    Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.    See the pot trades we're targeting>>   ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:34:00"
}