{
  "url": "https://www.nasdaq.com/article/service-activity-burgeons-3-best-mutual-funds-to-buy-now-cm1210567",
  "title": "Service Activity Burgeons: 3 Best Mutual Funds to Buy Now - Nasdaq.com",
  "text": [
    " Per the lates t report  from the Institute of Supply Management (ISM) on Sep 5, its service index came in at 56.4% in August, surpassing the consensus estimate of 54.2%. Further, the rise in the index follows a three-year low of 53.7% it had witnessed in July. A reading above 50% indicates that the non-manufacturing sector economy is generally expanding. An improvement in the metric indicates that America's economy has remained resilient to global economic slowdown and effects of a protracted trade war with China. Gains were broad-based and occurred in 16 out of the total 17 industries that were surveyed. Under such circumstances, investing in mutual funds having significant exposure to services-related companies may prove prudent.  ISM Services Index Hits 3-Month High  The service side of America's economy hit its fastest pace of growth in the past three months. As a matter of fact, service-oriented businesses remained strong in August, improving for 115 consecutive months. It should be noted that a reading for the non-manufacturing index above 48.6% over time indicates that the overall economy is expanding. Moreover, the reading for August also states that the overall economy has expanded for 121 consecutive months. Furthermore, the Non-Manufacturing Business Activity Indexsurged to 61.5% in the month of August, posting growth for 121 months on the trot. Also, the Prices Index grew to 58.2% in the month. Moreover, ISM's Non-Manufacturing New Orders Index increased to 60.3% in the month, compared to the July reading of 54.1%. Meanwhile, new orders grew for the 121st consecutive month in August.  3 Best Choices  We have, thus, selected three mutual funds carrying a Zacks Mutual Fund Rank #1 (Strong Buy) or 2 (Buy) that are great for a retirement portfolio. Moreover, these funds have encouraging three and five-year returns. Additionally, the minimum initial investment is within $5000. We expect these funds to outperform their peers in the future. Remember, the goal of the Zacks Mutual Fund Rank is to guide investors to identify potential winners and losers. Unlike most of the fund-rating systems, the Zacks Mutual Fund Rank is not just focused on past performance, but also on the likely future success of the fund. The question here is: why should investors consider mutual funds? Reduced transaction costs and diversification of portfolio without several commission charges that are associated with stock purchases are primarily why one should be parking money in mutual funds (read more:  Mutual Funds: Advantages, Disadvantages, and How They Make Investors Money  ).  Fidelity Select Leisure Portfolio  FDLSX  fund invests a bulk of its assets in securities of companies engaged in the design, production or distribution of goods or services in the leisure and recreation industries. The fund seeks growth of capital and invests both in U.S. and non-U.S. companies. This Zacks sector - Sector-Other product has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds, please click here  . FDLSX has a Zacks Mutual Fund Rank#1 and an annual expense ratio of 0.76%, which is below the category average of 1.23%. The fund has three and five-year returns of 16.6% and 12.4%, respectively.  Fidelity Select Health Care Services Portfolio FSHCX  fund invests a large chunk of its assets in companies that either own or are involved in operating hospital and nursing homes, and are related to the healthcare services sector. FSHCX seeks appreciation of capital. The fund invests in securities of both U.S. and non-U.S. companies. This Zacks sector - Sector-Health product has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds, please click here  . FSHCX has a Zacks Mutual Fund Rank#1 and an annual expense ratio of 0.76%, which is below the category average of 1.23%. The fund has three and five-year returns of 11.8% and 9.9%, respectively.  T. Rowe Price Financial Services Fund PRISX  seeks both capital growth and current income. The majority of its assets are invested in financial services sector companies. It may also purchase securities of companies involved in providing financial software. The fund uses fundamental bottom-up analysis in order to select securities. This Zacks sector - Sector-Finance product has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds, please click here  . PRISX has a Zacks Mutual Fund Rank #2 and an annual expense ratio of 0.87%, which is below the category average of 1.43%. The fund has three and five-year returns of 13.3% and 9.2%, respectively.  Want key mutual fund info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing mutual funds, each week.  Get it free >>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Get Your Free (FSHCX): Fund Analysis Report   Get Your Free (FDLSX): Fund Analysis Report   Get Your Free (PRISX): Fund Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Per the lates t report  from the Institute of Supply Management (ISM) on Sep 5, its service index came in at 56.4% in August, surpassing the consensus estimate of 54.2%. Further, the rise in the index follows a three-year low of 53.7% it had witnessed in July.",
    "A reading above 50% indicates that the non-manufacturing sector economy is generally expanding. An improvement in the metric indicates that America's economy has remained resilient to global economic slowdown and effects of a protracted trade war with China. Gains were broad-based and occurred in 16 out of the total 17 industries that were surveyed.",
    "Under such circumstances, investing in mutual funds having significant exposure to services-related companies may prove prudent.",
    " ISM Services Index Hits 3-Month High ",
    "The service side of America's economy hit its fastest pace of growth in the past three months. As a matter of fact, service-oriented businesses remained strong in August, improving for 115 consecutive months.",
    "It should be noted that a reading for the non-manufacturing index above 48.6% over time indicates that the overall economy is expanding. Moreover, the reading for August also states that the overall economy has expanded for 121 consecutive months.",
    "Furthermore, the Non-Manufacturing Business Activity Indexsurged to 61.5% in the month of August, posting growth for 121 months on the trot. Also, the Prices Index grew to 58.2% in the month. Moreover, ISM's Non-Manufacturing New Orders Index increased to 60.3% in the month, compared to the July reading of 54.1%. Meanwhile, new orders grew for the 121st consecutive month in August.",
    " 3 Best Choices ",
    "We have, thus, selected three mutual funds carrying a Zacks Mutual Fund Rank #1 (Strong Buy) or 2 (Buy) that are great for a retirement portfolio. Moreover, these funds have encouraging three and five-year returns. Additionally, the minimum initial investment is within $5000.",
    "We expect these funds to outperform their peers in the future. Remember, the goal of the Zacks Mutual Fund Rank is to guide investors to identify potential winners and losers. Unlike most of the fund-rating systems, the Zacks Mutual Fund Rank is not just focused on past performance, but also on the likely future success of the fund.",
    "The question here is: why should investors consider mutual funds? Reduced transaction costs and diversification of portfolio without several commission charges that are associated with stock purchases are primarily why one should be parking money in mutual funds (read more:  Mutual Funds: Advantages, Disadvantages, and How They Make Investors Money  ).",
    " Fidelity Select Leisure Portfolio  FDLSX  fund invests a bulk of its assets in securities of companies engaged in the design, production or distribution of goods or services in the leisure and recreation industries. The fund seeks growth of capital and invests both in U.S. and non-U.S. companies.",
    "This Zacks sector - Sector-Other product has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds, please click here  .",
    "FDLSX has a Zacks Mutual Fund Rank#1 and an annual expense ratio of 0.76%, which is below the category average of 1.23%. The fund has three and five-year returns of 16.6% and 12.4%, respectively.",
    " Fidelity Select Health Care Services Portfolio FSHCX  fund invests a large chunk of its assets in companies that either own or are involved in operating hospital and nursing homes, and are related to the healthcare services sector. FSHCX seeks appreciation of capital. The fund invests in securities of both U.S. and non-U.S. companies.",
    "This Zacks sector - Sector-Health product has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds, please click here  .",
    "FSHCX has a Zacks Mutual Fund Rank#1 and an annual expense ratio of 0.76%, which is below the category average of 1.23%. The fund has three and five-year returns of 11.8% and 9.9%, respectively.",
    " T. Rowe Price Financial Services Fund PRISX  seeks both capital growth and current income. The majority of its assets are invested in financial services sector companies. It may also purchase securities of companies involved in providing financial software. The fund uses fundamental bottom-up analysis in order to select securities.",
    "This Zacks sector - Sector-Finance product has a history of positive total returns for more than 10 years. To see how this fund performed compared in its category, and other 1 and 2 Ranked Mutual Funds, please click here  .",
    "PRISX has a Zacks Mutual Fund Rank #2 and an annual expense ratio of 0.87%, which is below the category average of 1.43%. The fund has three and five-year returns of 13.3% and 9.2%, respectively.",
    " Want key mutual fund info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing mutual funds, each week.  Get it free >> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:26:00"
}