{
  "url": "https://www.nasdaq.com/article/heres-why-aimmune-therapeutics-stock-is-surging-today-cm1210677",
  "title": "Here's Why Aimmune Therapeutics Stock Is Surging Today - Nasdaq.com",
  "text": [
    "Shares of Aimmune Therapeutics (NASDAQ: AIMT) , a clinical-stage biotech focused on severe allergic reaction prevention, are jumping after an indirect push forward from the FDA. The regulator released a briefing document ahead of this Friday's advisory committee meeting to discuss the company's only late-stage new drug candidate, and investors are reacting to a welcome lack of surprises. The stock was up 12.4% as of 12:19 p.m. EDT on Wednesday.",
    "The FDA becomes privy to so much proprietary information during the normal course of drug development that nearly all communications between U.S. regulators and biopharmaceutical companies are considered private and not subject to disclosure. Aimmune shares were given a lift today by a lack of surprises in the briefing document that outlines issues the FDA wants to discuss with independent experts before granting Aimmune approval to market AR101 under the brand name Palforzia.",
    "Image source: Getty Images.",
    "A lack of surprises might not seem like much, but it doesn't always happen this way. The FDA is usually clear about what it wants to see in order to feel confident about granting a new drug approval. Unfortunately, producing clinical trial results the agency wants to see can delay a new drug application for years.",
    "As you can probably imagine, there aren't many clinical-stage drugmakers willing to broadcast the FDA's concerns about their late-stage development plans if they don't have to. That's why advisory committee briefing documents are usually the first time investors learn about the FDA's most troubling concerns .",
    "The biggest problem highlighted by the FDA had to do with the drug's overall safety-to-benefit ratio. Steady dosing with Palforzia reduced adverse events self-reported by patients in response to accidental food allergen exposure from 11.5% to 9% during the maintenance treatment period.",
    "The small observed reduction in real-world attacks isn't insignificant, but the FDA has been troubled by 6.1% of Palforzia recipients resorting to epinephrine use to stop a reaction most likely caused by the treatment itself. That's almost twice the rate of the placebo group, just 3.1% of which had to reach for an EpiPen.",
    "It's hard to tell if people with severe peanut allergies are better off risking a minor reaction to Palforzia in return for the protective benefit it provides. Without any available options for a large group of severe peanut allergy patients, though, Aimmune's chances of becoming a commercial-stage company soon look pretty good.",
    "10 stocks we like better than Aimmune Therapeutics\r\n When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Aimmune Therapeutics wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
    "See the 10 stocks",
    "*Stock Advisor returns as of June 1, 2019",
    "Cory Renauer has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 12:47:00"
}