{
  "url": "https://www.nasdaq.com/article/is-visa-stock-a-buy-after-rising-34-in-2019-cm1207561",
  "title": "Is Visa Stock a Buy After Rising 34% in 2019? - Nasdaq.com",
  "text": [
    "  Visa    's (NYSE: V) stock price has risen 34% so far in 2019 and 56%   since the beginning of 2018. The S&P 500 has risen only 14.5%   year-to-date, which begs the question: Considering Visa's recent   outperformance, how much further can its stock go? The transition to digital transactions over cash maintains a   strong tailwind, sparking the debate on how to fully capitalize   on the opportunity and which company you should be holding. There   are several companies in the credit card space including Visa,   MasterCard    (NYSE: MA) ,   American Express    ,   JCB    , and   Discover    . Visa, however, is the leading issuer in transactions globally   and is projected to maintain that lead in the foreseeable   future.   Data source: Company filings. Chart by author.makeArticleAd();  Contrary to popular belief, Visa does not lend borrowers   money, meaning Visa doesn't profit from the interest charged to   the borrower. Interest payments are paid to the card-issuing   institution such as   Capital One     or   Bank of America    , which is great for Visa because the company is sheltered from   borrower default risk. Over 95% of Visa's revenue comes from three segments:   services, data processing, and international transactions. During   the third-quarter of 2019, the data processing segment drove 36%   of revenue, followed by the services segment at 33%, and the   international transaction segment at 27%. Each segment grew above   8% year over year -- data processing led the way with an   impressive 12.8% growth rate. Revenue growth is dependent on the geographic reach and   transaction volume increasing from current customers. Going   forward, growth will likely depend upon eWallets and mobile   transactions, which according to a Worldpay Global Payments   Report from 2018, made up 34% of preferred payment methods, while   credit cards accounted for 23% and debit cards 12%. Visa is focused on making transactions simple and fast through   Visa Direct as the market demands payment convenience. A platform   for business and person-to-person (P2P) payments allows   individuals and businesses to transfer funds to a debit account   in less than 30 minutes. Visa states there is a $10 trillion   opportunity in the U.S., splitting $9 trillion in business   disbursements and $1 trillion in P2P. In most cases, it takes a   few days or weeks to receive a reimbursement from an insurance   company in the form of a check, and an Automated Clearing House   (ACH) direct deposit can be slow, requiring bank and routing   account information. Visa Direct speeds this process up and   allows consumers to move money fast, using direct transfer. In 2018, Visa announced a partnership agreement with   Western Union    to implement Visa Direct's payment platform. Nearly $80 trillion   is transferred annually, 85% in cash. Western Union reached 200   countries and 800 million transactions in 2018. As Visa builds   partnerships with companies including Western Union,   Square    , and   PayPal    to expand the reach and convenience of transactions, the company   can cement its place in the market and establish growth in market   share. In addition to its Western Union partnership, Visa recently   announced the acquisition of   Earthport    , a company that specializes in cross-border payments and money   transfer services. This acquisition, as stated by Visa, \"will be   able to reach the vast majority of the world's banked population   and allow them to easily, quickly, and securely move money   worldwide.\" Regarding competition, the \"apples-to-apples comparison\" is   MasterCard, as the business models are more alike than any other   two companies and the two are overwhelmingly pitted against one   another by analysts and investors. Visa's trailing twelve-month operating margin is 65.87% while   MasterCard maintains an operating margin of 51.77%. This shows   that Visa is operating at a lower cost structure over MasterCard.   Additionally, when comparing the value of each stock price, Visa   is currently trading at a price-to-earnings ratio (P/E) of 35x   while MasterCard is trading at 42x earnings. Price-to-earnings   can be controversial, however, it provides a good snapshot of   stock price value when considered with two alike business models   in the same industry. These fundamental comparisons aren't   conclusively in favor of Visa by any means. They do, however,   demonstrate that Visa is leading in value when considering these   two comparisons. Visa analysts predict $22.92 billion of revenue in 2019 and   $25.55 billion in 2020. These estimates, if correct, would   provide 11.2% in sales growth in 2019 and 11.5% in 2020. Earnings   per share estimates are $5.4 for 2019 -- 15.3% year-over-year   growth -- and $6.26 for 2020 -- 16% growth over the previous   year.   Data source: Company filings. Chart by author.  Establishing a strong foothold against competitors by aligning   strategic partnerships is key in the race to the payment   transition. The continued strength of Visa is reliant on total   spending in volume, cross-border spending, and a subset of total   transactions processed on the network. Visa has grown 11% in   payments volume, 10% in cross-border volume, and 12% in processed   transactions year over year from 2017 to 2018. 2019 growth is   estimated to match or beat 2018 results. If Visa can meet or exceed analysts' 2019 revenue estimate of   $22.92 billion and an EPS estimate of $5.4, it would not be   outlandish to assume the stock price will stay the course and   rise alongside the growth of the company, maintaining the   impressive YTD share price increase.  10 stocks we like better than Visa     When investing geniuses David and Tom Gardner have a stock tip,   it can pay to listen. After all, the newsletter they have run for   over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.* David and Tom just revealed what they believe are the   ten best stocks    for investors to buy right now... and Visa wasn't one of them!   That's right -- they think these 10 stocks are even better   buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       Justin Cardwell      owns shares of Bank of America, Mastercard, and Visa. The     Motley Fool owns shares of and recommends Mastercard, PayPal     Holdings, Square, and Visa. The Motley Fool has the following     options: short September 2019 $70 puts on Square and short     October 2019 $97 calls on PayPal Holdings. The Motley Fool has     a     disclosure policy      .  ",
    " Visa    's (NYSE: V) stock price has risen 34% so far in 2019 and 56%   since the beginning of 2018. The S&P 500 has risen only 14.5%   year-to-date, which begs the question: Considering Visa's recent   outperformance, how much further can its stock go?",
    "The transition to digital transactions over cash maintains a   strong tailwind, sparking the debate on how to fully capitalize   on the opportunity and which company you should be holding. There   are several companies in the credit card space including Visa,   MasterCard    (NYSE: MA) ,   American Express    ,   JCB    , and   Discover    . Visa, however, is the leading issuer in transactions globally   and is projected to maintain that lead in the foreseeable   future.",
    "  Data source: Company filings. Chart by author.makeArticleAd(); ",
    "Data source: Company filings. Chart by author.",
    "Contrary to popular belief, Visa does not lend borrowers   money, meaning Visa doesn't profit from the interest charged to   the borrower. Interest payments are paid to the card-issuing   institution such as   Capital One     or   Bank of America    , which is great for Visa because the company is sheltered from   borrower default risk.",
    "Over 95% of Visa's revenue comes from three segments:   services, data processing, and international transactions. During   the third-quarter of 2019, the data processing segment drove 36%   of revenue, followed by the services segment at 33%, and the   international transaction segment at 27%. Each segment grew above   8% year over year -- data processing led the way with an   impressive 12.8% growth rate.",
    "Revenue growth is dependent on the geographic reach and   transaction volume increasing from current customers. Going   forward, growth will likely depend upon eWallets and mobile   transactions, which according to a Worldpay Global Payments   Report from 2018, made up 34% of preferred payment methods, while   credit cards accounted for 23% and debit cards 12%.",
    "Visa is focused on making transactions simple and fast through   Visa Direct as the market demands payment convenience. A platform   for business and person-to-person (P2P) payments allows   individuals and businesses to transfer funds to a debit account   in less than 30 minutes. Visa states there is a $10 trillion   opportunity in the U.S., splitting $9 trillion in business   disbursements and $1 trillion in P2P. In most cases, it takes a   few days or weeks to receive a reimbursement from an insurance   company in the form of a check, and an Automated Clearing House   (ACH) direct deposit can be slow, requiring bank and routing   account information. Visa Direct speeds this process up and   allows consumers to move money fast, using direct transfer.",
    "In 2018, Visa announced a partnership agreement with   Western Union    to implement Visa Direct's payment platform. Nearly $80 trillion   is transferred annually, 85% in cash. Western Union reached 200   countries and 800 million transactions in 2018. As Visa builds   partnerships with companies including Western Union,   Square    , and   PayPal    to expand the reach and convenience of transactions, the company   can cement its place in the market and establish growth in market   share.",
    "In addition to its Western Union partnership, Visa recently   announced the acquisition of   Earthport    , a company that specializes in cross-border payments and money   transfer services. This acquisition, as stated by Visa, \"will be   able to reach the vast majority of the world's banked population   and allow them to easily, quickly, and securely move money   worldwide.\"",
    "Regarding competition, the \"apples-to-apples comparison\" is   MasterCard, as the business models are more alike than any other   two companies and the two are overwhelmingly pitted against one   another by analysts and investors.",
    "Visa's trailing twelve-month operating margin is 65.87% while   MasterCard maintains an operating margin of 51.77%. This shows   that Visa is operating at a lower cost structure over MasterCard.   Additionally, when comparing the value of each stock price, Visa   is currently trading at a price-to-earnings ratio (P/E) of 35x   while MasterCard is trading at 42x earnings. Price-to-earnings   can be controversial, however, it provides a good snapshot of   stock price value when considered with two alike business models   in the same industry. These fundamental comparisons aren't   conclusively in favor of Visa by any means. They do, however,   demonstrate that Visa is leading in value when considering these   two comparisons.",
    "Visa analysts predict $22.92 billion of revenue in 2019 and   $25.55 billion in 2020. These estimates, if correct, would   provide 11.2% in sales growth in 2019 and 11.5% in 2020. Earnings   per share estimates are $5.4 for 2019 -- 15.3% year-over-year   growth -- and $6.26 for 2020 -- 16% growth over the previous   year.",
    "  Data source: Company filings. Chart by author. ",
    "Data source: Company filings. Chart by author.",
    "Establishing a strong foothold against competitors by aligning   strategic partnerships is key in the race to the payment   transition. The continued strength of Visa is reliant on total   spending in volume, cross-border spending, and a subset of total   transactions processed on the network. Visa has grown 11% in   payments volume, 10% in cross-border volume, and 12% in processed   transactions year over year from 2017 to 2018. 2019 growth is   estimated to match or beat 2018 results.",
    "If Visa can meet or exceed analysts' 2019 revenue estimate of   $22.92 billion and an EPS estimate of $5.4, it would not be   outlandish to assume the stock price will stay the course and   rise alongside the growth of the company, maintaining the   impressive YTD share price increase.",
    " 10 stocks we like better than Visa     When investing geniuses David and Tom Gardner have a stock tip,   it can pay to listen. After all, the newsletter they have run for   over a decade,   Motley Fool Stock Advisor    , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the   ten best stocks    for investors to buy right now... and Visa wasn't one of them!   That's right -- they think these 10 stocks are even better   buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Justin Cardwell      owns shares of Bank of America, Mastercard, and Visa. The     Motley Fool owns shares of and recommends Mastercard, PayPal     Holdings, Square, and Visa. The Motley Fool has the following     options: short September 2019 $70 puts on Square and short     October 2019 $97 calls on PayPal Holdings. The Motley Fool has     a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 04:03:00"
}