{
  "url": "https://www.nasdaq.com/article/global-markets-rebound-geopolitical-fears-ease-trade-war-and-central-banks-remain-in-focus-cm1207475",
  "title": "Global Markets Rebound, Geopolitical Fears Ease, Trade War And Central Banks Remain In Focus - Nasdaq.com",
  "text": [
    "The U.S. futures are indicating a positive open on Monday after events in Hong Kong and the UK helped ease global tensions. In Hong Kong, city manager Carrie Lam withdrew the controversial bill that sparked the last few months of violent protesting. The move is seen as one that may help smooth the way for a U.S./China trade deal because it reduces turmoil for China at home.",
    "In the UK, a bipartisan group of MPs has successfully moved to introduce a bill that would block a hard-Brexit. The bill is yet to pass and PM Boris Johnson has already began the push for snap-general elections. Needless to say, while the news is good today it does little to alter the fact Brexit drama is going to intensify over the next 8 weeks.",
    "Today's move in the indices is just a day after weaker than expected manufacturing data sent the market down more than -1.25%. The NASDAQ Composite is in the lead with a gain of 1.05% while the Dow Jones and S&P 500 are both up about 0.85%. In stock news , shares of Michael's are moving higher after announcing much better than expected 2nd quarter results. The arts and crafts retailer says comps were strong and should drive growth the remainder of the year. Shares advanced more than 20% on the news.",
    "EU markets are broadly higher although gains are not even among the top indices. The DAX and CAC are both up more than 1.0% while the UK FTSE 100 trails with a gain near 0.40%. The Brexit news is good for general sentiment, it may stave off the economic chaos of a no-deal exit, but it does little to calm frayed nerves in the UK. The drama will continue and, if the bill is passed, maybe prolonged indefinitely. Autos are up more than 2.0% on today's news as is the British Pound.",
    "Elsewhere in the region news is good as well. The word from Italy is that opposition party members voted overwhelmingly in favor of forming a coalition with the current ruling party. The news means Italy can form a new government under the existing PM. In stock news, shares of Thales are up 7.0% on 2nd quarter results while Iliad is moving lower and at the bottom of the rankings after a downgrade from BAML.",
    "Asian markets are mostly higher on Wednesday following Carrie Lam's withdrawal of the controversial extradition bill. Hong Kong led the gains with an advance near 4.0%, others in the region were less buoyant. The Shanghai Composite advanced nearly 1.0% on news the Chinese manufacturing sector expanded at the fastest rate in three months. Shares in Australia were the only to close lower, the ASX shed about -0.30% after GDP came in as expected at 0.50% MOM and 1.4% YOY.",
    "This article was originally posted on FX Empire",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 08:53:24"
}