{
  "url": "https://www.nasdaq.com/article/heres-why-uber-lyft-and-slack-arent-the-ipos-investors-dreamed-about-cm1210816",
  "title": "Here’s Why Uber, Lyft, and Slack Aren’t the IPOs Investors Dreamed About - Nasdaq.com",
  "text": [
    " So much for   Uber    (NYSE: UBER) ,   Lyft    (NASDAQ: LYFT) , and   Slack    (NYSE: WORK) being the initial public offerings investors dreamed   about. All three stocks are languishing ever since their   debuts despite high expectations. Take ridesharing start-up Lyft. The stock is 43% lower since   its IPO in late March. Slack isn't doing much better -- shares   are down 36% since it went public near the end of June. Uber's   off 22% since May. All in all, it's a dismal showing for a group   of Internet start-ups that have transformed the way we work and   get around. There are many reasons for investors to be disillusioned with   these three. The companies may have amassed millions of customers   and raised hundreds of millions of dollars, but profitability   eludes them -- as does a path to achieving it.makeArticleAd(); It doesn't help that sentiment is changing. Investors are   growing weary of the narrative that profit doesn't matter. The   idea of growing at all costs may have served them well as private   enterprises. But with investors to answer to, profitability   matters as much as growth. That is something all three haven't   been able to deliver on yet, which is reflected in their   performance as publicly-traded companies.   Image source: Getty Images.  Profit eludes all three Take   Slack    , the seemingly fast-growing maker of a mobile communication app.   It was able to beat Wall Street expectations for its first   quarter as a public company, but its guidance for a   wider-than-expected third-quarter loss and a decline in revenue   for the full year has spooked investors. It was only a year ago   that Slack had revenue growth of 100%. That's now forecast to be   around 50% for fiscal year 2020. Investors are concerned that   Slack is more of a flash in the pan that won't be able to keep   competition from   Microsoft     at bay. Then there's Uber. For its second quarter, it posted a wider   per-share loss and lower revenue than expected. It had a record   net loss of $5.2 billion, with most of it due to its stock-based   compensation costs. Excluding that expense, Uber reported a loss   of $1.3 billion, which is about 30% more than in the first   quarter. Revenue was up only 14% versus last year's second   quarter, raising concerns about its ability to grow. The   ride-hailing company recently laid off 400 people in its   marketing department in an effort to reduce costs and increase   efficiency. Its rival   Lyft    had its own losses to deal with: $644.2 million, or $2.23 a   share, in its second quarter, which was much wider than the $1.58   a share that analysts were expecting. It did report revenue that   was up 72% year over year. Growth is always on their minds During conference calls and media appearances following their   quarterly earnings reports, executives of the three companies   talked about profitability as a future goal but not something   they were worried about now. In their minds, growth in fiercely   competitive environments is still the No. 1 objective. \"We can push the company to break even if we really wanted to,   frankly,\" said Uber CEO Dara Khosrowshahi in   an interview with CNBC    . Meanwhile, Slack CEO Stewart Butterfield told   CNBC    that the company is investing its $800 million in cash on growth.   The idea is to create new features and draw more business to its   platform. Lyft CEO Brian Roberts has been quoted as saying he   thinks losses peaked last year, but has been vague when it comes   to its break-even date. Brushing off the need for profitability may have been OK a   couple of years ago, but not in the current environment. Had   these companies tapped the public markets before scandals,   missteps, and executive departures plagued them (at least in the   case of Uber and Lyft), the stocks may have performed better. But with the economy showing signs of a   slowdown    and with these companies losing huge amounts of money, investor   sentiment is shifting. It's the reason Uber, which was billed as   the next   Alibaba    , didn't deliver in its IPO. (Alibaba holds the title for the   biggest tech IPO ever, raising $25 billion.) It's why Lyft is   facing lawsuits since its IPO and why investors are questioning   Slack's staying power. Profit -- or a path toward it -- matters   more than growing at all costs.   10 stocks we like better than Uber     Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Uber Technologies wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019       Teresa Kersten, an employee of LinkedIn, a Microsoft     subsidiary, is a member of The Motley Fool's board of     directors.     Donna Fuscaldo      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends MSFT and Slack Technologies. The     Motley Fool has the following options: long January 2021 $85     calls on MSFT. The Motley Fool recommends Uber Technologies.     The Motley Fool has a     disclosure policy      .  ",
    "So much for   Uber    (NYSE: UBER) ,   Lyft    (NASDAQ: LYFT) , and   Slack    (NYSE: WORK) being the initial public offerings investors dreamed   about. All three stocks are languishing ever since their   debuts despite high expectations.",
    "Take ridesharing start-up Lyft. The stock is 43% lower since   its IPO in late March. Slack isn't doing much better -- shares   are down 36% since it went public near the end of June. Uber's   off 22% since May. All in all, it's a dismal showing for a group   of Internet start-ups that have transformed the way we work and   get around.",
    "There are many reasons for investors to be disillusioned with   these three. The companies may have amassed millions of customers   and raised hundreds of millions of dollars, but profitability   eludes them -- as does a path to achieving it.",
    "It doesn't help that sentiment is changing. Investors are   growing weary of the narrative that profit doesn't matter. The   idea of growing at all costs may have served them well as private   enterprises. But with investors to answer to, profitability   matters as much as growth. That is something all three haven't   been able to deliver on yet, which is reflected in their   performance as publicly-traded companies.",
    "  Image source: Getty Images. ",
    "Image source: Getty Images.",
    "Take   Slack    , the seemingly fast-growing maker of a mobile communication app.   It was able to beat Wall Street expectations for its first   quarter as a public company, but its guidance for a   wider-than-expected third-quarter loss and a decline in revenue   for the full year has spooked investors. It was only a year ago   that Slack had revenue growth of 100%. That's now forecast to be   around 50% for fiscal year 2020. Investors are concerned that   Slack is more of a flash in the pan that won't be able to keep   competition from   Microsoft     at bay.",
    "Then there's Uber. For its second quarter, it posted a wider   per-share loss and lower revenue than expected. It had a record   net loss of $5.2 billion, with most of it due to its stock-based   compensation costs. Excluding that expense, Uber reported a loss   of $1.3 billion, which is about 30% more than in the first   quarter. Revenue was up only 14% versus last year's second   quarter, raising concerns about its ability to grow. The   ride-hailing company recently laid off 400 people in its   marketing department in an effort to reduce costs and increase   efficiency.",
    "Its rival   Lyft    had its own losses to deal with: $644.2 million, or $2.23 a   share, in its second quarter, which was much wider than the $1.58   a share that analysts were expecting. It did report revenue that   was up 72% year over year.",
    "During conference calls and media appearances following their   quarterly earnings reports, executives of the three companies   talked about profitability as a future goal but not something   they were worried about now. In their minds, growth in fiercely   competitive environments is still the No. 1 objective.",
    "\"We can push the company to break even if we really wanted to,   frankly,\" said Uber CEO Dara Khosrowshahi in   an interview with CNBC    . Meanwhile, Slack CEO Stewart Butterfield told   CNBC    that the company is investing its $800 million in cash on growth.   The idea is to create new features and draw more business to its   platform. Lyft CEO Brian Roberts has been quoted as saying he   thinks losses peaked last year, but has been vague when it comes   to its break-even date.",
    "Brushing off the need for profitability may have been OK a   couple of years ago, but not in the current environment. Had   these companies tapped the public markets before scandals,   missteps, and executive departures plagued them (at least in the   case of Uber and Lyft), the stocks may have performed better.",
    "But with the economy showing signs of a   slowdown    and with these companies losing huge amounts of money, investor   sentiment is shifting. It's the reason Uber, which was billed as   the next   Alibaba    , didn't deliver in its IPO. (Alibaba holds the title for the   biggest tech IPO ever, raising $25 billion.) It's why Lyft is   facing lawsuits since its IPO and why investors are questioning   Slack's staying power. Profit -- or a path toward it -- matters   more than growing at all costs.",
    "  10 stocks we like better than Uber     Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Uber Technologies wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Uber     Technologies       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Uber Technologies wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    " Teresa Kersten, an employee of LinkedIn, a Microsoft     subsidiary, is a member of The Motley Fool's board of     directors.     Donna Fuscaldo      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends MSFT and Slack Technologies. The     Motley Fool has the following options: long January 2021 $85     calls on MSFT. The Motley Fool recommends Uber Technologies.     The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 07:00:00"
}