{
  "url": "https://www.nasdaq.com/article/why-amicus-therapeutics-tanked-in-august-cm1210506",
  "title": "Why Amicus Therapeutics Tanked in August - Nasdaq.com",
  "text": [
    " What happened Shares of rare-disease drugmaker   Amicus Therapeutics    (NASDAQ: FOLD) shed 20% of their value in August, according   to data from   S&P Global Market Intelligence    . And what caused investors to head for the exits last month?   Apparently, a question. On Aug. 8, Amicus released its second-quarter earnings report.   During the conference call that followed,   Bank of America    analyst   Tazeen Ahmad    noted that rival   Sanofi    's (NASDAQ: SNY) ongoing Phase 3 Pompe disease study for neoGAA   should read out ahead of Amicus' late-stage Pompe trial for   AT-GAA. The analyst also questioned whether the neoGAA study's   lung function primary endpoint might be viewed more favorably   among caregivers than AT-GAA's 6-minute walk test.   Image Source: Getty Images.makeArticleAd();  So what The stock's nosedive following this line of questioning   by Ahmad is a testament to just how nervous the market is   about Amicus's competitive position in Pompe disease. It's not   exactly breaking news that Sanofi's neoGAA program will deliver   its data almost a year ahead of AT-GAA's pivotal trial, after   all. What's important to keep in mind is that Amicus is aiming to   develop AT-GAA into the   gold standard    for Pompe disease. As such, the therapy's efficacy and safety   results will be paramount -- not how quickly they are   released. Now what Should investors take advantage of this dip? While Amicus'   shares now trade well below their 52-week high, the   biotech's stock    valuation remains in nosebleed territory at more than 20 times   the company's trailing 12-month sales. That's one of the richest   valuations in the entire healthcare sector at the moment. So   while it may seem like this double-digit percentage selloff has   provided investors with an attractive entry point, it might be a   good idea to take a cautious approach with this rare-disease   stock for the time being.   10 stocks we like better than Amicus     Therapeutics       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amicus Therapeutics     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        George Budwell      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "Shares of rare-disease drugmaker   Amicus Therapeutics    (NASDAQ: FOLD) shed 20% of their value in August, according   to data from   S&P Global Market Intelligence    . And what caused investors to head for the exits last month?   Apparently, a question.",
    "On Aug. 8, Amicus released its second-quarter earnings report.   During the conference call that followed,   Bank of America    analyst   Tazeen Ahmad    noted that rival   Sanofi    's (NASDAQ: SNY) ongoing Phase 3 Pompe disease study for neoGAA   should read out ahead of Amicus' late-stage Pompe trial for   AT-GAA. The analyst also questioned whether the neoGAA study's   lung function primary endpoint might be viewed more favorably   among caregivers than AT-GAA's 6-minute walk test.",
    "  Image Source: Getty Images.makeArticleAd(); ",
    "Image Source: Getty Images.",
    "The stock's nosedive following this line of questioning   by Ahmad is a testament to just how nervous the market is   about Amicus's competitive position in Pompe disease. It's not   exactly breaking news that Sanofi's neoGAA program will deliver   its data almost a year ahead of AT-GAA's pivotal trial, after   all. What's important to keep in mind is that Amicus is aiming to   develop AT-GAA into the   gold standard    for Pompe disease. As such, the therapy's efficacy and safety   results will be paramount -- not how quickly they are   released.",
    "Should investors take advantage of this dip? While Amicus'   shares now trade well below their 52-week high, the   biotech's stock    valuation remains in nosebleed territory at more than 20 times   the company's trailing 12-month sales. That's one of the richest   valuations in the entire healthcare sector at the moment. So   while it may seem like this double-digit percentage selloff has   provided investors with an attractive entry point, it might be a   good idea to take a cautious approach with this rare-disease   stock for the time being.",
    "  10 stocks we like better than Amicus     Therapeutics       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amicus Therapeutics     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Amicus     Therapeutics       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Amicus Therapeutics     wasn't one of them! That's right -- they think these 10 stocks     are even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  George Budwell      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:23:00"
}