{
  "url": "https://www.nasdaq.com/article/wall-street-rises-on-apple-trade-optimism-20190911-00616",
  "title": "Wall Street rises on Apple, trade optimism - Nasdaq.com",
  "text": [
    "By Uday Sampath Kumar",
    "Sept 11 (Reuters) - U.S. stocks rose on Wednesday, lifted by Apple a day after the launch of its latest iPhones and as China moved to ease trade tensions with the United States by exempting certain goods from additional retaliatory tariffs.",
    "Apple Inc  rose 2.60%, boosting all three major indexes by the most, as it also rolled out a streaming TV service at a price that undercuts Walt Disney Co  and Netflix Inc . ",
    "Tech stocks bounced from a drop in the previous session, which saw investors moving to more value-oriented stocks from growth shares.",
    "Adding to the positive momentum, China's finance ministry moved to exempt 16 types of U.S. goods, including lubricants and some animal feed ingredients, from additional retaliatory tariffs, ahead of a planned meeting between trade negotiators. ",
    "While on the surface, the move is seen as a friendly gesture to thaw relations with the United States, analysts are skeptical about how much it will move the needle in resolving a protracted trade war that has hurt the global economy.",
    "The nature of the goods that are being exempted are staples and indicates that China's decision is likely more to do with supporting its own economy rather than extending an olive branch to the United States, Ed Egilinsky, head of alternative investments at Direxion said.",
    "\"There's a big difference between today's move and sitting down at the negotiating table and actually ironing out a deal.\"",
    "Comments from a senior White House adviser on Tuesday urging investors to be patient about resolving the dispute further downplayed expectations that a trade deal would be agreed this year. ",
    "Investors held out on big bets ahead of stimulus decisions from central banks to stem a global slowdown. The U.S. Federal Reserve and the European Central Bank are expected to cut interest rates at their policy meetings over the next two weeks.",
    "U.S. President Donald Trump on Wednesday renewed his attacks on Fed Chairman Jerome Powell, saying that the central bank should get interest rates down to \"ZERO, or less.\"",
    "At 11:56 a.m. ET, the Dow Jones Industrial Average  was up 99.22 points, or 0.37%, at 27,008.65, the S&P 500  was up 11.71 points, or 0.39%, at 2,991.10 and the Nasdaq Composite  was up 61.37 points, or 0.76%, at 8,145.52.",
    "Among other stocks, shares of Micron Technology Inc  rose 2.49% after Longbow Research upgraded its stock to \"buy\".",
    "Baker Hughes shares  fell 3.63%, the most among S&P 500 companies, after parent General Electric  looked to sell a majority stake in the oilfield services provider. ",
    "Advancing issues outnumbered decliners for a 1.90-to-1 ratio on the NYSE and a 2.25-to-1 ratio on the Nasdaq.",
    "The S&P index recorded 22 new 52-week highs and no new low, while the Nasdaq recorded 43 new highs and nine new lows."
  ],
  "published_datetime": "2019-09-11 12:25:00"
}