{
  "url": "https://www.nasdaq.com/article/kellogg-goes-after-beyond-meat-cm1207591",
  "title": "Kellogg Goes After Beyond Meat - Nasdaq.com",
  "text": [
    " The meteoric rise of   Beyond Meat    (NASDAQ: BYND) stock this year doesn't make all that much sense.   The imitation meat company is valued at roughly $10 billion,   around 40 times its expected 2019 sales. That nosebleed valuation   may not hold up as competition in the space intensifies.  Kellogg    (NYSE: K) , which already sells the No. 1 veggie burger in the   U.S. under its MorningStar Farms brand, plans to go after Beyond   Meat, Impossible Foods, and the rest of the plant-based meat   alternatives market in 2020 with a new line of products. The new   Incogmeato brand will feature plant-based burger patties,   plant-based nuggets, and plant-based tenders.   Image source: Kellogg.makeArticleAd();  Kellogg's new products will be made from non-GMO soy, making   them similar to the soy-based products from Impossible Foods.   Beyond Meat's products are based on pea protein, as well as over   a dozen other ingredients. Kellogg plans to have its Incogmeato products available in the   refrigerated and freezer sections of   grocery stores    in early 2020. Those sections are becoming increasingly crowded   with fake meat products. In addition to Kellogg,   Tyson Foods    is   working on its own plant-based meat products    , and a slew of other brands are already available. Beyond Meat finds itself in a sea of very similar products. It   will need to stand out enough to generate a level of sales growth   necessary to justify its frothy valuation, a prospect that will   become more difficult with each new competitor. If Kellogg   decides to undercut Beyond Meat on price, that could spell big   trouble for the trendy faux meat company.   10 stocks we like better than Kellogg       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Kellogg wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Timothy Green      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      .  ",
    "The meteoric rise of   Beyond Meat    (NASDAQ: BYND) stock this year doesn't make all that much sense.   The imitation meat company is valued at roughly $10 billion,   around 40 times its expected 2019 sales. That nosebleed valuation   may not hold up as competition in the space intensifies.",
    " Kellogg    (NYSE: K) , which already sells the No. 1 veggie burger in the   U.S. under its MorningStar Farms brand, plans to go after Beyond   Meat, Impossible Foods, and the rest of the plant-based meat   alternatives market in 2020 with a new line of products. The new   Incogmeato brand will feature plant-based burger patties,   plant-based nuggets, and plant-based tenders.",
    "  Image source: Kellogg.makeArticleAd(); ",
    "Image source: Kellogg.",
    "Kellogg's new products will be made from non-GMO soy, making   them similar to the soy-based products from Impossible Foods.   Beyond Meat's products are based on pea protein, as well as over   a dozen other ingredients.",
    "Kellogg plans to have its Incogmeato products available in the   refrigerated and freezer sections of   grocery stores    in early 2020. Those sections are becoming increasingly crowded   with fake meat products. In addition to Kellogg,   Tyson Foods    is   working on its own plant-based meat products    , and a slew of other brands are already available.",
    "Beyond Meat finds itself in a sea of very similar products. It   will need to stand out enough to generate a level of sales growth   necessary to justify its frothy valuation, a prospect that will   become more difficult with each new competitor. If Kellogg   decides to undercut Beyond Meat on price, that could spell big   trouble for the trendy faux meat company.",
    "  10 stocks we like better than Kellogg       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Kellogg wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Kellogg       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Kellogg wasn't one of     them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Timothy Green      has no position in any of the stocks mentioned. The Motley Fool     has no position in any of the stocks mentioned. The Motley Fool     has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 06:07:00"
}