{
  "url": "https://www.nasdaq.com/article/the-stock-market-is-not-looking-healthy-cm1206506",
  "title": "The Stock Market Is Not Looking Healthy - Nasdaq.com",
  "text": [
    "By Avi Gilburt, ElliottWaveTrader.net",
    "I am often asked to provide a sample of the analysis I provide to members. So, in this week’s article regarding the stock market, I chose to reproduce the general discussion I provided within my analysis posted to members on Saturday night. Please understand that my detailed charts and the discussion of the specific smaller degree analysis is being left out from this public update, and is only available to members.",
    "Back in the 1930s, an accountant named Ralph Nelson Elliott discovered that financial markets are fractal in nature. This means that they are variably self-similar at different degrees of trend.",
    "To that end, he explained that when a market is trending, it will most often display a rather predictable 5-wave structure. As an example, this structure is what allowed us to predict the rally from the 1800SPX region to over 2600SPX back in 2016, along with our expectation for a “global melt-up,” which we reiterated at election time “no matter who won.” It is what also allowed us to predict the bottoming to the bond market in late 2018, wherein we bought TLT in the 112-113 region, as well as the rally in metals in 2019.",
    "However, once the market completes a 5-wave structure, it then transitions into a corrective state, wherein it whipsaws in 3-wave moves and is much more variable in nature. As an example, this structure is what allowed us to predict the 20% pullback for the SPX in late 2018 once we broke below 2880SPX.",
    "Most recently, once the market completed the 5-wave structure into the high struck in July, it dropped in what is best counted as an initial 3-wave structure. This was the signal to us that the market has now likely transitioned from an impulsive nature into a corrective one, and had us warning our subscribers to be prepared for a wild, whipsaw market. And, the fact that the market has been whipsawing back and forth for the last month supports that perspective.",
    "But, as I noted above, when the market is in a corrective state, it becomes much more variable. While there are certainly signals and patterns we may follow within that corrective state to provide guidance as to its next probable move, the variability of corrective structures often lead to a difficult trading environment, as the market continues to whipsaw.",
    "Yet, this is one of the major benefits of understanding Elliott Wave analysis, for it places the market into a context which I have not seen from any other methodology. This allowed us to warn our members of potential whipsaw action weeks ago, and well before it began. And, when you are alerted to the changing nature of the market, you should be adjusting your trading rules during these corrective states, as trade sizes/risk should be reduced and profits taken often.",
    "Over the last week, we were giving the S&P 500 an opportunity to prove that it was either going to provide us with a 1-2 downside structure to start a c-wave, or morph into a b-wave triangle before that c-wave began. However, when the market broke out slightly over 2939SPX on Friday, it signaled that it may not yet be ready to immediately begin that c-wave down.",
    "Now, as I pointed out above that markets are fractal in nature, I want to highlight a market fractal from late 2018 (chart labeled “SPXfractal”). Basically, this suggests that market sentiment is tracing out a very similar pattern as was seen right before the December drop in 2018. Moreover, if you go back to 2015, 2012, 2011, and 1998 (and many other years as well), you will see a very similar fractal evident on the charts just before the market saw a sizeable decline. And, since history does not exactly repeat, yet does rhyme, when I see a fractal-like this developing in the market, it does place me on high alert for a potential downside setup.",
    "But, even though I view lower levels still to come, I have explained in many recent updates that those who intend to short for a c-wave decline would be best served to wait until the market has developed a 1-2, i-ii downside structure before they turn aggressive on the short side. The main reason is that this frames a potential impending decline in a more structured manner, with much more clearly defined parameters. And, it provides us with the highest probability immediate setup for an impending decline. Since the decline off the July highs, I have been tracking the potential for such a structure, but it has not yet materialized.",
    "The fact that I have been attempting to identify a downside setup may lead some of you to believe that I am a perma-bear. Yet, those that followed my analysis for many years would probably have called me a perma-bull back in early 2016. At the end of the day, I maintain no bias other than the one I read from the market in as objective a fashion as I can humanly attain.",
    "To that end, the one major factor which still keeps me from becoming too bullish too fast is the underlying stocks we track in the stock market. Remember, the stock market is comprised of many individual stocks. And, when the majority of the stocks we track have not pulled back in their larger degree 4th waves just yet, it tells me that I have to maintain a healthy degree of skepticism, at least until the market tells me otherwise. In fact, when I asked our StockWaves analysts how this week’s rally off the lows looks “under the hood,” Zac Mannes put it quite succinctly:",
    "it sounds like a big V8, but when you look under the hood... it is a hamster on a wheel and he looks one revolution away from a coronary.",
    "Yet, Zac did note that there are a few stocks that do have some bullish setups, such as Netflix and Ford as two examples. But, the majority do not support much upside in their current setups.",
    "Now, in taking a step back and putting all this action into perspective, I want you to focus upon the attached monthly chart. As you can see, my long-term perspective for many years has been that we can rally up towards as high as the 4100SPX region in the coming years before this bull market off the 2009 lows completes. That still leaves plenty of room on the upside over the coming years, and is approximately 33% higher than where we are now trading. Yet, we also see the potential for the market to decline 20-30% from where we are trading at this time. That basically means we are now stuck in the middle.",
    "So, rather than becoming aggressive in either direction at this time, I am going to maintain a bit more patience and allow the market to clarify its intentions over the coming months before I am willing to commit to the next 20%+ move. For now, my expectation remains that we will see much lower levels before the last leg of the bull market begins to take us to the 3800-4100 region.",
    "Avi Gilburt is a widely followed Elliott Wave analyst and founder of ElliottWaveTrader.net, a live trading room featuring his analysis on the S&P 500, precious metals, oil & USD, plus a team of analysts covering a range of other markets.  He recently founded FATRADER.com, a live forum featuring some of the top fundamental analysts online today to showcase research and elevate discussion for traders & investors interested in fundamental rather than technical analysis.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:49:48"
}