{
  "url": "https://www.nasdaq.com/article/tesla-goes-after-new-revenue-stream-with-auto-insurance-cm1207597",
  "title": "Tesla Goes After New Revenue Stream With Auto Insurance - Nasdaq.com",
  "text": [
    "  Tesla    (NASDAQ: TSLA) may be known for churning out eye-appealing green   vehicles, but it has found a new market to go after:   insurance. Several months after Tesla Chief Executive Elon Musk hinted   the Palo Alto, California-based company plans to offer customers   automobile insurance, it appears to be following through. Last   week it announced the launch of Tesla Insurance which it said can   save Tesla owners as much as 30% in rates. The insurance provides   comprehensive coverage and claims management to Tesla owners in   California. The company intends to expand its insurance to   additional states down the road. Tesla claims it can offer deeply   discounted rates because it is insuring its own vehicles. \"Tesla uniquely understands its vehicles, technology, safety,   and repair costs, and eliminates fees taken by traditional   insurance carriers,\" it wrote in   a blog post    . \"By pricing policies to reflect Tesla's active safety and   advanced driver assistance features, which come standard on all   new Tesla vehicles, Tesla Insurance is able   to offer reduced insurance costs for many eligible owners.\" Tesla   Insurance is currently available to all Model S, Model X, Model 3   and Roadster vehicles.makeArticleAd();  Tesla's cars are more expensive to insure  Tesla's entrance into the insurance market isn't only about   finding a new revenue stream. It's designed to solve a problem   that has long plagued the vehicle maker: Tesla cars are more   expensive than other types of vehicles to insure. According to   ValuePengiun    , the average cost of car insurance for a Tesla vehicle is   $2,450. That could increase depending on the model, trim,   location and driver's history operating a vehicle. Meanwhile last   year   USA Today named    the Tesla Model S four-door electric vehicle as the most   expensive vehicle to insure. Market watchers and customers contend these vehicles require   pricier insurance because of the costs to repair them in the   event of a collision. They point to the aluminum body of the   vehicle, the lack of expertise on the part of Tesla mechanics and   auto body repair specialists and replacement part expenses for   the higher-than-average repair costs. If Tesla is able to reduce   insurance premiums, it could alleviate any complaints when the   vehicles need repairs.   GETTY IMAGES   Warren Buffet warns Tesla could fail  News that Tesla is getting into the insurance business didn't   sit well with everyone, although Tesla vehicle owners will likely   rejoice if they can save money. Famed investor and head of   Berkshire Hathaway Warren Buffett warned Tesla will likely   struggle with its newfound business since car insurance isn't an   easy market to enter. \"The success of the auto companies getting   into the insurance business is probably as likely as the success   of the insurance companies getting into the auto business,\"   CNBC    quoted him as saying at the annual   Berkshire Hathaway    (NYSE: BRK.B) annual meeting. Buffett should know. Roughly   one-third of Berkshire Hathaway is in the insurance market   including its ownership of   GEICO    . Critics say selling auto insurance serves as a distraction to   a company that has long struggled with manufacturing snafus and   missed deadlines. Last month Tesla lost its director of   manufacturing quality J. Eric Purcell, who had been at the   company for about seven years. He was just the latest in a list   of executive departures at the company. It doesn't help that Tesla vehicles have been the subject of   high-profile crashes in recent years. In March a Tesla Model 3   owner died when the vehicle crashed into a semi-truck. It's   similar to an accident in 2016 when a Tesla owner crashed into a   truck while in autopilot. Earlier Wednesday The National   Transportation Safety Board   blamed driver errors    as well as the autopilot design of the Model S for a crash in   January of 2018. In that accident, the vehicle crashed into a   fire truck that was parked on a highway in California. There were   no casualties in that wreck.   10 stocks we like better than Tesla       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Tesla wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Donna Fuscaldo      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Berkshire Hathaway (B shares) and     Tesla. The Motley Fool has the following options: long January     2021 $200 calls on Berkshire Hathaway (B shares) and short     January 2021 $200 puts on Berkshire Hathaway (B shares). The     Motley Fool has a     disclosure policy      .  ",
    " Tesla    (NASDAQ: TSLA) may be known for churning out eye-appealing green   vehicles, but it has found a new market to go after:   insurance.",
    "Several months after Tesla Chief Executive Elon Musk hinted   the Palo Alto, California-based company plans to offer customers   automobile insurance, it appears to be following through. Last   week it announced the launch of Tesla Insurance which it said can   save Tesla owners as much as 30% in rates. The insurance provides   comprehensive coverage and claims management to Tesla owners in   California. The company intends to expand its insurance to   additional states down the road. Tesla claims it can offer deeply   discounted rates because it is insuring its own vehicles.",
    "\"Tesla uniquely understands its vehicles, technology, safety,   and repair costs, and eliminates fees taken by traditional   insurance carriers,\" it wrote in   a blog post    . \"By pricing policies to reflect Tesla's active safety and   advanced driver assistance features, which come standard on all   new Tesla vehicles, Tesla Insurance is able   to offer reduced insurance costs for many eligible owners.\" Tesla   Insurance is currently available to all Model S, Model X, Model 3   and Roadster vehicles.",
    "Tesla's entrance into the insurance market isn't only about   finding a new revenue stream. It's designed to solve a problem   that has long plagued the vehicle maker: Tesla cars are more   expensive than other types of vehicles to insure. According to   ValuePengiun    , the average cost of car insurance for a Tesla vehicle is   $2,450. That could increase depending on the model, trim,   location and driver's history operating a vehicle. Meanwhile last   year   USA Today named    the Tesla Model S four-door electric vehicle as the most   expensive vehicle to insure.",
    "Market watchers and customers contend these vehicles require   pricier insurance because of the costs to repair them in the   event of a collision. They point to the aluminum body of the   vehicle, the lack of expertise on the part of Tesla mechanics and   auto body repair specialists and replacement part expenses for   the higher-than-average repair costs. If Tesla is able to reduce   insurance premiums, it could alleviate any complaints when the   vehicles need repairs.",
    "  GETTY IMAGES ",
    "GETTY IMAGES",
    "News that Tesla is getting into the insurance business didn't   sit well with everyone, although Tesla vehicle owners will likely   rejoice if they can save money. Famed investor and head of   Berkshire Hathaway Warren Buffett warned Tesla will likely   struggle with its newfound business since car insurance isn't an   easy market to enter. \"The success of the auto companies getting   into the insurance business is probably as likely as the success   of the insurance companies getting into the auto business,\"   CNBC    quoted him as saying at the annual   Berkshire Hathaway    (NYSE: BRK.B) annual meeting. Buffett should know. Roughly   one-third of Berkshire Hathaway is in the insurance market   including its ownership of   GEICO    .",
    "Critics say selling auto insurance serves as a distraction to   a company that has long struggled with manufacturing snafus and   missed deadlines. Last month Tesla lost its director of   manufacturing quality J. Eric Purcell, who had been at the   company for about seven years. He was just the latest in a list   of executive departures at the company.",
    "It doesn't help that Tesla vehicles have been the subject of   high-profile crashes in recent years. In March a Tesla Model 3   owner died when the vehicle crashed into a semi-truck. It's   similar to an accident in 2016 when a Tesla owner crashed into a   truck while in autopilot. Earlier Wednesday The National   Transportation Safety Board   blamed driver errors    as well as the autopilot design of the Model S for a crash in   January of 2018. In that accident, the vehicle crashed into a   fire truck that was parked on a highway in California. There were   no casualties in that wreck.",
    "  10 stocks we like better than Tesla       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Tesla wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than Tesla       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and Tesla wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Donna Fuscaldo      has no position in any of the stocks mentioned. The Motley Fool     owns shares of and recommends Berkshire Hathaway (B shares) and     Tesla. The Motley Fool has the following options: long January     2021 $200 calls on Berkshire Hathaway (B shares) and short     January 2021 $200 puts on Berkshire Hathaway (B shares). The     Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 05:35:00"
}