{
  "url": "https://www.nasdaq.com/article/5-financial-mistakes-you-shouldnt-be-making-in-your-30s-cm1206890",
  "title": "5 Financial Mistakes You Shouldn't Be Making in Your 30s - Nasdaq.com",
  "text": [
    "Don't let this critical decade go by without correcting these huge financial errors.",
    "Your 30s are arguably the most pivotal decade of your financial life. You're a little older and wiser, and you're (hopefully) earning more money than you were in your 20s. But you still have a lot of years ahead of you and your decisions have far-reaching consequences.",
    "This is great news if you have solid financial goals and a good grasp of how to manage your money responsibly. But if you're guilty of any of the following five money mistakes, now's the time to start making some changes before it's too late.",
    "Image source: Getty Images",
    "Debt isn't all bad, but credit card debt definitely is. You get no benefit from it and it becomes expensive very quickly. Some credit cards have APRs over 30%!",
    "If you're only making the minimum payment each month, it can take years to pay off your balance . Credit card debt can also inhibit your ability to save for long-term goals like retirement or a new home.",
    "Paying off credit card debt isn't easy, but it can be done. Here are a few ways to make sure you have the money to pay off your cards:",
    "You'll also want to be smart about making payments.",
    "Pay at least the minimum balance on all of your cards, but throw your extra cash into the card with the highest APR first. When that's paid off, move on to the card with the next-highest APR. Continue from there.",
    "You could also transfer your balance to a card with a 0% introductory APR or take out a personal loan if you want predictable monthly payments.",
    "The average American buys their first home around age 32, according to the National Association of Realtors. In today's material world, the temptation to keep up with the Joneses and buy a luxurious house is hard to ignore. But this can hurt your finances in more ways than one:",
    "If the bulk of your paycheck is going to a mortgage payment, that's less money you can put toward other things. Things like saving for retirement or your kid's college fund. Or taking that trip around the world you've always wanted to go on.",
    "There are many rules of thumb for how much you can afford to spend on a home. Some say 2-2.5 times your annual salary. Others say 30% of your monthly gross income or less.",
    "Ultimately, you have to decide what you can afford. But don't max out your budget just because you can. Look at cheaper houses first to see if you can find something you like at a cost you can comfortably afford.",
    "The Great Recession left many people wary of investing because of the risk of losing money. But many people don't realize that you're virtually guaranteed to lose money if you don't invest.",
    "Inflation slowly erodes the value of the money you have stashed in your savings account . Investing in stocks, bonds, and other assets is one of the best ways to ensure that your money grows over time.",
    "While you should diversify your assets between stocks and bonds at every age, don't invest too conservatively in your 30s. You still have plenty of time before you need to draw upon your savings in retirement. If your assets lose value in the short term, you still have time to make it back.",
    "Enlist the help of a financial advisor if you're unsure how to invest properly. Go with a fee-only advisor instead of an advisor who earns commissions when you make certain investments. And use an online broker that doesn't charge high fees to get the best return on your money.",
    "Once you get married and begin having children, invest in a life insurance policy to protect your family in case you die unexpectedly. No one wants to think about these things happening, but you have to. The alternative is leaving your family to scrape by without enough money to pay the bills if the worst comes to pass.",
    "Compare rates from a few different companies to see which offers the best rates. You can take out a single policy for the primary breadwinner or a policy for both partners. A term life policy is best for most people and typically covers 5-30 years, so you can choose the amount of protection you need.",
    "Do you need that expensive baby gear? Do you put your child's college fund ahead of your retirement savings? Overspending on your children can come back to hurt you -- and them -- in the long run.",
    "Spending too much on your children now can leave you with less money to save for your future. If you run out of money later in life, your children will bear the burden of supporting you. This could easily cost them tens -- if not hundreds -- of thousands of dollars. That hurts their ability to save for their future.",
    "It's great if you can provide for your child's college and your own future at the same time, but place your own financial security first.",
    "Avoiding these five financial mistakes in your 30s can help make your 40s, 50s, and beyond much easier. If you're guilty of any of these bad habits, take steps to correct them today.",
    "This may be the perfect cash back card ! That's because it packs in $1,148 of value. Cardholders can earn up to 5% cash back, double rewards in the first year, and avoid interest well into 2020. With such a deep bench of perks you'll wonder how this card packs in a $0 annual fee. Best yet, you can apply and get a decision in two minutes. Learn more with our in-depth review.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:00:00"
}