{
  "url": "https://www.nasdaq.com/article/swedish-crown-up-on-hawkish-cbank-yen-drops-as-risk-appetite-rebounds-20190905-00318",
  "title": "Swedish crown up on hawkish cbank; yen drops as risk appetite rebounds - Nasdaq.com",
  "text": [
    "By Olga Cotaga",
    "LONDON, Sept 5 (Reuters) - The Swedish crown rose strongly on Thursday after the country's central bank said it still expected to tighten monetary policy around the turn of the year, surprising markets and sparking big gains in the long-suffering currency.",
    "After holding its benchmark interest rate unchanged at -0.25% as expected, the Riksbank pointed to high resource utilisation and inflation close to target as indications that the economy would remain strong in the short term, supporting plans to hike later this year or early 2020. ",
    "The Swedish crown jumped to a two-week high of 10.6575 against the euro , and also rallied 0.8% against the dollar . The crown has risen in the past few days, having shed more than 4.5% of its value versus the euro this year. ",
    "Elsewhere, the Japanese yen slipped and risky currencies flourished on Thursday as investors turned more optimistic that the United States will find common ground with China on trade after agreeing to hold talks in October. ",
    "This has pushed down the yen to a three-week low of 106.75 against the dollar . The yen was last down 0.1% at 106.555, though overall the Japanese yen had been rising this year.",
    "The Australian dollar, a currency particularly sensitive to global trade tensions, rose to a one-month high of 0.68255 against the U.S. dollar  and was last up 0.3% at $0.6815. The New Zealand dollar rose to a nine-day high of $0.6385 .",
    "The Chinese yuan rose to a two-week high of 7.1213 against the dollar in the offshore market , but was last unchanged at 7.1486 yuan per dollar. ",
    "The U.S.-China agreement to hold talks in October should not be seen as an incremental step towards resolving trade tensions, said Stephen Gallo, European head of forex strategy at BMO Capital Markets. ",
    "\"It's toing and froing, that's all,\" Gallo said, as he thinks that agreeing to hold talks is a manoeuvre from both sides to calm investor nerves.",
    "The dollar, seen by many as immune to Sino-U.S. trade spats, was slightly higher against both the euro and five other major currencies . Euro/dollar was last at $1.1052 , up 0.2%. ",
    "Gallo said he would not add more euro/dollar positions and that he would be looking to sell the euro if it reached $1.11 or $1.1150.",
    "The pound also gained ground, boosted by hopes that a no-deal Brexit would be avoided. Sterling was last trading up 0.2% at $1.2274 . Against the euro, the pound increased 0.1% to 89.94 pence .  ",
    "\"An amazing day when sterling is the best performer and the Japanese yen is the worst,\" said Marshal Gittler, a strategist at ACLS Global.",
    "British lawmakers approved legislation on Wednesday to extend the Brexit deadline for the third time and rejected Prime Minister Boris Johnson's motion to hold a snap election. "
  ],
  "published_datetime": "2019-09-05 06:47:00"
}