{
  "url": "https://www.nasdaq.com/article/stock-market-news-starbucks-loses-its-buzz-jetblue-hits-turbulence-cm1207444",
  "title": "Stock Market News: Starbucks Loses Its Buzz; JetBlue Hits Turbulence - Nasdaq.com",
  "text": [
    " The stock market gained ground on Wednesday morning, as market   participants reacted positively to news that geopolitical   tensions in Hong Kong might be waning. The Chinese special   administration region's leadership backed away from plans to   allow for extradition of Hong Kong residents to China for trial.   Investors liked the concession to protestors, and as of 11:15   a.m. EDT, the   Dow Jones Industrial Average    (DJINDICES: ^DJI) was up 173 points to 26,291. The   S&P 500    (SNPINDEX: ^GSPC) rose 21 points to 2,927, and the   Nasdaq Composite    (NASDAQINDEX: ^IXIC) picked up 70 points to 7,944. However, some stocks didn't participate in the rally. Coffee   king   Starbucks    (NASDAQ: SBUX) warned that its future might not be as bright as   it had initially anticipated, while airline company   JetBlue Airways    (NASDAQ: JBLU) sank after revealing its latest financial   results. A weak brew for    Starbucks   earnings  Starbucks saw its shares drop 2% after the coffee-store chain   warned that its earnings growth in 2020 might not be as robust as   it had initially thought. The company said at an   investor-conference presentation that it's unlikely to see 10%   growth on its bottom line in 2020.makeArticleAd();   Image source: Starbucks.  The reason for the shortfall has to do with Starbucks' efforts   to return capital to shareholders. Company executives said that a   significant portion of the stock buybacks that it had initially   anticipated making in fiscal 2020 got pulled forward into the   current fiscal year. Although share repurchases don't affect net income, they do   provide a boost to per-share earnings figures. The impact of the   move could be to inflate 2019 earnings growth at the expense of   2020's numbers. Even with the drop, though, investors can't complain too much.   Starbucks stock    is still up more than 50% since early January. JetBlue loses altitude Meanwhile, JetBlue's stock fell 4% following the airline's   move to cut its guidance for the third quarter of 2019. The   company said in a filing with the U.S. Securities and Exchange   Commission that it expects revenue per available seat mile to   come in flat to down 2%, compared to the year-ago quarter, which   is significantly weaker than the 0.5% to 3.5% growth that it had   expected previously. JetBlue cited several factors in its guidance cut. First,   weakness in bookings to Puerto Rico cost the company about 1.25   percentage points of growth in the key metric. Generally weaker   demand led to another percentage point of headwinds, and early   estimates of the impact on demand from Hurricane Dorian resulted   in an additional 0.75 percentage-point reduction. Amid tough conditions, JetBlue has looked at initiatives to   try to boost growth. After exiting the cargo-shipping business   several years ago, the airline is now taking a closer look at   establishing cargo carriage    on certain routes. Thanks to a newly updated fleet, JetBlue has   extra shipping capacity    it can use for cargo. Yet airline investors often focus on passenger business   metrics, and falling unit revenue figures aren't a good sign for   JetBlue. The company will need to keep trying harder to attract   passengers in order to keep moving in the right direction over   the long run.   10 stocks we like better than JetBlue Airways       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and JetBlue Airways wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Dan Caplinger      owns shares of Starbucks. The Motley Fool owns shares of and     recommends Starbucks. The Motley Fool recommends JetBlue     Airways. The Motley Fool has a     disclosure policy      .  ",
    "The stock market gained ground on Wednesday morning, as market   participants reacted positively to news that geopolitical   tensions in Hong Kong might be waning. The Chinese special   administration region's leadership backed away from plans to   allow for extradition of Hong Kong residents to China for trial.   Investors liked the concession to protestors, and as of 11:15   a.m. EDT, the   Dow Jones Industrial Average    (DJINDICES: ^DJI) was up 173 points to 26,291. The   S&P 500    (SNPINDEX: ^GSPC) rose 21 points to 2,927, and the   Nasdaq Composite    (NASDAQINDEX: ^IXIC) picked up 70 points to 7,944.",
    "However, some stocks didn't participate in the rally. Coffee   king   Starbucks    (NASDAQ: SBUX) warned that its future might not be as bright as   it had initially anticipated, while airline company   JetBlue Airways    (NASDAQ: JBLU) sank after revealing its latest financial   results.",
    "Starbucks saw its shares drop 2% after the coffee-store chain   warned that its earnings growth in 2020 might not be as robust as   it had initially thought. The company said at an   investor-conference presentation that it's unlikely to see 10%   growth on its bottom line in 2020.",
    "  Image source: Starbucks. ",
    "Image source: Starbucks.",
    "The reason for the shortfall has to do with Starbucks' efforts   to return capital to shareholders. Company executives said that a   significant portion of the stock buybacks that it had initially   anticipated making in fiscal 2020 got pulled forward into the   current fiscal year.",
    "Although share repurchases don't affect net income, they do   provide a boost to per-share earnings figures. The impact of the   move could be to inflate 2019 earnings growth at the expense of   2020's numbers.",
    "Even with the drop, though, investors can't complain too much.   Starbucks stock    is still up more than 50% since early January.",
    "Meanwhile, JetBlue's stock fell 4% following the airline's   move to cut its guidance for the third quarter of 2019. The   company said in a filing with the U.S. Securities and Exchange   Commission that it expects revenue per available seat mile to   come in flat to down 2%, compared to the year-ago quarter, which   is significantly weaker than the 0.5% to 3.5% growth that it had   expected previously.",
    "JetBlue cited several factors in its guidance cut. First,   weakness in bookings to Puerto Rico cost the company about 1.25   percentage points of growth in the key metric. Generally weaker   demand led to another percentage point of headwinds, and early   estimates of the impact on demand from Hurricane Dorian resulted   in an additional 0.75 percentage-point reduction.",
    "Amid tough conditions, JetBlue has looked at initiatives to   try to boost growth. After exiting the cargo-shipping business   several years ago, the airline is now taking a closer look at   establishing cargo carriage    on certain routes. Thanks to a newly updated fleet, JetBlue has   extra shipping capacity    it can use for cargo.",
    "Yet airline investors often focus on passenger business   metrics, and falling unit revenue figures aren't a good sign for   JetBlue. The company will need to keep trying harder to attract   passengers in order to keep moving in the right direction over   the long run.",
    "  10 stocks we like better than JetBlue Airways       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and JetBlue Airways wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than JetBlue Airways       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and JetBlue Airways wasn't     one of them! That's right -- they think these 10 stocks are     even better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Dan Caplinger      owns shares of Starbucks. The Motley Fool owns shares of and     recommends Starbucks. The Motley Fool recommends JetBlue     Airways. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:34:00"
}