{
  "url": "https://www.nasdaq.com/article/is-vanguard-dividend-growth-fund-vdigx-a-strong-mutual-fund-pick-right-now-cm1207719",
  "title": "Is Vanguard Dividend Growth Fund (VDIGX) a Strong Mutual Fund Pick Right Now? - Nasdaq.com",
  "text": [
    "Large Cap Blend fund seekers should consider taking a look at Vanguard Dividend Growth Fund (VDIGX). VDIGX holds a Zacks Mutual Fund Rank of 1 (Strong Buy), which is based on nine forecasting factors like size, cost, and past performance.",
    "Objective",
    "VDIGX is part of the Large Cap Blend section, an area that boasts an array of many possible options. Large Cap Blend mutual funds most often invest in firms with a market capitalization of $10 billion or more. By investing in bigger companies, these funds offer more stability, and are often well-suited for investors with a \" buy and hold \" mindset. Blended funds mix large, established companies into their holdings, which gives investors exposure to both value and growth at the same time.",
    "History of Fund/Manager",
    "Vanguard Group is based in Malvern, PA, and is the manager of VDIGX. The Vanguard Dividend Growth Fund made its debut in May of 1992 and VDIGX has managed to accumulate roughly $37.16 billion in assets, as of the most recently available information. The fund's current manager, Donald J. Kilbride, has been in charge of the fund since February of 2006.",
    "Performance",
    "Obviously, what investors are looking for in these funds is strong performance relative to their peers. This fund carries a 5-year annualized total return of 11.99%, and it sits in the top third among its category peers. Investors who prefer analyzing shorter time frames should look at its 3-year annualized total return of 13.61%, which places it in the top third during this time-frame.",
    "When looking at a fund's performance, it is also important to note the standard deviation of the returns. The lower the standard deviation, the less volatility the fund experiences. The standard deviation of VDIGX over the past three years is 10.61% compared to the category average of 12.09%. Looking at the past 5 years, the fund's standard deviation is 10.45% compared to the category average of 12.11%. This makes the fund less volatile than its peers over the past half-decade.",
    "Risk Factors",
    "It's always important to be aware of the downsides to any future investment, so one should not discount the risks that come with this segment. In VDIGX's case, the fund lost 37.94% in the most recent bear market and outperformed its peer group by 11%. This might suggest that the fund is a better choice than its peers during a bear market.",
    "Investors should note that the fund has a 5-year beta of 0.83, so it is likely going to be less volatile than the market at large. Another factor to consider is alpha, as it reflects a portfolio's performance on a risk-adjusted basis relative to a benchmark-in this case, the S&P 500. Over the past 5 years, the fund has a positive alpha of 2.26. This means that managers in this portfolio are skilled in picking securities that generate better-than-benchmark returns.",
    "Expenses",
    "As competition heats up in the mutual fund market, costs become increasingly important. Compared to its otherwise identical counterpart, a low-cost product will be an outperformer, all other things being equal. Thus, taking a closer look at cost-related metrics is vital for investors. In terms of fees, VDIGX is a no load fund. It has an expense ratio of 0.22% compared to the category average of 0.96%. VDIGX is actually cheaper than its peers when you consider factors like cost.",
    "This fund requires a minimum initial investment of $3,000, and each subsequent investment should be at least $1.",
    "Bottom Line",
    "Overall, Vanguard Dividend Growth Fund ( VDIGX ) has a high Zacks Mutual Fund rank, and in conjunction with its comparatively strong performance, average downside risk, and lower fees, this fund looks like a good potential choice for investors right now.",
    "Want even more information about VDIGX? Then go over to Zacks.com and check out our mutual fund comparison tool, and all of the other great features that we have to help you with your mutual fund analysis for additional information. If you are more of a stock investor, make sure to also check out our Zacks Rank, and our full suite of tools we have available for novice and professional investors alike.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 07:00:06"
}