{
  "url": "https://www.nasdaq.com/article/is-lyondellbasell-industries-lyb-a-good-value-investor-pick-cm1206727",
  "title": "Is LyondellBasell Industries (LYB) a Good Value Investor Pick? - Nasdaq.com",
  "text": [
    " Value investing is easily one of the most popular ways to find great stocks in any market environment. After all, who wouldn't want to find stocks that are either flying under the radar and are compelling buys, or offer up tantalizing discounts when compared to fair value?  makeArticleAd();  One way to find these companies is by looking at several key metrics and financial ratios, many of which are crucial in the value stock selection process. Let's put LyondellBasell Industries N.V. LYB  stock into this equation and find out if it is a good choice for value-oriented investors right now, or if investors subscribing to this methodology should look elsewhere for top picks:   PE Ratio    A key metric that value investors always look at is the Price to Earnings Ratio, or PE for short. This shows us how much investors are willing to pay for each dollar o f earnings  in a given stock, and is easily one of the most popular financial ratios in the world. The best use of the PE ratio is to compare the stock's current PE ratio with: a) where this ratio has been in the past; b) how it compares to the average for the industry/sector; and c) how it compares to the market as a whole.    On this front, LyondellBasell Industries has a trailing twelve months PE ratio of 7.93, as you can see in the chart below:      This level actually compares favorably with the market at large, as the PE for the S&P 500 stands at about 18.02. If we focus on the long-term PE trend, LyondellBasell Industries' current PE level puts it below its midpoint of 8.98 over the past five years, with the number having risen rapidly over the past few months. However, the current level stands below the highs for the stock, suggesting that it can be a solid entry point.      Moreover, the stock's PE also compares favorably with the Zacks Basic Materials Market sector's trailing twelve months PE ratio, which stands at 13.98. At the very least, this indicates that the stock is relatively undervalued right now, compared to its peers.      We should also point out that LyondellBasell Industries has a forward PE ratio (price relative to this year's earnings) of 7.53, so it is fair to say that a slightly more value-oriented path may be ahead for LyondellBasell Industries' stock in the near term too.   P/S Ratio    Another key metric to note is the Price/Sales ratio. This approach compares a given stock's price to its total sales, where a lower reading is generally considered better. Some people like this metric more than other value-focused ones because it looks at sales, something that is far harder to manipulate with accounting tricks than earnings.    Right now, LyondellBasell Industries has a P/S ratio of about 0.78. This is much lower than the S&P 500 average, which comes in at 3.17 right now. Also, as we can see in the chart below, this is well below the highs for this stock in particular over the past few years.     Broad Value Outlook    In aggregate, LyondellBasell Industries currently has a Value Score of A, putting it into the top 20% of all stocks we cover from this look. This makes LyondellBasell Industries a solid choice for value investors.    For example, the PEG ratio for LyondellBasell Industries is just 0.84, a level that is lower than the industry average of 1.04. The PEG ratio is a modified PE ratio that takes into account the stock's earnings growth rate. Additionally, its P/CF ratio (another great indicator of value) comes in at 5.24, which is better than the industry average of 6.31. Clearly, LYB is a solid choice on the value front from multiple angles.   What About the Stock Overall?    Though LyondellBasell Industries might be a good choice for value investors, there are plenty of other factors to consider before investing in this name. In particular, it is worth noting that the company has a Growth Score of B and Momentum Score of D. This gives LYB a Zacks VGM score - or its overarching fundamental grade - of A. (You can read more about the Zacks Style Scores here >>  )    Meanwhile, the company's recen t earnings  estimates have been mixed at the best. The current year estimate witnessed one upward revision in the past sixty days compared to four downward revisions, while the full year 2020 estimate witnessed four upward revisions compared to two downward revisions in the same time period.    As a result, the current year consensus estimate declined 1.82% in the past two months, whereas the full year 2020 estimate increased 1.67%. You can see the consensus estimate trend and recent price action for the stock in the chart below:  LyondellBasell Industries N.V. Price and   Consensus         LyondellBasell Industries N.V.   price-consensus-chart    |   LyondellBasell Industries N.V. Quote   Owing to the bearish estimate trends, the stock carries a Zacks Rank #3 (Hold), which is why we are looking for in-line performance from the company in the near term.  Bottom Line    LyondellBasell Industries is an inspired choice for value investors, as it is hard to beat its incredible lineup of statistics on this front. However, with a sluggish industry rank (bottom 13% out of more than 250 industries) and a Zacks Rank #3, it is hard to get too excited about this company overall. In fact, over the past two years, the broader industry has underperformed the market at large, as you can see below:      So, value investors might want to wait for estimates and analyst sentiment to turn around in this name first, but once that happens, this stock could be a compelling pick.   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   LyondellBasell Industries N.V. (LYB): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Value investing is easily one of the most popular ways to find great stocks in any market environment. After all, who wouldn't want to find stocks that are either flying under the radar and are compelling buys, or offer up tantalizing discounts when compared to fair value?  makeArticleAd();  One way to find these companies is by looking at several key metrics and financial ratios, many of which are crucial in the value stock selection process. Let's put LyondellBasell Industries N.V. LYB  stock into this equation and find out if it is a good choice for value-oriented investors right now, or if investors subscribing to this methodology should look elsewhere for top picks:   PE Ratio    A key metric that value investors always look at is the Price to Earnings Ratio, or PE for short. This shows us how much investors are willing to pay for each dollar o f earnings  in a given stock, and is easily one of the most popular financial ratios in the world. The best use of the PE ratio is to compare the stock's current PE ratio with: a) where this ratio has been in the past; b) how it compares to the average for the industry/sector; and c) how it compares to the market as a whole.    On this front, LyondellBasell Industries has a trailing twelve months PE ratio of 7.93, as you can see in the chart below:",
    "     This level actually compares favorably with the market at large, as the PE for the S&P 500 stands at about 18.02. If we focus on the long-term PE trend, LyondellBasell Industries' current PE level puts it below its midpoint of 8.98 over the past five years, with the number having risen rapidly over the past few months. However, the current level stands below the highs for the stock, suggesting that it can be a solid entry point.",
    "     Moreover, the stock's PE also compares favorably with the Zacks Basic Materials Market sector's trailing twelve months PE ratio, which stands at 13.98. At the very least, this indicates that the stock is relatively undervalued right now, compared to its peers.",
    "     We should also point out that LyondellBasell Industries has a forward PE ratio (price relative to this year's earnings) of 7.53, so it is fair to say that a slightly more value-oriented path may be ahead for LyondellBasell Industries' stock in the near term too.   P/S Ratio    Another key metric to note is the Price/Sales ratio. This approach compares a given stock's price to its total sales, where a lower reading is generally considered better. Some people like this metric more than other value-focused ones because it looks at sales, something that is far harder to manipulate with accounting tricks than earnings.    Right now, LyondellBasell Industries has a P/S ratio of about 0.78. This is much lower than the S&P 500 average, which comes in at 3.17 right now. Also, as we can see in the chart below, this is well below the highs for this stock in particular over the past few years.",
    "    Broad Value Outlook    In aggregate, LyondellBasell Industries currently has a Value Score of A, putting it into the top 20% of all stocks we cover from this look. This makes LyondellBasell Industries a solid choice for value investors.    For example, the PEG ratio for LyondellBasell Industries is just 0.84, a level that is lower than the industry average of 1.04. The PEG ratio is a modified PE ratio that takes into account the stock's earnings growth rate. Additionally, its P/CF ratio (another great indicator of value) comes in at 5.24, which is better than the industry average of 6.31. Clearly, LYB is a solid choice on the value front from multiple angles.   What About the Stock Overall?    Though LyondellBasell Industries might be a good choice for value investors, there are plenty of other factors to consider before investing in this name. In particular, it is worth noting that the company has a Growth Score of B and Momentum Score of D. This gives LYB a Zacks VGM score - or its overarching fundamental grade - of A. (You can read more about the Zacks Style Scores here >>  )    Meanwhile, the company's recen t earnings  estimates have been mixed at the best. The current year estimate witnessed one upward revision in the past sixty days compared to four downward revisions, while the full year 2020 estimate witnessed four upward revisions compared to two downward revisions in the same time period.    As a result, the current year consensus estimate declined 1.82% in the past two months, whereas the full year 2020 estimate increased 1.67%. You can see the consensus estimate trend and recent price action for the stock in the chart below:",
    " LyondellBasell Industries N.V. Price and   Consensus ",
    "       LyondellBasell Industries N.V.   price-consensus-chart    |   LyondellBasell Industries N.V. Quote  ",
    " LyondellBasell Industries N.V.   price-consensus-chart    |   LyondellBasell Industries N.V. Quote ",
    "Owing to the bearish estimate trends, the stock carries a Zacks Rank #3 (Hold), which is why we are looking for in-line performance from the company in the near term.",
    " Bottom Line    LyondellBasell Industries is an inspired choice for value investors, as it is hard to beat its incredible lineup of statistics on this front. However, with a sluggish industry rank (bottom 13% out of more than 250 industries) and a Zacks Rank #3, it is hard to get too excited about this company overall. In fact, over the past two years, the broader industry has underperformed the market at large, as you can see below:",
    "     So, value investors might want to wait for estimates and analyst sentiment to turn around in this name first, but once that happens, this stock could be a compelling pick.   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:35:00"
}