{
  "url": "https://www.nasdaq.com/article/american-express-up-24-year-to-date-will-momentum-sustain-cm1208137",
  "title": "American Express Up 24% Year to Date: Will Momentum Sustain? - Nasdaq.com",
  "text": [
    "American Express Co.AXP has been in favor with investors who acknowledge its strong operating performance and focus on its four strategic imperatives - expansion of leadership in the premium consumer space, build upon its strong position in commercial payments, strengthen its global, integrated network and make itself an essential part of its customers' digital lives.\r\n The company is successfully adding new proprietary cards led by its digital acquisition efforts. Its continuous expansion of merchant networks in the United States and international markets, and solid billings across customer segments and geographies bode well for its business volume growth going forwards.   \r\n Year to date, the stock has gained 24% compared with the industry 's growth of 18%. Other players in the same space such as Visa, Inc. V , Mastercard, Inc. MA and Discover Financial Services DFS have grown by 38%, 52%, 35%, respectively.",
    "We expect the American Express stock to gain further given its strong business fundamentals. The company is seeing steady increase in customer engagement and acquisitions from its Member Get Member referral program as well as through its innovative lending offerings such as Pay It Plan It for consumers and working capital loans for its SME customers. It is generating strong billings across international market especially in its consumer and SME segments, which is driving increased merchant coverage.\r\n American Express distinguishes itself from peers in the card industry by virtue of its services provided to its members such as exclusive airport lounges and concierge services. Recently, the company announced to buy Resy, the digital restaurant reservation booking and management platform. With this deal, it aims to provide its customers with its growing suite of digital-first benefits and services. This includes providing card members with access and experiences across travel and lodging, airport lounges, exclusive events and dining.\r\n American Express' has been making efforts to expand in the lucrative hospitality and dining industry. In this vein, the company has recently made a number of acquisitions, which include personal travel assistant app Mezi, UK dining reservation platform Cake Technologies, airport lounge discovery and booking platform LoungeBuddy, and Japanese premium restaurant reservation platform Pocket Concierge.\r\n Recently, the company renewed its co-brand partnership with Delta Airlines through 2030. Delta's large base of business customers provides many attractive opportunities to build on American Express' strong position in commercial payments.\r\n Since then, American Express has undertaken a number of initiatives such as forging co-brand partnerships, making investments in technology, and increasing marketing and advertising to make itself more appealing to customers. The company has also refurbished rewards and facilities on its cards and upgraded credit cards from time to time.\r\n American Express has a long-term growth path given its brand name, superior client base, expanding suite of services and growing co-brand partnerships, which  has helped the company retain customers.\r\n American Express currently carries a Zacks Rank #3 (Hold). You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here .",
    "It's Illegal in 42 States, But Investors Will Make Billions Legally\r\n In addition to the companies you read about above, today you get details on the newly-legalized industry that's tapping into a \"habit\" that Americans spend an estimated $150 billion on every year.",
    " That's twice as much as they spend on marijuana, legally or otherwise.\r\n Zacks special report revealing how investors can profit from this new opportunity. As more states legalize this activity, the industry could expand by as much as 15X. Zacks' has just released a Special",
    "Report revealing 5 top stocks to watch in this space.See these 5 \"sin stocks\" now>>",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-05 10:44:00"
}