{
  "url": "https://www.nasdaq.com/article/turkish-central-bank-seen-cutting-rates-another-250-points-20190912-00028",
  "title": "Turkish central bank seen cutting rates another 250 points - Nasdaq.com",
  "text": [
    "By Behiye Selin Taner",
    "ISTANBUL, Sept 10 (Reuters) - Turkey's central bank is expected to cut its policy rate by 250 basis points to 17.25% this week, and to lower it to 16% by year end as it continues an easing cycle meant to help lift the economy from recession, a Reuters poll showed on Tuesday.",
    "The central bank in July slashed the rate to 19.75% from 24% in its first policy change since September 2018. Last year, a currency crisis chopped 30% from the value of the lira and sent inflation soaring to a 15-year high above 25%. ",
    "The policy decision is set for 1100 GMT on Thursday. ",
    "A drop this year in inflation cleared the way for easing, and such expectations only grew after Murat Uysal was appointed central bank governor and said there was room to manoeuvre on policy given the improving trend in prices.",
    "Turkish President Tayyip Erdogan, a self-described \"enemy\" of high interest rates, had sacked former central bank governor Murat Cetinkaya in early July, saying he did not follow instructions on monetary policy.",
    "The government has attempted to boost lending by state banks to liven up an economy that entered a recession last year.",
    "The central bank has reconciled itself to aggressive monetary easing in facilitating Ankara's pursuit of a credit-fuelled economic recovery, said Phoenix Kalen, emerging market analyst at Societe Generale.",
    "\"If the (bank) delivers the substantial 200-275bps rate cut that the market expects, and assuming that the external environment is not too noisy, Turkish financial markets may be stable to slightly weaker,\" she said in a note.",
    "\"More importantly, very loose monetary policy would render Turkish assets much more vulnerable to portfolio outflows, at a time when net capital flows and portfolio flows into Turkey have already sharply plummeted.\"",
    "Inflation eased slightly more than expected to 15.01% in August, data showed last week, resuming a downward trend. ",
    "The bank is expected to cut a further 125 basis points to 16% by the end of the year, the median estimate of 16 economists showed, with forecasts ranging between 17% and 12%.",
    "Erdogan said over the weekend he expected to see single-digit interest rates in a short time and repeated his unorthodox view that inflation will come down as interest rates are lowered.",
    "Piotr Matys, emerging markets strategist at Rabobank, predicted a 300-point cut this week and said it is too early to justify whether the slowdown in inflation will be sustainable.",
    "\"Admittedly, the market responded well to the 425bps cut in July and encouraged by that the central bank may deliver another bold move on Sept. 12,\" he said in a note.",
    "\"It would be incorrect, however, to assume that most investors would accept interest rates in single digits unless Turkey's structural problems are properly addressed.\""
  ],
  "published_datetime": "2019-09-12 01:18:00"
}