{
  "url": "https://www.nasdaq.com/article/heres-how-to-buy-hexo-stock-now-cm1206940",
  "title": "Here’s How to Buy Hexo Stock Now - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "It's been a tough summer for Hexo (NYSE: HEXO ) shareholders. But for investors seeking exposure to the cannabis market, the price is nearly right for a less speculative investment.",
    "I've said it before and it bears repeating, Hexo, along with competitors Aurora Cannabis (NYSE: ACB ), Canopy Growth (NYSE: CGC ) or a New Age Beverages (NASDAQ: NBEV ) face very real challenges despite the potential opportunity within the cannabis industry. Universally, the group is mired in losses as companies spend aggressively to gain market share. All the while, the opening up of new markets due to regulatory red tape remains much easier said than done.",
    "It's a tough combination that's resulted in supply dwarfing demand and a business environment which will undoubtedly see casualties. In large part these difficult realities are why cannabis stocks have cratered and why Hexo stock has lost more than 50% over the past four months. But turning your back on HEXO could be a big mistake.",
    "The fact remains that Hexo is well-positioned for success within the niche edibles and cannabis-infused beverages market. With a partner in beverage giant Molson Coors (NYSE: TAP ), Hexo maintains resources ranging from financial support to Molson's marketing, distribution and operational expertise.",
    "Hexo stock's partnership isn't a guarantee of survival. For the reasons already stressed, it's simply too early to know if Hexo will ever be a viable business. But it would be unfair to not appreciate Molson Coors as a significant advantage as Hexo looks to build its brand in this up-and-coming, but still speculative market.",
    "Hexo's technical wherewithal relative to its peers also makes it a standout in the cannabis space. Obviously, the deep corrective move over the past few months hasn't been pleasant. However, HEXO stock is technically unique. Shares remain in an uptrend supported by it's late April higher high pattern and today's higher low relative to its December bottom.",
    "With a small double bottom having formed on the weekly chart, HEXO is nearly ready for investors to buy. With this second pivot low finishing in a weekly hammer as of Friday's close, shares are in position to buy on confirmation of this reversal candlestick.",
    "My recommendation for buying Hexo stock would be to buy shares above $4.18. That's 8 cents through the high of the weekly hammer. This approach gives up a few pennies of profit in return for trying to purchase HEXO on sustainable momentum to avoid the possibility of a weaker buy signal in Hexo stock price that's doomed to fail.",
    "Similarly, and to contain risk, I'd place an initial stop at $3.63 and 8 cents beneath the pattern low. This exit looks to evade being an easy target for a bear raid hitting picture perfect stops at $3.70.",
    "In exchange for the position risk of 65 cents, I'd take partial profits in between $5.00-$5.15. The targeted area is slightly above the double bottom's July high and may draw in fresh buying interest. But with no guarantees and profits approaching 1.5x the risk, this spot reasonably makes sense off and on the price chart.",
    "Investment accounts under Christopher Tyler's management do not currently own positions in any securities mentioned in this article. The information offered is based upon Christopher Tyler's observations and strictly intended for educational purposes only; the use of which is the responsibility of the individual.For additional options-based strategies and related musings, follow Chris on Twitter @Options_CAT and StockTwits .",
    "The post Here's How to Buy Hexo Stock Now appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 12:52:51"
}