{
  "url": "https://www.nasdaq.com/article/iqiyi-stock-jumps-126-on-wednesday-cm1210674",
  "title": "iQiyi Stock Jumps 12.6% on Wednesday - Nasdaq.com",
  "text": [
    " What happened Shares of Chinese streaming-video company   iQiyi    (NASDAQ: IQ) jumped on Wednesday, rising as much as 12.6%. As of   12:10 p.m. EDT, the stock was up 10.5%. It's not entirely clear why this   tech stock    is trading higher on Wednesday, but the gain does follow a press   release on Wednesday morning that was related to the company.   Image source: Getty Images.makeArticleAd();  So what A   press release    on Wednesday said that Academy of Broadcasting Planning (ABP) and   iQiyi, in cooperation with other industry peers, have formed a   task force to develop industry \"specifications of the internet   interactive video data format\" (referred to as \"Specifications\")   for the China market. \"By defining and standardizing interactive video-related   terminologies, functions, production processes and data formats,\"   iQiyi wrote in the press release, \"the   Specifications    will help content creators produce high-quality interactive   entertainment content more conveniently and efficiently,   accelerating the process of interactive videos from experimental   to industrialized.\" Now what This press release doesn't seem like a good enough reason to   move the stock of a company as big as iQiyi this much,   particularly since it was on Sept. 6 that iQiyi and ABP jointly   held a meeting for the development of these specifications with   other industry peers. In other words, it was already known that   the two entities were aiming to develop industry standards. There are likely other factors beyond this press release   influencing the stock's gain on Wednesday. Investors should stay   focused on iQiyi's underlying business performance and the   stock's long-term prospects.   10 stocks we like better than iQiyi       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and iQiyi wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Daniel Sparks      has no position in any of the stocks mentioned. The Motley Fool     recommends iQiyi. The Motley Fool has a     disclosure policy      .  ",
    "Shares of Chinese streaming-video company   iQiyi    (NASDAQ: IQ) jumped on Wednesday, rising as much as 12.6%. As of   12:10 p.m. EDT, the stock was up 10.5%.",
    "It's not entirely clear why this   tech stock    is trading higher on Wednesday, but the gain does follow a press   release on Wednesday morning that was related to the company.",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "A   press release    on Wednesday said that Academy of Broadcasting Planning (ABP) and   iQiyi, in cooperation with other industry peers, have formed a   task force to develop industry \"specifications of the internet   interactive video data format\" (referred to as \"Specifications\")   for the China market.",
    "\"By defining and standardizing interactive video-related   terminologies, functions, production processes and data formats,\"   iQiyi wrote in the press release, \"the   Specifications    will help content creators produce high-quality interactive   entertainment content more conveniently and efficiently,   accelerating the process of interactive videos from experimental   to industrialized.\"",
    "This press release doesn't seem like a good enough reason to   move the stock of a company as big as iQiyi this much,   particularly since it was on Sept. 6 that iQiyi and ABP jointly   held a meeting for the development of these specifications with   other industry peers. In other words, it was already known that   the two entities were aiming to develop industry standards.",
    "There are likely other factors beyond this press release   influencing the stock's gain on Wednesday. Investors should stay   focused on iQiyi's underlying business performance and the   stock's long-term prospects.",
    "  10 stocks we like better than iQiyi       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and iQiyi wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than iQiyi       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and iQiyi wasn't one of them!     That's right -- they think these 10 stocks are even better     buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Daniel Sparks      has no position in any of the stocks mentioned. The Motley Fool     recommends iQiyi. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 01:10:00"
}