{
  "url": "https://www.nasdaq.com/article/forexswedish-crown-up-on-hawkish-cbank-yen-drops-as-risk-appetite-rebounds-20190905-00315",
  "title": "FOREX-Swedish crown up on hawkish cbank; yen drops as risk appetite rebounds - Nasdaq.com",
  "text": [
    "    * Chinese yuan jumps on US-China trade hopes",
    "* Australian dollar, New Zealand dollar bounce on tradeoptimism",
    "* Pound holds earlier gains, but eases off slightly",
    "* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh (Recasts, adds context, new quote, chart and updates prices)",
    "By Olga Cotaga",
    "LONDON, Sept 5 (Reuters) - The Swedish crown rose stronglyon Thursday after the country's central bank said it stillexpected to tighten monetary policy around the turn of the year,surprising markets and sparking big gains in the long-sufferingcurrency.",
    "After holding its benchmark interest rate unchanged at-0.25% as expected, the Riksbank pointed to high resourceutilisation and inflation close to target as indications thatthe economy would remain strong in the short term, supportingplans to hike later this year or early 2020. urn:newsml:reuters.com:*:nL5N25W1XD",
    "Riksbank Governor Stefan Ingves said \"it would not bestrange\" if interest rates in Sweden were \"a little higher thanin Europe.\" This contrasts with expectations of the EuropeanCentral Bank, which is forecast to cut interest rates on Sept.12 and announce a new wave of quantitative easing.",
    "The Swedish crown jumped to a two-week high of 10.6575against the euro EURSEK=D3 , and also rallied 0.8% against thedollar SEK=D3 . The crown has risen in the past few days,having shed more than 4.5% of its value versus the euro thisyear. ",
    "Elsewhere, the Japanese yen slipped and risky currenciesflourished on Thursday as investors turned more optimistic thatthe United States will find common ground with China on tradeafter agreeing to hold talks in October. urn:newsml:reuters.com:*:nB9N25400R",
    "This has pushed down the yen to a three-week low of 106.75against the dollar JPY=EBS . The yen was last down 0.1% at106.555, though overall the Japanese yen had been rising thisyear.",
    "The Australian dollar, a currency particularly sensitive toglobal trade tensions, rose to a one-month high of 0.68255against the U.S. dollar AUD=D3 and was last up 0.3% at$0.6815. The New Zealand dollar rose to a nine-day high of$0.6385 NZD=D3 .",
    "The Chinese yuan rose to a two-week high of 7.1213 againstthe dollar in the offshore market CNH=EBS , but was lastunchanged at 7.1486 yuan per dollar. ",
    "The U.S.-China agreement to hold talks in October should notbe seen as an incremental step towards resolving trade tensions,said Stephen Gallo, European head of forex strategy at BMOCapital Markets. ",
    "\"It's toing and froing, that's all,\" Gallo said, as hethinks that agreeing to hold talks is a manoeuvre from bothsides to calm investor nerves.",
    "The dollar, seen by many as immune to Sino-U.S. trade spats,was slightly higher against both the euro and five other majorcurrencies .DXY . Euro/dollar was last at $1.1052EUR=EBS , up0.2%. ",
    "Gallo said he would not add more euro/dollar positions andthat he would be looking to sell the euro if it reached $1.11 or$1.1150.",
    "The pound also gained ground, boosted by hopes that ano-deal Brexit would be avoided. Sterling was last trading up0.2% at $1.2274GBP=D3 . Against the euro, the pound increased0.1% to 89.94 penceEURGBP=D3 .  ",
    "\"An amazing day when sterling is the best performer and theJapanese yen is the worst,\" said Marshal Gittler, a strategistat ACLS Global.",
    "British lawmakers approved legislation on Wednesday toextend the Brexit deadline for the third time and rejected PrimeMinister Boris Johnson's motion to hold a snap election. urn:newsml:reuters.com:*:nL9N25Q00Jurn:newsml:reuters.com:*:nL9N24N02Z",
    "\n<^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\nSwedish crown rises on Riksbank forecasting higher rates   https://tmsnrt.rs/2PHk5y3\nJapanese yen loses ground as US-China return to negotiating\ntable   https://tmsnrt.rs/2zStsjR\n    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^> (Reporting by Olga Cotaga; Editing by Toby Chopra) ((olga.cotaga@thomsonreuters.com))"
  ],
  "published_datetime": "2019-09-05 06:47:00"
}