{
  "url": "https://www.nasdaq.com/article/knicks-and-rangers-owner-james-dolans-las-vegas-dreams-are-a-boondoggle-cm1207469",
  "title": "Knicks And Rangers Owner James Dolan's Las Vegas Dreams Are A Boondoggle - Nasdaq.com",
  "text": [
    "James, could I have a word?",
    "Sometimes I think of you as the Rodney Dangerfield of investing-investors just don't give you the respect you deserve. They've gone so far as to assign a \"Dolan discount\" to entities you control-even though long-term shareholders of both Cablevision and Madison Square Garden ( MSG ) (my firm included) have been handsomely rewarded thanks to your shareholder-friendly actions. But your latest plan to build a concert/entertainment venue, the Sphere, in Las Vegas for $1.2 to $1.7 billion (and that's just for the Las Vegas version) makes me wonder whether a \"Dolan discount\" is beginning to make sense.",
    "James, you have one of the best businesses around. Madison Square Garden is far more than just the \"World's Most Famous Arena.\" You own the building and 2.5 million square feet of air/development rights around the Garden; you own the Knicks, the Rangers, and the Los Angeles Forum; even Radio City Musical Hall and the Rockettes are part of your empire. To top it all off, MSG has almost $1.2 billion sitting in the bank. James, you control some of the world's most iconic franchises and venues-so why risk it all on a high-stakes bet in Las Vegas? You have a duty to shareholders to maximize value, but a risky venture like this makes us wonder whether you're remembering your obligations.",
    "The way I see it, you've got three choices:",
    "I don't agree with the conventional wisdom: I think you've done an admirable job of creating shareholder value. At Cablevision, you helped orchestrate the deal to buy a stake in Madison Square Garden-first from Viacom, and then the remainder of the company from your partner ITT, for a fraction of MSG's current value. In 2007, when the public markets refused to value Cablevision appropriately, you tried to take the company private but refused to complete the transaction unless the minority shareholders also approved the deal. When they did not, you began a streak of creating shareholder value that would make your father, Charles (founder of both Cablevision and HBO), proud. You levered up Cablevision's balance sheet and paid shareholders a substantial one-time special dividend, on top of a generous regular dividend. You spun off both Madison Square Garden and AMC Networks from Cablevision, then later separated MSG Networks from Madison Square Garden. To top it all off, you sold Cablevision to Altice for $17.7 billion (including debt). Bravo! Others might not be sure what to expect from James Dolan, but as a longtime fan, I know what I'm looking for-I want just one more encore.",
    "You might not be my first choice for running a professional sports team (during your tenure the Knicks have gone through 12 coaches and lost well over 800 games despite having one of the NBA's highest payrolls), but your business record leaves me in no doubt that you have a consistent record of creating value. So, for me this Sphere project is a real head-scratcher. You've made the occasional questionable deal before, like buying the Wiz for $80 million in 1998-a project you abandoned 5 years later. But the Wiz was only $80 million . Now you're talking about using billions of shareholder money to bet on an entirely new concept for a stadium in the boom-and-bust city of Las Vegas. That's a gamble that many of your shareholders cannot afford to make with you-and it's certainly not what we signed up for when we bought shares in your company.",
    "Hearing you talk about the Sphere project, I'm reminded of when your father wanted to start a satellite business called Voom. He dreamed of turning his cable company into a satellite powerhouse that could compete against the likes of DirectTV and EchoStar, but in its first full year of operation, Voom blew through $660 million with no end to spending in sight-while attracting only 46,000 subscribers. James, do you remember whose shrewd financial head made the decision to pull the plug on the founder's pet project? You remember as well as I do-it was you.",
    "James, we're counting on you to do the right thing for shareholders once more. Prove your critics wrong by abandoning the Sphere-or, if you really want to toss the dice on something as big as the Sphere, gamble with your own money.",
    "Sincerely,",
    "The Boyar Value Group Team",
    "To listen to the World According to Boyar Podcast , where we interview business leaders, best-selling authors, highly regarded investment managers, and major Hollywood producers on a variety of business related topics, please click here .",
    "Follow us on Twitter @Boyarvalue",
    "See also ONEOK, Inc. ( OKE ) Presents at Barclays CEO Energy Conference (Transcript) on seekingalpha.com",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 12:27:52"
}