{
  "url": "https://www.nasdaq.com/article/is-apple-aapl-stock-a-safe-buy-after-bond-sale-ahead-of-iphone-event-cm1207647",
  "title": "Is Apple (AAPL) Stock a Safe Buy After Bond Sale, Ahead of iPhone Event? - Nasdaq.com",
  "text": [
    " Apple AAPL  made headlines Wednesday after reports said the iPhone giant is ready to issue new bonds for the first time in two years in order to take advantage of the current global interest rate environment. Apple isn't alone in its bond play, but Wall Street and investors will also turn their sights to the company's September 10 event where it is expected to debut its latest iPhones and detail more of its services push.  iPhone & Services Event  Apple is scheduled to host an event on Tuesday, September 10 at the Steve Jobs Theater in Cupertino. Apple product rumors float around all year round and many often prove true. But we won't get bogged down in too many details. All most investors really need to know is that the company is projected to show off three new iPhones that are likely to feature somewhat standard upgrades from cameras to processors. The tech powerhouse might also show off some other new hardware. However, analyst and outlets have started to turn their attention to the services side as the company continues to focus on non-iPhone expansion. CEO Tim Cook is expected to provide far more details about Apple's upcoming streaming TV service.  Apple TV+  is set to launch this fall and feature a slate of content with A-list Hollywood stars both in front of and behind the camera. Wall Street will look to see what price Apple lays out as it tries to attract users amid a crowded streaming TV market that will soon feature itself, Netflix NFLX  , Amazon AMZN  Prime, Disney DIS  , and more. AAPL is also set to provide more details about its upcoming video game service called Apple Arcade  that will see it make a somewhat big gaming splash in order to expand its gaming reach as Microsoft MSFT  has and Google GOOGL  plans to. It seems somewhat likely that Apple will provide at least some type of bundle option for one of these services with its Spotify SPOT  competitor Apple Music. All in all, Apple's services business needs to continue to expand as iPhone growth slows.  Bond News  Apple hopes to raise as much as $7 billion via bonds that range between three and 30 years, based on multiple reports  . The company joined a slew of other giants, including Coca-Cola KO  and Deere DE  , by scooping up low yields on corporate debt. Some might wonder why Apple would borrow money when it has over $200 billion in cash? Yet the answer is relatively straightforward: the deal is too good to pass up. Yields on the 10-year U.S. Treasury notes rest at 1.46% at the moment, down from 2% in late July. Meanwhile, investors are paying to hold government debt from Germany to Japan. Therefore, the demand for debt from global titans such as Apple is high right now. And Apple, like its peers, is smart to lock in such low interest rates because as the saying goes it's cheap money  .  Time to Buy?   Apple stock  popped 1.70% Wednesday as part of a larger climb. Shares of AAPL are now up roughly 50% from around $140 on January 3 to its recent closing price of $209.19 per share. Despite the jump, Apple still sits over 10% below its 52-week highs, which could give the stock some room to run. AAPL is currently a Zacks Rank #3 (Hold) that sports an \"A\" grade for Momentum in our Style Scores system. Our current Zacks Consensus Estimates call for AAPL's current quarter (Q4 2019) earnings to slip 2.75% from the year-ago period on 0.56% lower revenue. With that said, Apple is in the midst of a hard comparison period and the company's earnings and sales look poised to jump back in 2020. Aside from its growth prospects, Apple is the only of the so-called FAANG stocks that pays a dividend. AAPL currently pays an annualized dividend of $3.08 a share, for a 1.50% yield-which tops the 10-year U.S. Treasurys. The company also returns a ton of value to shareholders through buybacks. With all this in mind, Apple appears to be one of the more solid and safe investments anywhere in the world at the moment.  Side note:  One obvious caveat to watch here is what happens on the U.S.-China trade war front. Apple Airpods, Apple Watch, and some other hardware are now subject to 15% tariffs and it's unclear if the company will eat the costs. The bigger worry are iPhones, which are projected to be impacted by the next round of tariffs set to roll out on December 15. Cook and Apple have been in somewhat constant communication with President Trump and his administration.  Biggest Tech Breakthrough in a Generation  makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   The Walt Disney Company (DIS): Free Stock Analysis Report   Amazon.com, Inc. (AMZN): Free Stock Analysis Report   Netflix, Inc. (NFLX): Free Stock Analysis Report   Alphabet Inc. (GOOGL): Free Stock Analysis Report   Coca-Cola Company (The) (KO): Free Stock Analysis Report   Apple Inc. (AAPL): Free Stock Analysis Report   Microsoft Corporation (MSFT): Free Stock Analysis Report   Deere & Company (DE): Free Stock Analysis Report   Spotify Technology SA (SPOT): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "Apple AAPL  made headlines Wednesday after reports said the iPhone giant is ready to issue new bonds for the first time in two years in order to take advantage of the current global interest rate environment. Apple isn't alone in its bond play, but Wall Street and investors will also turn their sights to the company's September 10 event where it is expected to debut its latest iPhones and detail more of its services push.",
    " iPhone & Services Event ",
    "Apple is scheduled to host an event on Tuesday, September 10 at the Steve Jobs Theater in Cupertino. Apple product rumors float around all year round and many often prove true. But we won't get bogged down in too many details. All most investors really need to know is that the company is projected to show off three new iPhones that are likely to feature somewhat standard upgrades from cameras to processors.",
    "The tech powerhouse might also show off some other new hardware. However, analyst and outlets have started to turn their attention to the services side as the company continues to focus on non-iPhone expansion. CEO Tim Cook is expected to provide far more details about Apple's upcoming streaming TV service.",
    " Apple TV+  is set to launch this fall and feature a slate of content with A-list Hollywood stars both in front of and behind the camera. Wall Street will look to see what price Apple lays out as it tries to attract users amid a crowded streaming TV market that will soon feature itself, Netflix NFLX  , Amazon AMZN  Prime, Disney DIS  , and more.",
    "AAPL is also set to provide more details about its upcoming video game service called Apple Arcade  that will see it make a somewhat big gaming splash in order to expand its gaming reach as Microsoft MSFT  has and Google GOOGL  plans to. It seems somewhat likely that Apple will provide at least some type of bundle option for one of these services with its Spotify SPOT  competitor Apple Music. All in all, Apple's services business needs to continue to expand as iPhone growth slows.",
    " Bond News ",
    "Apple hopes to raise as much as $7 billion via bonds that range between three and 30 years, based on multiple reports  . The company joined a slew of other giants, including Coca-Cola KO  and Deere DE  , by scooping up low yields on corporate debt. Some might wonder why Apple would borrow money when it has over $200 billion in cash? Yet the answer is relatively straightforward: the deal is too good to pass up.",
    "Yields on the 10-year U.S. Treasury notes rest at 1.46% at the moment, down from 2% in late July. Meanwhile, investors are paying to hold government debt from Germany to Japan. Therefore, the demand for debt from global titans such as Apple is high right now. And Apple, like its peers, is smart to lock in such low interest rates because as the saying goes it's cheap money  .",
    " Time to Buy? ",
    " Apple stock  popped 1.70% Wednesday as part of a larger climb. Shares of AAPL are now up roughly 50% from around $140 on January 3 to its recent closing price of $209.19 per share. Despite the jump, Apple still sits over 10% below its 52-week highs, which could give the stock some room to run.",
    "AAPL is currently a Zacks Rank #3 (Hold) that sports an \"A\" grade for Momentum in our Style Scores system. Our current Zacks Consensus Estimates call for AAPL's current quarter (Q4 2019) earnings to slip 2.75% from the year-ago period on 0.56% lower revenue. With that said, Apple is in the midst of a hard comparison period and the company's earnings and sales look poised to jump back in 2020.",
    "Aside from its growth prospects, Apple is the only of the so-called FAANG stocks that pays a dividend. AAPL currently pays an annualized dividend of $3.08 a share, for a 1.50% yield-which tops the 10-year U.S. Treasurys. The company also returns a ton of value to shareholders through buybacks. With all this in mind, Apple appears to be one of the more solid and safe investments anywhere in the world at the moment.",
    " Side note:  One obvious caveat to watch here is what happens on the U.S.-China trade war front. Apple Airpods, Apple Watch, and some other hardware are now subject to 15% tariffs and it's unclear if the company will eat the costs.",
    "The bigger worry are iPhones, which are projected to be impacted by the next round of tariffs set to roll out on December 15. Cook and Apple have been in somewhat constant communication with President Trump and his administration.",
    " Biggest Tech Breakthrough in a Generation  makeArticleAd();   Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.    A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.    See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 07:49:00"
}