{
  "url": "https://www.nasdaq.com/article/swiss-national-bank-concerned-about-digital-currencies-impact-on-monetary-policy-20190905-00818",
  "title": "Swiss National Bank concerned about digital currencies impact on monetary policy - Nasdaq.com",
  "text": [
    "By John Revill",
    "ZURICH, Sept 5 (Reuters) - Digital currencies like the Facebook-led  Libra project which are linked to a basket of currencies could hinder the Swiss National Bank's ability to conduct monetary policy, SNB Chairman Thomas Jordan said on Thursday.",
    "Jordan is the latest central banker to reveal worries about products like the Geneva-based Libra cryptocurrency, known as stablecoins because they avoid wild fluctuations in value because they are pegged to a group of stable currencies.",
    "\"As long as prices, wages and loans are set in Swiss francs, the SNB can influence incentives for savers and borrowers via its monetary policy and thus ensure price stability over the medium term,\" Jordan said in remarks prepared for a speech in Basel.",
    "\"However, if stablecoins pegged to foreign currencies were to establish themselves in Switzerland, the effectiveness of our monetary policy could be impaired.\"",
    "European Central Bank board member Yves Mersch this week said widespread acceptance of Libra posed a threat to the ECB's ability to set its monetary policy.",
    "Depending on the Libra's level of acceptance and referencing the euro in its reserve basket, Mersch said, Libra could impair the monetary policy transmission mechanism by affecting the liquidity of euro area banks and undermine the single currency's international role by reducing demand for it. ",
    "Jordan said the issuers of some stablecoins--such as a Swiss franc stablecoin used widely for cashless payments or as a store of value--would effectively take on the functions of banks and would have to play by the same rules.",
    "\"If the economic function of stablecoins is comparable to that of bank deposits, their issuers should have to play by the same rules as banks,\" he said.",
    "Stablecoin issuers should abide by regulations covering investor and data protection and rules combating money laundering and terrorism financing, Jordan added.",
    "\"Stablecoins present many regulatory challenges, which in turn require close cooperation between the various authorities. This is particularly true of cross-border projects like Libra,\" he said.",
    "Unlike existing stablecoins, Libra will not have a fixed value in any single real-world currency, David Marcus, the head of the Libra project, told the U.S. Senate in July.",
    "Instead, Libra will be fully backed through the Libra Reserve, which will hold a basket of currencies in safe assets such as cash bank deposits and government securities.",
    "These currencies will include the dollar, the British pound, the euro, and the Japanese yen.",
    "\"The Libra Association...will work with the Federal Reserve and other central banks to make sure Libra does not compete with sovereign currencies or interfere with monetary policy,\"     Marcus said in July.",
    "\"Monetary policy is properly the province of central banks.\""
  ],
  "published_datetime": "2019-09-05 12:00:00"
}