{
  "url": "https://www.nasdaq.com/article/notable-wednesday-option-activity-azo-jci-hes-cm1210654",
  "title": "Notable Wednesday Option Activity: AZO, JCI, HES - Nasdaq.com",
  "text": [
    "Among the underlying components of the S&P 500 index, we saw noteworthy  options trading  volume today in AutoZone, Inc. (Symbol: AZO), where a total of 1,569 contracts have traded so far, representing approximately 156,900 underlying shares. That amounts to about 57.3% of AZO's average daily trading volume over the past month of 273,625 shares. Especially high volume was seen for the $640 strike put option expiring January 17, 2020  , with 255 contracts trading so far today, representing approximately 25,500 underlying shares of AZO. Below is a chart showing AZO's trailing twelve month trading history, with the $640 strike highlighted in orange:       makeArticleAd();    Johnson Controls International plc (Symbol: JCI) options are showing a volume of 25,264 contracts thus far today. That number of contracts represents approximately 2.5 million underlying shares, working out to a sizeable 55% of JCI's average daily trading volume over the past month, of 4.6 million shares. Especially high volume was seen for the $45 strike call option expiring October 18, 2019  , with 11,658 contracts trading so far today, representing approximately 1.2 million underlying shares of JCI. Below is a chart showing JCI's trailing twelve month trading history, with the $45 strike highlighted in orange:       And Hess Corp (Symbol: HES) saw options trading volume of 14,777 contracts, representing approximately 1.5 million underlying shares or approximately 50% of HES's average daily trading volume over the past month, of 3.0 million shares. Especially high volume was seen for the $57.50 strike put option expiring November 15, 2019  , with 3,860 contracts trading so far today, representing approximately 386,000 underlying shares of HES. Below is a chart showing HES's trailing twelve month trading history, with the $57.50 strike highlighted in orange:         For the various different available expirations for AZO options  , JCI options  , or HES options  , visit StockOptionsChannel.com.   Today's Most Active Call & Put Options of the   S&P 500 »  ",
    "  Today's Most Active Call & Put Options of the   S&P 500 » ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 02:17:57"
}