{
  "url": "https://www.nasdaq.com/article/can-competitive-pricing-boost-apples-revenues-cm1210362",
  "title": "Can Competitive Pricing Boost Apple's Revenues? - Nasdaq.com",
  "text": [
    " On Sep 10, Apple AAPL  launched the next iterations of its iconic iPhone. No major surprises were in store, however, with nearly all the new models featuring incremental improvements over their predecessors. Neither did the timing of this release come as a surprise since Apple has launched new models every fall since 2011. As expected, the new iPhone 11 models sport faster chips, improved cameras and longer running batteries compared to 2018 models. But the changes are far from major and not a revolution by any means. What caught the average investor's eye this time around was Apple's approach to pricing. The tech behemoth lowered the price of its cheapest iPhone significantly. It also priced its streaming TV service, Apple TV+ significantly below sector behemoths. While such an approach could reduce margins, it provides a golden opportunity for Apple to monetize its large installed device base.  iPhone 11 Sports Lower Price, Minor Improvements  The iPhone 11 starts at $699, significantly lower than the opening price of $749 for XR last year. It marks a major departure in terms of pricing for Apple, which hiked the price of iPhone 8 to $699 in 2017. Of course, the Pro variants of the new iPhone start at $999 and $1099. iPhone 11 has an improved camera and a better processor. But these improvements should not matter to most people. This is especially true because most popular apps such as Facebook FB  , Uber UBER  or Match Group's MTCH  Tinder do not require much processing power. And smartphone cameras across the board have improved significantly over the years.  Pricing to Power Apple's Fortunes?  Apple reduced the price of 2018's iPhone XR to $599. Such price reductions also trickled down to the rest of its older ecosystem. The two-year old Series 3 Apple watch is now available at $199. This makes it a far more compelling purchase compared to the new models priced between $399 and $499. Even the new streaming service, Apple TV+, slated to launch later this year, has been priced very competitively. At $4.99 a month, it will be much cheaper than Disney's DIS  Disney+ or Netflix NFLX  . Further, a free year will be available to those customers who purchase an Apple device. These changes could reduce Apple's margins significantly. But it seems that Apple is now focusing on seeding its subscriber base to ensure long-term loyalty instead of maximizing profits over a shorter time period. With an installed base of 1.4 billion devices, services revenues could double from the levels witnessed in 2016.  Conclusion  With the commoditization of smartphones looking imminent, Apple has taken the price cut route to boost its market share. It is no longer interested in taking a myopic approach to profitability. Instead, a longer-term approach to boosting shareholder value seems to be the priority for Apple going forward.  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.      Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.     See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  The Walt Disney Company (DIS): Free Stock Analysis Report   Netflix, Inc. (NFLX): Free Stock Analysis Report   Match Group, Inc. (MTCH): Free Stock Analysis Report   Facebook, Inc. (FB): Free Stock Analysis Report   Apple Inc. (AAPL): Free Stock Analysis Report   Uber Technologies, Inc. (UBER): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "On Sep 10, Apple AAPL  launched the next iterations of its iconic iPhone. No major surprises were in store, however, with nearly all the new models featuring incremental improvements over their predecessors. Neither did the timing of this release come as a surprise since Apple has launched new models every fall since 2011.",
    "As expected, the new iPhone 11 models sport faster chips, improved cameras and longer running batteries compared to 2018 models. But the changes are far from major and not a revolution by any means. What caught the average investor's eye this time around was Apple's approach to pricing.",
    "The tech behemoth lowered the price of its cheapest iPhone significantly. It also priced its streaming TV service, Apple TV+ significantly below sector behemoths. While such an approach could reduce margins, it provides a golden opportunity for Apple to monetize its large installed device base.",
    " iPhone 11 Sports Lower Price, Minor Improvements ",
    "The iPhone 11 starts at $699, significantly lower than the opening price of $749 for XR last year. It marks a major departure in terms of pricing for Apple, which hiked the price of iPhone 8 to $699 in 2017. Of course, the Pro variants of the new iPhone start at $999 and $1099.",
    "iPhone 11 has an improved camera and a better processor. But these improvements should not matter to most people. This is especially true because most popular apps such as Facebook FB  , Uber UBER  or Match Group's MTCH  Tinder do not require much processing power. And smartphone cameras across the board have improved significantly over the years.",
    " Pricing to Power Apple's Fortunes? ",
    "Apple reduced the price of 2018's iPhone XR to $599. Such price reductions also trickled down to the rest of its older ecosystem. The two-year old Series 3 Apple watch is now available at $199. This makes it a far more compelling purchase compared to the new models priced between $399 and $499.",
    "Even the new streaming service, Apple TV+, slated to launch later this year, has been priced very competitively. At $4.99 a month, it will be much cheaper than Disney's DIS  Disney+ or Netflix NFLX  . Further, a free year will be available to those customers who purchase an Apple device.",
    "These changes could reduce Apple's margins significantly. But it seems that Apple is now focusing on seeding its subscriber base to ensure long-term loyalty instead of maximizing profits over a shorter time period. With an installed base of 1.4 billion devices, services revenues could double from the levels witnessed in 2016.",
    " Conclusion ",
    "With the commoditization of smartphones looking imminent, Apple has taken the price cut route to boost its market share. It is no longer interested in taking a myopic approach to profitability. Instead, a longer-term approach to boosting shareholder value seems to be the priority for Apple going forward.",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.     ",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.  ",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 09:03:00"
}