{
  "url": "https://www.nasdaq.com/article/cloud-computing-etfs-reasons-to-bet-on-cm1206534",
  "title": "Cloud Computing ETFs: Reasons to Bet On - Nasdaq.com",
  "text": [
    " Cloud computing is a process in which  data or software is stored outside of a computer  , but can be easily accessed anywhere, at any time via the Internet. This idea is effective as it helps firms lower IT costs by eliminating the need for servers and related maintenance costs. Also, cloud computing provides greater accessibility. Since everything is on the Internet, users can access any data or document any moment. Needless to say, such advantages will surely give it an edge in the future. Global investment in cloud services has increased leaps and bounds in recent years as more companies have opted online infrastructure provided by the likes of  Amazon AMZN  ,  Microsoft MSFT  and  Alphabet  GOOGL  . Research firm Gartner expects  , by the end of 2019, \" more than 30% of technology providers' new software investments  will have moved from cloud-first to cloud-only.\" Though most organizations do not possess a formal cloud strategy  still now, 70% of organizations will have by 2022, per Gartner.  In a report released in Apr 2019  , Gartner projected that the worldwide public cloud services market will likely grow 17.5% in 2019 to total $214.3 billion, up from $182.4 billion in 2018. Currently about 19% of cloud budgets are disbursed on cloud-related services, such as cloud consulting, implementation, migration and managed services, and Gartner expects that this share of investment will rise to 28%  by 2022. Gartner also projects the market size and growth of the cloud services industry will be at around  three time the growth of overall IT services  through 2022 (read: Can Global X New Cloud Computing ETF See Success?  ). Against this backdrop, below we highlight a few cloud computing ETFs that could stand to gain in the coming days (see all technology ETFs here  ).  First Trust Cloud Computing ETF ( SKYY )  The underlying ISE Cloud Computing Index is a modified market capitalization weighted index designed to track the performance of companies actively involved in the cloud computing industry. The fund charges 60 bps in fees (read: ETFs to Tap on Oracle's Robust Q4 Earnings  ).  Tortoise Cloud Infrastructure Fund ( TCLD )  The underlying Tortoise Global Cloud Infrastructure Index is a proprietary rules-based, modified market capitalization weighted, float adjusted index designed to track the overall performance of equity securities of global cloud computing infrastructure companies listed on a developed country exchange. Splunk, Oracle and Alibaba are the top three holdings of the fund. The fund charges 40 bps in fees (read: ETFs to Tap on Oracle's Robust Q4 Earnings  ).  AdvisorShares Sabretooth ETF ( BKCH )  The fund holds that companies utilizing cloud computing and digital companies that implement emerging technology like blockchain may realize increased profitability and appreciation in stock prices over an extended time horizon. Mastercard, Alteryx and Visa are the top three holdings of the fund. The product charges 85 bps in fees.  Want key ETF info delivered straight to your   inbox?  Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.  Get it free >>    Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Amazon.com, Inc. (AMZN): Free Stock Analysis Report   Alphabet Inc. (GOOGL): Free Stock Analysis Report   Microsoft Corporation (MSFT): Free Stock Analysis Report   First Trust Cloud Computing ETF (SKYY): ETF Research Reports   Tortoise Cloud Infrastructure Fund (TCLD): ETF Research Reports   AdvisorShares Sabretooth ETF (BKCH): ETF Research Reports   To read this article on Zacks.com click here.   Zacks Investment Research   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ",
    "Cloud computing is a process in which  data or software is stored outside of a computer  , but can be easily accessed anywhere, at any time via the Internet. This idea is effective as it helps firms lower IT costs by eliminating the need for servers and related maintenance costs.",
    "Also, cloud computing provides greater accessibility. Since everything is on the Internet, users can access any data or document any moment. Needless to say, such advantages will surely give it an edge in the future.",
    "Global investment in cloud services has increased leaps and bounds in recent years as more companies have opted online infrastructure provided by the likes of  Amazon AMZN  ,  Microsoft MSFT  and  Alphabet  GOOGL  .",
    "Research firm Gartner expects  , by the end of 2019, \" more than 30% of technology providers' new software investments  will have moved from cloud-first to cloud-only.\" Though most organizations do not possess a formal cloud strategy  still now, 70% of organizations will have by 2022, per Gartner.",
    " In a report released in Apr 2019  , Gartner projected that the worldwide public cloud services market will likely grow 17.5% in 2019 to total $214.3 billion, up from $182.4 billion in 2018. Currently about 19% of cloud budgets are disbursed on cloud-related services, such as cloud consulting, implementation, migration and managed services, and Gartner expects that this share of investment will rise to 28%  by 2022.",
    "Gartner also projects the market size and growth of the cloud services industry will be at around  three time the growth of overall IT services  through 2022 (read: Can Global X New Cloud Computing ETF See Success?  ).",
    "Against this backdrop, below we highlight a few cloud computing ETFs that could stand to gain in the coming days (see all technology ETFs here  ).",
    " First Trust Cloud Computing ETF ( SKYY ) ",
    "The underlying ISE Cloud Computing Index is a modified market capitalization weighted index designed to track the performance of companies actively involved in the cloud computing industry. The fund charges 60 bps in fees (read: ETFs to Tap on Oracle's Robust Q4 Earnings  ).",
    " Tortoise Cloud Infrastructure Fund ( TCLD ) ",
    "The underlying Tortoise Global Cloud Infrastructure Index is a proprietary rules-based, modified market capitalization weighted, float adjusted index designed to track the overall performance of equity securities of global cloud computing infrastructure companies listed on a developed country exchange. Splunk, Oracle and Alibaba are the top three holdings of the fund. The fund charges 40 bps in fees (read: ETFs to Tap on Oracle's Robust Q4 Earnings  ).",
    " AdvisorShares Sabretooth ETF ( BKCH ) ",
    "The fund holds that companies utilizing cloud computing and digital companies that implement emerging technology like blockchain may realize increased profitability and appreciation in stock prices over an extended time horizon. Mastercard, Alteryx and Visa are the top three holdings of the fund. The product charges 85 bps in fees.",
    " Want key ETF info delivered straight to your   inbox? ",
    "Zacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.  Get it free >> ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 08:00:00"
}