{
  "url": "https://www.nasdaq.com/article/pemex-bonds-rally-on-capital-inject-bond-tender-20190911-00662",
  "title": "Pemex bonds rally on capital inject, bond tender - Nasdaq.com",
  "text": [
    "By Miluska Berrospi",
    "NEW YORK, Sept 11 (IFR) - Pemex bonds rallied on Wednesday after the troubled Mexican oil firm announced a US$5bn capital injection from the government as part of jumbo debt tender and exchange to help right its finances.",
    "Bonds issued by the state-owned entity were the most traded securities in the EM corporate bond space this morning, with the 6.5% 2029 leaping 1.75 points from opening levels to hit 101.15, by early afternoon, according to MarketAxess data.",
    "\"This is a capital injection story,\" said Edwin Gutierrez, a portfolio manager with Aberdeen Asset Management.",
    "\"They're taking advantage of good headlines and window. Their existing bonds are flying,\"",
    "The positive response bodes well for the company's plans to issue a new bond offering on Thursday, comprising seven, 10 and 30-year maturities, as part of the debt exchange and tender.",
    "The deal will mark the company's first dollar deal since October last year when it issued the 2029s, and its first with one leg in junk territory.",
    "The liability management transactions are expected to include private tender offers for cash for bonds maturing between 2020 to 2023.",
    "The new bond issue will also be done concurrently with an exchange offer for bonds maturing between 2022 and 2048.",
    "The move is expected to please rating agencies such as Moody's which have yet to demote Pemex to junk status.",
    "\"It's a capital injection that the market has been asking for. I think for now it should enough for the ratings agencies not to downgrade,\" said Roger Horn, a senior emerging markets strategist at SMBC Nikko Securities America",
    "There have been worries that the company could become a full-fledged fallen angel if Moody's follows Fitch which down graded Pemex in June to sub-investment grade, from BB+ from BBB.",
    "\"The capital injection is line with our expectations for the government's support to Pemex,\" said Pete Speer, senior vice president at Moody's, which assigned a Baa3 rating to the new bond.",
    "\"The planned debt repayment and exchange offers will increase revolver borrowing availability and refinance some 2020 and 2021 debt maturities, improving PEMEX's liquidity position and debt maturity profile.\"",
    "The capital injection could postpone Moody's decision of a potential downgrade, says Aberdeen's Gutierrez. However it is a only a portion of a turn-around investors are hoping to see in the company, he said.",
    "\"Obviously this doesn't solve the whole business model issue, but they were looking for additional government support and they're getting it,\" he said.",
    "Sufficient oil production and capex needs also remain top of mind for investors in the company, who are awaiting additional government support.",
    "\"These amounts [government capital injection] might be insufficient, particularly since the 2020 budget envisages Pemex will be producing c1.9mn barrels of oil per day (mmbpd), when the last results showed the company producing only a little over 1.6mmbpd,\" said Tellimer's Rafael Elias in a report.",
    "Citigroup, Goldman Sachs, HSBC and JP Morgan have been mandated as active joint bookrunners and lead dealer managers. BofA Merrill Lynch, Credit Agricole CIB and Mizuho Securities are passive joint bookrunners and dealer managers."
  ],
  "published_datetime": "2019-09-11 01:45:00"
}