{
  "url": "https://www.nasdaq.com/article/is-bcb-bancorp-bcbp-a-great-value-stock-right-now-cm1207213",
  "title": "Is BCB Bancorp (BCBP) a Great Value Stock Right Now? - Nasdaq.com",
  "text": [
    " Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks. Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks. Looking at the history of these trends, perhaps none is more beloved than value investing. This strategy simply looks to identify companies that are being undervalued by the broader market. Value investors use tried-and-true metrics and fundamental analysis to find companies that they believe are undervalued at their current share price levels. On top of the Zacks Rank, investors can also look at our innovative Style Scores system to find stocks with specific traits. For example, value investors will want to focus on the \"Value\" category. Stocks with high Zacks Ranks and \"A\" grades for Value will be some of the highest-quality value stocks on the market today. One stock to keep an eye on is BCB Bancorp (BCBP). BCBP is currently sporting a Zacks Rank of #2 (Buy) and an A for Value. The stock has a Forward P/E ratio of 9.60. This compares to its industry's average Forward P/E of 10.12. Over the past year, BCBP's Forward P/E has been as high as 12.25 and as low as 8.23, with a median of 10.29. Investors should also note that BCBP holds a PEG ratio of 0.96. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. BCBP's industry currently sports an average PEG of 1.14. Over the last 12 months, BCBP's PEG has been as high as 1.22 and as low as 0.82, with a median of 1.03. Another valuation metric that we should highlight is BCBP's P/B ratio of 1.01. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. This company's current P/B looks solid when compared to its industry's average P/B of 1.34. Over the past 12 months, BCBP's P/B has been as high as 1.29 and as low as 0.92, with a median of 1.08. Value investors also frequently use the P/S ratio. This metric is found by dividing a stock's price with the company's revenue. This is a prefered metric because revenue can't really be manipulated, so sales are often a truer performance indicator. BCBP has a P/S ratio of 1.61. This compares to its industry's average P/S of 2.6. Finally, we should also recognize that BCBP has a P/CF ratio of 10.05. This figure highlights a company's operating cash flow and can be used to find firms that are undervalued when considering their impressive cash outlook. BCBP's P/CF compares to its industry's average P/CF of 11.63. Over the past year, BCBP's P/CF has been as high as 18.85 and as low as 9.66, with a median of 12.33. These are just a handful of the figures considered in BCB Bancorp's great Value grade. Still, they help show that the stock is likely being undervalued at the moment. Add this to the strength of its earnings outlook, and we can clearly see that BCBP is an impressive value stock right now.   Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  BCB Bancorp, Inc. (NJ) (BCBP): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    "Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks. Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks.",
    "Looking at the history of these trends, perhaps none is more beloved than value investing. This strategy simply looks to identify companies that are being undervalued by the broader market. Value investors use tried-and-true metrics and fundamental analysis to find companies that they believe are undervalued at their current share price levels.",
    "On top of the Zacks Rank, investors can also look at our innovative Style Scores system to find stocks with specific traits. For example, value investors will want to focus on the \"Value\" category. Stocks with high Zacks Ranks and \"A\" grades for Value will be some of the highest-quality value stocks on the market today.",
    "One stock to keep an eye on is BCB Bancorp (BCBP). BCBP is currently sporting a Zacks Rank of #2 (Buy) and an A for Value. The stock has a Forward P/E ratio of 9.60. This compares to its industry's average Forward P/E of 10.12. Over the past year, BCBP's Forward P/E has been as high as 12.25 and as low as 8.23, with a median of 10.29.",
    "Investors should also note that BCBP holds a PEG ratio of 0.96. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. BCBP's industry currently sports an average PEG of 1.14. Over the last 12 months, BCBP's PEG has been as high as 1.22 and as low as 0.82, with a median of 1.03.",
    "Another valuation metric that we should highlight is BCBP's P/B ratio of 1.01. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. This company's current P/B looks solid when compared to its industry's average P/B of 1.34. Over the past 12 months, BCBP's P/B has been as high as 1.29 and as low as 0.92, with a median of 1.08.",
    "Value investors also frequently use the P/S ratio. This metric is found by dividing a stock's price with the company's revenue. This is a prefered metric because revenue can't really be manipulated, so sales are often a truer performance indicator. BCBP has a P/S ratio of 1.61. This compares to its industry's average P/S of 2.6.",
    "Finally, we should also recognize that BCBP has a P/CF ratio of 10.05. This figure highlights a company's operating cash flow and can be used to find firms that are undervalued when considering their impressive cash outlook. BCBP's P/CF compares to its industry's average P/CF of 11.63. Over the past year, BCBP's P/CF has been as high as 18.85 and as low as 9.66, with a median of 12.33.",
    "These are just a handful of the figures considered in BCB Bancorp's great Value grade. Still, they help show that the stock is likely being undervalued at the moment. Add this to the strength of its earnings outlook, and we can clearly see that BCBP is an impressive value stock right now.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 09:10:11"
}