{
  "url": "https://www.nasdaq.com/article/one-retailers-earnings-shows-not-all-retail-stocks-are-doomed-cm1206649",
  "title": "One Retailer's Earnings Shows Not All Retail Stocks Are Doomed - Nasdaq.com",
  "text": [
    "In the stock market, once a story takes hold and an idea becomes conventional wisdom, it can be a very powerful thing. If, for example you got ten dollars for every time somebody said that retail was doomed, you might not get rich, but you would receive a steady income. That view seems at times to be ubiquitous, and most retail stocks have been under pressure for some time as a result.",
    "The problem is that it is a massive generalization.",
    "For sure, traditional retail operations, when taken on average, are suffering as shopping habits change, but that average obscures a wide range of results and prospects. That creates opportunity in stocks dragged down by the general pessimism, but where the company is defying the odds and doing well.",
    "That brings us to the Texas-based home furnishings chain Conn’s (CONN), who released earnings this morning.",
    "They beat expectations on both the top and bottom lines, which has caused the stock to jump well over ten percent in this morning’s premarket, but the nature of those beats suggests that that is just the beginning of what should be a long-term recovery.",
    "Prior to this morning’s release, CONN’s chart looked like a typical retail stock this year, losing around half its value over the last 52 weeks. However, the low was reached back in June when the stock bottomed out after beating expectations in that month’s earnings report. This, then, is the second consecutive beat.",
    "In retail, that is often not as impressive as its sounds. Analysts are fully aware of, and influenced by, the prevailing mood of doom and gloom around the sector, and forecasts have been being adjusted downwards for some time, making beats easier to come by. What is impressive about Conn’s last quarter is that it didn’t come from cutting back faster than anticipated, it was based on real growth.",
    "Total retail sales increased by 3.3%, with same-store sales rising 0.4% in CONN’s last quarter. EPS rose 17% to $0.62 on a gross margin of over 40%. That is solid, if not spectacular, but it reflects the fact that rather than assume that retail pessimism applies to them, Conn’s continues to grow.",
    "They announced that they are expanding into Florida for example, where they see room for around forty stores, but they remain regional, with operations in sixteen states if you include that expansion. That leaves lots of room for further growth.",
    "None of this is to say that things are perfect, of course. Conn’s does carry a fairly heavy debt load, something which will have contributed to the big 52-week losses in such a pessimistic environment. As it stands however, the expansion is paying for itself and they have positive free cash flow, even as they continue to reinvest.",
    "If I had my choice, I would rather see excess profits used to pay down that debt to ensure long-term stability rather than for the stock repurchase program that is ongoing, although that does provide some short-term support for the stock.",
    "The real appeal of CONN is that it is cheap. The forward P/E of 7.25 is at odds with the reality of a company that is growing both sales and profits, as reflected in the PEG ratio of 0.32. It seems that investors are looking at CONN as just another retail stock, beset by all the problems that implies. That is obscuring the fact that they are a company that is growing at a reasonable pace, with plenty of room to continue to do so.",
    "As to when to buy, it may well be that there will be a drop back from this morning’s initial pop given the fact that all the major stock market indices are indicating a significantly lower opening this morning. So, for potential buyers, holding off for a day or so may be advantageous in the short term ... don’t wait too long.",
    "As I have frequently said in the past, perception and mood can drive markets for a surprisingly long time, but eventually reality wins. The reality here is that Conn’s is the exception to the rule that retail is dying, and the perception that there is no such thing as an exception just means that investors can pick up the stock at a big discount.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 10:42:13"
}