{
  "url": "https://www.nasdaq.com/article/brazil-car-wash-corruption-probe-facing-worst-moment-as-establishment-fights-back-20190904-01043",
  "title": "Brazil 'Car Wash' corruption probe facing 'worst moment' as establishment fights back - Nasdaq.com",
  "text": [
    "By Ricardo Brito",
    "BRASILIA, Sept 4 (Reuters) - Brazil's biggest-ever corruption investigation, which jailed dozens including a former president, has been threatened over the past week by a Supreme Court ruling and push back from politicians seeking to curb investigative powers.",
    "\"There's no doubt this is Car Wash's worst moment,\" said former lead prosecutor Carlos Fernando dos Santos Lima, now retired, in an interview with Reuters this week.",
    "After five years of convictions and confessions, plus billions of dollars in recovered bribes, there is no doubt that the probe has made a lasting impact. Its findings spurred a wave of other investigations around Brazil and Latin America, taking down presidents and rattling global firms in sectors from oil trading to medical equipment.",
    "But the Car Wash team itself, which for years had Brasilia holding its breath as it brought down a string of business leaders and power brokers, has lost its aura of invincibility.",
    "In a landmark decision last week, the Supreme Court overturned the conviction of Aldemir Bendine, a former president of state-run oil company Petrobras. A majority of justices found he should have had a chance to make a closing argument after hearing accusations against him from plea-bargain testimony.",
    "Others convicted in the Car Wash probe have begun to file appeals before the Supreme Court with the same argument.",
    "Lula's lawyer Cristiano Zanin Martins said the court ruling and Moro's exchanges with prosecutors leaked by The Intercept news site have given the Supreme Court the opportunity to remedy  what he called a \"scenario of abuses\" committed by the Car Wash team against the former president.",
    "\"The messages made public by The Intercept and other media outlets show that Sergio Moro instructed and guided all the prosecutors,\" Martins told Reuters.",
    "Moro declined to comment for this story. He and lead Car Wash prosecutor Deltan Dallagnol have said they see nothing inappropriate in the published messages.",
    "Moro has come under criticism for joining the cabinet of far-right president Jair Bolsonaro, who was elected last October after the bribery conviction barred Lula - still one of Brazil's most popular politicians - from running in the election.",
    "The former president is serving a nearly nine-year sentence for receiving a beachside apartment from an engineering company, and is appealing another conviction that found he was given a country home in return for lucrative government contracts.",
    "POLITICIANS PUSH BACK",
    "In Moro's new role in Brasilia, he has also struggled with resistance from the political class that was threatened for years by his anti-graft crusade.",
    "Moro has asked Bolsonaro to veto parts of a bill passed by Congress that would curb the powers of prosecutors to probe suspects. Meanwhile, Moro's anti-crime package, an attempt to deliver on Bolsonaro's law-and-order campaign vows, is stalled in Congress.",
    "But the Car Wash investigators say they are not done yet. Brazil's top public prosecutor Raquel Dodge last month extended for another year the Car Wash investigative task force that includes 15 prosecutors and an additional staff of 30.",
    "From 2014 to July, Car Wash had brought 101 indictments against 445 people on charges from bribery and money laundering to obstruction of justice, winning 158 convictions so far in 50 trials. The investigation has recovered 14 billion reais ($3.4 billion) of public money, including 3 billion reais returned to Petrobras from kickbacks skimmed off overpriced contracts.",
    "\"We still have a lot of work. I don't think we are even half way done. At each turn, a stream of new people appear involved in graft schemes,\" said Car Wash prosecutor Marcelo Ribeiro.",
    "\"It seems there is no end to it. Some people might wish Car Wash to end, but that is the reality,\" he said.",
    "($1 = 4.1196 reais)"
  ],
  "published_datetime": "2019-09-04 03:31:00"
}