{
  "url": "https://www.nasdaq.com/article/happiest-places-to-retire-in-the-us-2019-cm1206660",
  "title": "Happiest Places to Retire in the U.S. 2019 - Nasdaq.com",
  "text": [
    "A state of happiness cannot be pinpointed on a map. But a great deal of residents seem to have found it in these 10 places, according to the Gallup-Sharecare Well-Being Index.",
    "Digital health company Sharecare, working with Gallup, has conducted more than 2.6 million surveys nationwide since 2008 to gauge \"Americans' perceptions of their lives and their daily experiences.\" The Well-Being Index is based specifically on residents' feelings about five elements of well-being: \"purpose\" (liking what you do and being motivated to achieve goals), \"social\" (having supportive relationships and love), \"financial\" (managing your budget to feel secure), \"community\" (liking where you live) and \"physical\" (being in good health). The higher the score, on a scale of 0 to 100, the happier residents indicate they are about where and how they are living their lives.",
    "To come up with our original list of the 50 best places to retire in the U.S. --one in each state--we factored in the \"community\" and \"physical\" components of the Well-Being Index, where available, as well as living costs, safety, median incomes and poverty rates for retirement-age residents and the availability of recreational and health care facilities. The following 10 retirement destinations rank the highest in terms of the overall well-being of residents. See if you agree, and consider whether any might make a happy place for your own retirement.",
    "Well-being score: 63.0 (U.S.: 61.8)",
    "City population: 42,453",
    "Share of population 65+: 10.7%",
    "Cost of living for retirees: 16.4% above the national average",
    "Average income for population 65+: n/a",
    "State's tax rating for retirees: Least Tax Friendly",
    "This small mountain city on the shores of Lake Champlain is a picturesque setting for tree-hugging retirees. Outdoor recreation is plentiful with miles of hiking and biking paths, nearby beaches where you can swim, kayak or paddleboard in the warmer months, and numerous skiing options in the area. An eco-friendly vibe permeates the town, from the businesses bolstering the city's economy, such as household-products maker Seventh Generation, to the local food movement feeding the neighborhood.",
    "But being green isn't easy on your wallet. Taxes and living costs are high. While the median home value is a low $206,000 in the Green Mountain State, compared with the median $229,000 for the U.S., it climbs to $326,500 in Burlington. A private room in a metro area nursing home costs a median $11,498 a month, compared with $8,365 a month for the U.S. At least you can save money on academic pursuits. The University of Vermont will cover tuition costs for state residents age 65 and older who wish to take a class, even if it's for credit.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-01 23:46:02"
}