{
  "url": "https://www.nasdaq.com/article/currency-wars-forex-intervention-does-it-work-cm1206523",
  "title": "Currency Wars: Forex Intervention - Does it Work? - Nasdaq.com",
  "text": [
    "I learned a long time ago not to count on central banks to bail out your position. Even those with short memories recall the carnage following the Swiss National Bank’s decision to abandon its support of the EURCHF 1.20 peg January 2015",
    "A central bank being forced out of the market after failed interventions is not new. President Trump and his advisors should study the forex history books before deciding whether to intervene to weaken the dollar,’",
    "Let’s take a look at different types of forex intervention and which tend to be most effective.",
    "Types of Intervention",
    "1) Unilateral or Coordinated",
    "Intervention can take the form of being unilateral (i.e. one central acting alone) or coordinated (i.e. various central banks acting in concert).",
    "2) Sterilized or Unsterilized",
    "The results of the intervention (i.e. buying or selling a currency) can be sterilized or left unsterilized. When a central bank sterilizes intervention, it offsets the impact of buying or selling its currency through intervention by adding or draining reserves from its domestic money market. When intervention is left unsterilized, the central bank allows the full impact of such actions to either increase or reduce the supply of liquidity.",
    "3) Overt Intervention",
    "A central bank may look for the shock effect by being visible in its forex intervention. This overt intervention may see the central bank surprise the market and come in via an electronic platform, which gets flashed across wore services. This often sees a sharp reaction in the market but the more times employed, the less impact it tends to have.",
    "4) Covert Intervention",
    "A central bank may prefer to keep traders guessing and intervene covertly. In this way all traders get are rumors as the intervention is not publicized.",
    "One method of covert intervention is through the use of surrogates to buy or sell its currency. In this way it can disguise its actions and keep the market guessing. Some call this stealth intervention. There is speculation that the Japan’s MOF (Ministry of Finance) and Bank of Japan have employed this tactic for years but only insiders know whether this is true and if so, to what extent it is used.",
    "5) Managed Float",
    "Those countries with managed currency regimes have become a factor in intervention. In these cases, the central bank uses the proceeds from forex intervention to adjust its currency reserve basket to maintain the ratio of dollars and other currencies. Central banks often use this tactic to keep its currency from appreciating although it can work on both sides.",
    "Click to participate in our intervention poll, Will the U.S. Intervene to Weaken the Dollar?",
    "(Note. our Brexit poll was one of the only surveys to call the outcome dead on from the start) ",
    "Which types of intervention tend to be most effective?",
    "As a rule, it is easier for a central bank to intervene to slow the appreciation of its currency than to support a falling currency. Intervention tends to be more effective when accompanied by other measures, such as an increase/decrease in interest rates to make a currency more/less attractive.",
    "Coordinated forex intervention is generally more effective than unilateral intervention in the currency market. The most notable example is the 1986 Plaza Accord, where the G-7 countries agreed to work together to drive down an overvalued USD. It is more difficult for a country, acting alone, to intervene effectively.",
    "Unsterilized intervention is more effective than sterilized intervention. Traders look to see if central banks sterilize intervention and allow the buying or selling to increase or decrease (as the case may be) the supply of its currency. Most interventions tend to be sterilized as central banks take offsetting measures to limit the impact on domestic monetary conditions.",
    "The more predictable a central bank is in its interventions the less the impact each time employed. This may be referred to as the law of diminishing returns as the market gets used to it and adjusts its strategies accordingly. The initial reaction to a surprise intervention tends to have the greatest impact. Traders also look to see whether the central bank intervenes at lower/higher levels or gets aggressive by continuing to buy/sell at higher/lower levels. The latter tends to see the most impact but runs a risk as once the central bank steps back the market tends to reverse some of the earlier moves.",
    "Stealth intervention is more of a gray area. The market only suspects intervention when a central bank uses surrogates to intervene and a lot depends on how much it wants to keep the market guessing.",
    "The Bank of Japan and Ministry of Finance tend to be secretive but the market suspects they have been employing stealth intervention for years. One reason may be that they do not want to be accused of trying to engineer an undervalued currency. Given Japan’s dependence on exports, there is suspicion that it tries to limit the JPY upside to help its exporters through stealth intervention, thereby avoiding any criticism from other trading partner countries.",
    "Reserve Management is used with a managed float, a strategy often employed by emerging market countries to limit the appreciation of their currencies. This is especially true of periods when the dollar is weak. The way this works is a central bank buys dollars to limit its currency’s upside and then diversifies by selling some of those dollars to convert into other currencies to maintain the allocation of its reserve basket. If selling dollars to manage its float, the central bank buys back some of those dollars and sells other currencies in its reserve bask to maintain the percentage allocations and vice versa of buying dollars.",
    "So when you hear that a central bank intervenes, you have to explore further to assess its potential impact and adjust your strategies accordingly. Is it unilateral or coordinated? Are there any additional measures taken to support the intervention? How visible is the central bank intervention? Is there stealth intervention going on? What is the impact on major currencies from intervention to maintain a managed float? These just scratch the surface but give some insights into forex intervention. ",
    "Click to participate in our intervention poll, Will the U.S. Intervene to Weaken the Dollar?",
    "(Note. our Brexit poll was one of the only surveys to call the outcome deed on from the start) ",
    "Jay Meisler,",
    "Founder, Global Traders Association",
    "Co-founder, Global-View.com",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:26:03"
}