{
  "url": "https://www.nasdaq.com/article/7-deeply-discounted-energy-stocks-to-buy-cm1206921",
  "title": "7 Deeply Discounted Energy Stocks to Buy - Nasdaq.com",
  "text": [
    "InvestorPlace - Stock Market News, Stock Advice & Trading Tips",
    "2019 has been a rotten, no-good year for energy stocks. While the stock market as a whole has prospered, energy stocks have missed the boat. The price of crude oil hasn't been particularly favorable and natural gas prices have sunk like a rock. On top of that, investors have been favoring growth while shying away from value stocks. This has left the energy sector orphaned; in fact, energy's share of the S&P 500 has fallen to its lowest level in many years.",
    "For investors willing to buy what others are selling, however, energy stocks offer many rewards here. For one, these are the stocks to buy now if you want strong dividend yields. Across the sector, leading energy firms are offering their highest dividend yields in decades. This, while rates on fixed income in general have plummeted.",
    "Additionally, expect a wave of M&A to help reignite interest in the energy stocks. For example, Blackstone (NYSE: BX ) just announced a takeover for pipeline operator  Tallgrass Energy (NYSE: TGE ). That led to a 35% surge for TGE stock last Wednesday. And as we'll see, that's not the only dealmaking activity going on in the sector right now. With everyone abandoning energy stocks, this could be the time to take advantage of the general pessimism.",
    "Tallgrass wasn't the only company making headlines this week.  BP  (NYSE: BP ) also caused a stir with its announcement that it is selling its Alaskan oil interests to  Hilcorp , a privately-owned company. Hilcorp will pay BP $5.6 billion; $4 billion of that goes to BP immediately, and Hilcorp will deliver the rest gradually in coming years.",
    "It seems that BP drove a fair bargain. Its Alaskan properties produce roughly 74,000 barrels of oil a day, and have been declining in production in recent years. Figuring an average oil price in the low $50s per barrel, Alaska was generating around $1.4 billion annually for BP in revenues. Thus, it sold a mature oil field for around 4x annual revenues, even given the poor industry sentiment at the moment.",
    "Additionally, this sale helps with BP's promised transformation. BP said that it will divest $10 billion in assets as it transitions to more growth and green energy opportunities. With this deal, they have now reached more than half of their overall target.",
    "Management is delivering on its corporate strategy. The asset sales also help strengthen the balance sheet. This should give investors more confidence in BP's gigantic 6.71% dividend yield. In a market starved for yield, it's hard to think BP stock will stay unloved for too long.",
    "Speaking of dividend yields, ExxonMobil (NYSE: XOM ) is another income champion that the market is paying no respect right now. ExxonMobil has raised its dividend for 36 consecutive years, making it one of the few companies to manage that feat. Incredibly, it was able to keep raising its dividend even through the oil and gasoline price doldrums in the late 1990s. The great financial crisis didn't break its streak either.",
    "XOM stock is now offering a 5.1% dividend yield. That's amazing; it's the most that ExxonMobil has offered since 1990. Particularly with interest rates plunging ever lower, XOM stock is a fantastic alternative to bank CDs or government bonds yielding 2% or less.",
    "Is the dividend sustainable? Yes. In fact, ExxonMobil still has one of the highest-quality balance sheets in corporate America and is rated a sterling AA+. Even with the slump in oil and natural gas prices, ExxonMobil has still been able to cover its dividend payments out of free cash flow.",
    "And after years of lying low, XOM is pushing the accelerator. It has plans to double its earnings and cash flow over the next five years or so. While the competition has had to retrench due to the slump in energy, ExxonMobil is ready to pick up the slack. With a huge new oil field coming online soon in Guyana, ExxonMobil is prepared for the next decade and more. Throw in any recovery in oil prices, and XOM stock should soar.",
    "A lot of investors, Americans in particular, have some faulty perceptions of the Canadian oil sands. Often disparagingly called \"tar sands,\" oil sands - primarily located in the province of Alberta - are an emerging power play in global crude oil production. Many years ago, this type of production was extremely expensive and damaging to the environment. Over the years, however, operators have gotten much better on both fronts.",
    "Oil sands are now one of the cheapest sources of crude in North America. There's still another issue, however. The oil sands have huge upfront development costs to launch production. That's in stark contrast to, say, fracking another well in the Permian in Texas. Some investors have been put off on oil sands projects because of these capital costs.",
    "Here's the thing they're missing: When you drill a new well in the Permian, for example, most of the production comes within the first couple years. By year ten or so of operation, that well will be kicking out only a few barrels of oil a day. Thus, for frackers, it's a constant and expensive treadmill to keep production rolling. With the oil sands, however, once it's built, you can produce for decades at a low cost. Your production doesn't fall off a cliff - rather you get stable sweet returns for many years.",
    "Suncor (NYSE: SU ) has become the leader in this space in Canada. It has several other attractive features as well. The most important right now is that it is integrated; it has a ton of gasoline refining capacity as well. This allows Suncor to earn far higher prices for its oil than other Western Canadian operators who are dealing with a glut of oil locally.",
    "It's possible that upcoming elections will deliver a more pro-energy government in Canada, making way for more pipelines. Until then, however, Suncor, with its refining and decades of cheap oil reserves, is a standout pick for its refining edge. SU stock currently yields 4.53%, making it one of the better options in the energy stocks space.",
    "Canadian Natural Resources (NYSE: CNQ ) is another big player in oil sands, although it has oil operations around the world in addition to its Canadian holdings.",
    "The firm just made a huge power play, buying up $2.8 billion of oil sands assets from Devon Energy (NYSE: DVN ). This deal appears to have been an absolute steal. Bankers estimated that Devon could fetch up to $5 billion for these assets; Canadian Natural grabbed them for barely half of that.",
    "Canadian Natural doesn't have the same refining capacity as Suncor, however it has a huge asset base and nice diversity across its operations. At a $27 billion market cap, CNQ stock is also a huge player in Canada. When money comes flowing back into Canadian shares and the energy stocks in particular, CNQ stock should catch a solid bid. In the meantime, it also offers a generous 4.88% dividend yield.",
    "Speaking of unloved Canadian stocks, let's turn our attention to pipeline giant  Enbridge (NYSE: ENB ). Enbridge is right up there with  Kinder Morgan (NYSE: KMI ) among the big midstream energy players. Unlike Kinder Morgan, Enbridge is not as popular with American investors; the company doesn't have the same sort of promotional management style you get from Rich Kinder. Nor has Enbridge made a history of big dividend hikes followed by painful dividend cuts.",
    "By contrast, Enbridge has built a reputation for stability, and has become a Canadian blue chip stock. ENB stock offers a current dividend yield of more than 6.5%. And unlike so many energy stocks, Enbridge offers a rock-solid yield. Even despite the difficult operating environment, the company is still able to grow its cash flow by around 5% per year, paving the way for more dividend increases in the future.",
    "Additionally, with 93% of its customers having investment-grade credit ratings, Enbridge has a quality group of clients using its pipelines and thus is largely insulated from more bankruptcies in the E&P space.",
    "Benjamin Graham, who is widely considered to be the \"father of value investing\" recommended an interesting strategy for profits in beaten down sectors. He said investors should look at the industry and find the biggest firm that has a strong balance sheet. That way, you know that your investment will survive the down cycle and perhaps even benefit as smaller competition goes bust. Then, when the cycle turns upward, you'll be poised to capture huge gains.",
    "With oil services,  Schlumberger (NYSE: SLB ) is that company today. Schlumberger has a long and storied history of shareholder value creation. Its stock soared from a split-adjusted $12 in 1995 to as high as $140 in 2014. Since then, with the plunge in oil prices, SLB stock has gotten hammered as well; it's down 75% to around $32 today.",
    "However, much of Schlumberger's competition has already gone bankrupt or is on life support at this point. Meanwhile, Schlumberger remains the global leader in its field, continues to generate profits even during these hard times, and offers a 6.3% dividend yield. When oil booms again, Schlumberger could make it all the way back to its old high of $140 per share; even this past October, it traded at $62, making the current $32 price quite a discount.",
    "You might be asking what a banking stock like Cullen/Frost Bankers (NYSE: CFR ) is doing on a list of energy stocks to buy. That's a fair question. Cullen/Frost, however, is no ordinary bank. It's focused on the Texas economy and has substantial direct exposure to energy loans.",
    "The San Antonio-based bank, in fact, has all 134 of its branches and more than 1,300 ATMs located within Texas. On every earnings call, management devotes substantial time talking about the health of the Texas economy. Given its reliance on energy companies in Houston and fracking in West Texas, the local economy is heavily levered to oil. As a result, investors absolutely pummeled CFR stock in 2015 and 2016 when oil dropped.",
    "CFR stock plummeted from $80 to $45 during that oil crash. Despite that, Cullen/Frost's loan losses barely went up, and the bank came through unscathed. In fact, it has gone through a ton of obstacles without harm; it was the only major Texas bank to survive that state's massive bust in the 1980s oil collapse. On top of that, Cullen/Frost kept raising the dividend even during the financial crisis which took out so many banks. In 2016, after investors gave up on CFR stock, it soared back from $45 to $120 as oil prices normalized.",
    "However, with energy in retreat again, CFR has plunged back to $80 a share. At just 12x forward earnings, it is trading well below its normal valuation. The stock is also yielding more than 3.5%. It could come flying back up in a hurry - as it did in 2017 - once the tide turns for oil, gas, and the Texas economy.",
    "At the time of this writing, Ian Bezek owned shares of BP, CNQ, XOM, SLB, and ENB. You can reach him on Twitter at @irbezek.",
    "The post 7 Deeply Discounted Energy Stocks to Buy appeared first on InvestorPlace .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 11:27:11"
}