{
  "url": "https://www.nasdaq.com/article/6-reasons-to-add-salisbury-bancorp-stock-in-your-portfolio-cm1206549",
  "title": "6 Reasons to Add Salisbury Bancorp Stock in Your Portfolio - Nasdaq.com",
  "text": [
    "  Salisbury Bancorp SAL  seems to be an attractive pick now on the back of its top-line strength and improving operating backdrop. Further, earnings strength and a strong balance sheet position are tailwinds. These factors, along with its other activities, have secured analysts' confidence, as reflected by 5.2% upward revision in the Zacks Consensus Estimate for current-year earnings over the past 30 days. Thus, the company carries a Zacks Rank #2 (Buy). Also, shares of Salisbury Bancorp have gained 6.4% year to date compared with the industry  's growth of 5.4%.     Factors That Make Salisbury Bancorp an Attractive   Pick   Earnings Growth:  Salisbury Bancorp's recorded an earnings growth rate of 7.5% over the last three to five years. This momentum is likely to continue, as reflected by the company's projected earnings per share growth of 19.9% for 2019 compared with 4.9% for the industry. Also, the company delivered a positive earnings surprise of 6% in the trailing four quarters.  Strong Organic Growth:  Salisbury Bancorp's revenues witnessed a 4.6% compounded annual growth rate over the last three years, ended 2018. The company's projected sales growth rate of 3.1% and 6% for 2019 and 2020, respectively, indicates continued upward momentum in revenues.  Impressive Balance Sheet Growth  : Salisbury Bancorp's loans and deposits have witnessed a CAGR of 9.2% and 8.9%, respectively, over a three-year period (ended 2018). Also, both loan and deposit balances are likely to get support from an improving economy.   Valuation Looks Reasonable:  Salisbury Bancorp has a P/B ratio of 1 compared with the industry average of 1.13. Also, the bank's P/E ratio of 10.66 is below the industry average of 11.12. Based on these ratios, the stock seems undervalued. The stock currently has a Value Score  of A.  Favorable VGM Score  : Salisbury Bancorp has a VGM Score  of B. Our research shows stocks with a VGM Score of A or B, when combined with a Zacks Rank #1 (Strong Buy) or 2, offer the best upside potential.  Strong Leverage:  Salisbury Bancorp's debt/equity ratio is 0.39 compared with the industry average of 0.43. The relatively strong financial health of the company will help it perform better than its peers under an unstable business environment.  Other Stocks to Consider  CNB Financial Corporation's CCNE  Zacks Consensus Estimate for current-year earnings has been revised 2% upward for 2019 in the past 60 days. Also, its share price has increased 15.2% so far this year. The stock carries a Zacks Rank #2. You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   . CB Financial Services, Inc. CBFV  currently carries a Zacks Rank #2. The stock's current-year earnings estimates have been revised 1.9% upward over the past 60 days. Further, the company's shares have jumped 1% year to date. Bridgewater Bancshares' BWB  Zacks Consensus Estimate for current-year earnings has been revised 4% upward over the past 60 days. Moreover, in the past year, its shares have gained 5.5%. Also, it carries a Zacks Rank #2.  Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   CB Financial Services, Inc. (CBFV): Free Stock Analysis Report   CNB Financial Corporation (CCNE): Free Stock Analysis Report   Salisbury Bancorp, Inc. (SAL): Free Stock Analysis Report   Bridgewater Bancshares, Inc. (BWB): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Salisbury Bancorp SAL  seems to be an attractive pick now on the back of its top-line strength and improving operating backdrop. Further, earnings strength and a strong balance sheet position are tailwinds.",
    "These factors, along with its other activities, have secured analysts' confidence, as reflected by 5.2% upward revision in the Zacks Consensus Estimate for current-year earnings over the past 30 days. Thus, the company carries a Zacks Rank #2 (Buy).",
    "Also, shares of Salisbury Bancorp have gained 6.4% year to date compared with the industry  's growth of 5.4%.",
    " Factors That Make Salisbury Bancorp an Attractive   Pick ",
    " Earnings Growth:  Salisbury Bancorp's recorded an earnings growth rate of 7.5% over the last three to five years. This momentum is likely to continue, as reflected by the company's projected earnings per share growth of 19.9% for 2019 compared with 4.9% for the industry.",
    "Also, the company delivered a positive earnings surprise of 6% in the trailing four quarters.",
    " Strong Organic Growth:  Salisbury Bancorp's revenues witnessed a 4.6% compounded annual growth rate over the last three years, ended 2018. The company's projected sales growth rate of 3.1% and 6% for 2019 and 2020, respectively, indicates continued upward momentum in revenues.",
    " Impressive Balance Sheet Growth  : Salisbury Bancorp's loans and deposits have witnessed a CAGR of 9.2% and 8.9%, respectively, over a three-year period (ended 2018). Also, both loan and deposit balances are likely to get support from an improving economy. ",
    " Valuation Looks Reasonable:  Salisbury Bancorp has a P/B ratio of 1 compared with the industry average of 1.13. Also, the bank's P/E ratio of 10.66 is below the industry average of 11.12. Based on these ratios, the stock seems undervalued. The stock currently has a Value Score  of A.",
    " Favorable VGM Score  : Salisbury Bancorp has a VGM Score  of B. Our research shows stocks with a VGM Score of A or B, when combined with a Zacks Rank #1 (Strong Buy) or 2, offer the best upside potential.",
    " Strong Leverage:  Salisbury Bancorp's debt/equity ratio is 0.39 compared with the industry average of 0.43. The relatively strong financial health of the company will help it perform better than its peers under an unstable business environment.",
    " Other Stocks to Consider ",
    "CNB Financial Corporation's CCNE  Zacks Consensus Estimate for current-year earnings has been revised 2% upward for 2019 in the past 60 days. Also, its share price has increased 15.2% so far this year. The stock carries a Zacks Rank #2. You can see  the complete list of today's Zacks #1 Rank (Strong Buy)   stocks here   .",
    "CB Financial Services, Inc. CBFV  currently carries a Zacks Rank #2. The stock's current-year earnings estimates have been revised 1.9% upward over the past 60 days. Further, the company's shares have jumped 1% year to date.",
    "Bridgewater Bancshares' BWB  Zacks Consensus Estimate for current-year earnings has been revised 4% upward over the past 60 days. Moreover, in the past year, its shares have gained 5.5%. Also, it carries a Zacks Rank #2.",
    " Legalizing THIS Could Be Even Bigger than Marijuana  makeArticleAd();  Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.    See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 07:37:00"
}