{
  "url": "https://www.nasdaq.com/article/euro-waits-for-ecb-as-trade-thaw-spurs-yuan-rebound-20190912-00147",
  "title": "Euro waits for ECB as trade thaw spurs yuan rebound - Nasdaq.com",
  "text": [
    "By Tommy Wilkes",
    "LONDON, Sept 12 (Reuters) - The euro hovered near $1.10 on Thursday as traders prepared for the European Central Bank to unveil an expected stimulus package, while China's yuan and Australia's dollar rallied on further signs of a thaw in the U.S.-China trade war.",
    "Investors expect a rate cut at Thursday's meeting as the ECB tries to prop up the region's ailing economy. The real uncertainty is whether policymakers restart a quantitative easing (QE) programme after some ECB members expressed doubt in recent weeks about the need to relaunch asset purchases. ",
    "The ECB decision is scheduled for 1145 GMT, and president Mario Draghi's press conference at 1230 GMT. The meeting is the first in a series of major central bank events, with the Federal Reserve and the Bank of Japan meeting next week. ",
    "SEB strategist Jussi Hiljanen said he expected the ECB to cut the deposit rate by 10 basis points from the current level of -0.4%, extend the forward guidance on rates by six months and announce the restart of QE but with monthly purchases lower than the market anticipated.",
    "\"Such a package of stimulus measures would be a disappointment for the market, pushing long rates higher and EUR/USD higher and steepening the curve,\" Hiljanen said.",
    "The common currency  has shed 3.4% since June but was 0.2% higher at $1.1028 on Thursday.",
    "Stephen Gallo, European Head of FX Strategy at BMO Capital Markets, said that if the ECB prepares the market for significant rate cuts ahead, \"that would be quite dovish, quite bearish\" for the euro.",
    "However, he said the reaction would be contained as traders were reluctant to take positions on the dollar before next week's Fed meeting.",
    "The dollar was slightly lower against a basket of currencies at 98.528 .",
    "RISK RALLY",
    "After a difficult August in which concerns about a global recession sparked a scramble into safer assets, markets have rallied this month, encouraged by easing trade tensions and by receding fears of a no-deal Brexit.",
    "China on Wednesday exempted a basket of U.S. goods from its tariffs, while U.S. President Donald Trump said in a tweet he would delay a scheduled tariff hike by two weeks in October. ",
    "Export-driven currencies across Asia strengthened, as did most emerging market currencies .",
    "The Aussie hit a six-week high of $0.6887  and the offshore Chinese yuan rose 0.5%  to a three-week high of 7.0737 per dollar. ",
    "The Japanese yen, the go-to safe haven currency for fearful investors, fell to a six-week low against the dollar. The yen breached the 108 mark in Asian trade and was last at 107.86 yen per dollar . It had hit a seven-month high of 104.46 last month.",
    "Sterling was little changed , . The pound rocketed to a six-week high against the dollar on Monday as investors welcomed the British parliament's move to block a no-deal Brexit on Oct. 31.",
    "Despite the more positive mood in risk assets this week, analysts expressed caution about its sustainability. ",
    "\"The bigger picture is one of a very tense geopolitical environment that is unlikely to be rectified quickly,\" BMO's Gallo said."
  ],
  "published_datetime": "2019-09-12 05:45:00"
}