{
  "url": "https://www.nasdaq.com/article/global-riskon-mood-lifts-latam-markets-argentine-peso-ends-flat-20190904-01091",
  "title": "Global risk-on mood lifts Latam markets, Argentine peso ends flat - Nasdaq.com",
  "text": [
    "By Sruthi Shankar",
    "Sept 4 (Reuters) - Latin American currencies and stocks rose on Wednesday as cooling political tensions in Hong Kong and Italy prompted inflows into risky assets, helping keep Argentine markets steady after the newly imposed capital controls.",
    "Emerging markets were also helped by British lawmakers approving a law to delay taking Britain out of the European Union without a deal, which brought buyers back to equity markets.",
    "Argentina's peso  closed down 0.07% to 56.02 per dollar after holding largely unchanged through the session as traders said the central bank sold more dollars to support the peso. The currency also gained in black market trading.",
    "Bond rose, while the Merval stock index  rebounded from sharp falls on Tuesday, gaining about 7%.",
    "The markets stabilized even as thousands of protesters took to the streets to demonstrate against the government of President Mauricio Macri as the country reels under a financial crisis. ",
    "\"We expect spot (FX rate) to be stable. More stringent controls will likely be forthcoming if spot comes under further pressure,\" Citi's Dirk Willer wrote in a client note.",
    "The peso, bonds and equities have tumbled since Macri was pummeled in primary elections in August, forcing the government to unveil plans to delay payments on around $100 billion of debts as well as the currency controls.",
    "Brazil's real  jumped 1.5% leading gains among regional currencies, while the Mexican peso  and the Colombian peso  gained 0.9% and 1.4% each as oil prices rallied 4% after upbeat services sector data from China. O/R",
    "Chile's peso  was only marginally higher, underperforming its regional peers after the central bank cut its key interest rate by 50 basis points on Tuesday as inflation levels continue to drag for the world's top copper exporter.",
    "Latin America's top currencies are poised to remain weak in coming months as central banks in Brazil and Mexico keep easing to revive growth, with worries over Argentina's financial condition adding to a softer trend, a Reuters poll showed. ",
    "Sao Paulo-traded stocks  rose over 1%, as higher oil prices boosted shares in state-owned oil firm Petrobras . Brazil'sSenate approved an amended transfer of rights agreement, settling a dispute over pre-salt oil fields between the government and the company. ",
    "Indices in Mexico , Chile  and Colombia , all gained between 0.2% and 0.8%, putting an index of Latin American stocks  on track for its biggest percentage gain since mid-March.",
    "Key Latin American stock indexes and currencies at 1935 GMT:"
  ],
  "published_datetime": "2019-09-04 04:24:00"
}