{
  "url": "https://www.nasdaq.com/article/oil-rises-as-us-china-swap-concessions-in-trade-war-inventories-fall-20190911-00930",
  "title": "Oil rises as U.S., China swap concessions in trade war, inventories fall - Nasdaq.com",
  "text": [
    "TOKYO, Sept 12 (Reuters) - Oil prices jumped on Thursday, bouncing back from heavy losses in the previous session, buoyed by moves to ease trade tensions between Washington and Beijing and a drop in U.S. crude inventories to the lowest in nearly a year.",
    "Brent crude futures  rose 41 cents, or 0.7%, to $61.22 by 0051 GMT, while U.S. West Texas Intermediate (WTI) futures  gained 40 cents, or 0.7%, at $56.16.",
    "The rise came after China moved to exempt some U.S. anti-cancer drugs and other goods from tariffs, while President Donald Trump announced a delay to scheduled tariff hikes on billions of dollars' worth of Chinese goods.",
    "Trump's move is \"a significant goodwill gesture that he too is willing to negotiate to put an end to this trade war spat,\" said Stephen Innes, Asia Pacific market strategist at AxiTrader.",
    "The price upswing on Thursday came after both of the principal global benchmarks fell sharply in the previous following a report that President Trump had weighed easing sanctions on Iran, a move that would potentially boost global crude supply at a time of rising concerns about oil demand.",
    "Boosting the market's good mood, the U.S. Energy Information Administration said on Wednesday that U.S. crude oil stockpiles fell last week to the lowest in nearly a year, as refineries raised output and imports fell. EIA/S",
    "\"Historical inventory patterns suggest that stocks should begin to hit seasonal bottom sometime in the next two-three weeks,\" AxiTrader's Innes said.",
    "Crude inventories  fell for a fourth straight week, decreasing 6.9 million barrels in the week to Sept. 6 -  more than double analysts' expectations of a 2.7 million-barrel drawdown.",
    "At 416.1 million barrels, U.S. crude oil inventories were at their lowest since October 2018, and about 2% below the five-year average for this time of year, the EIA said."
  ],
  "published_datetime": "2019-09-11 09:33:00"
}