{
  "url": "https://www.nasdaq.com/article/catastrophes-set-to-drive-2020-reinsurance-rates-higher-20190903-00817",
  "title": "Catastrophes set to drive 2020 reinsurance rates higher - Nasdaq.com",
  "text": [
    "By Carolyn Cohn and Lena Masri",
    "LONDON, Sept 3 (Reuters) - Big insurance losses from hurricanes, wildfires and other natural disasters over the past two years are set to push reinsurance renewal rates higher in January, ratings agencies said.",
    "After falling for several years due to competition and fewer natural disasters, renewal rates have started to climb in the past couple of years and for 2020 are set to rise on average by as much as 5%.",
    "S&P said rates would likely rise by around 5%, Moody's expected rises of 0-5%, while Fitch predicted 1-2%, in briefings ahead of the reinsurance industry's annual conference in Monte Carlo which begins on Saturday.",
    "Reinsurers such as Swiss Re , Munich Re  and the Lloyd's of London  market help insurers share the risks of disasters in return for part of the premium.",
    "\"It's not a hard market but it's a hardening market, there's more positive momentum,\" Ali Karakuyu, lead analyst at S&P Global, told a media briefing.",
    "Fellow analyst David Masters said the industry was likely to see \"mid-single digit price increases\" as a result.",
    "Insurers are increasingly concerned about the impact of bad weather linked to climate change, with an increase in wildfires in California among the most costly in recent years, something S&P said could see rates there jump 30-70%.",
    "\"This market remains in disarray, which will fuel further rate increases,\" a slide from the S&P presentation said.",
    "Analysts at UBS estimated that the reinsurance industry is in an excess capital position of around $30 billion, but that an estimated $70 billion of natural catastrophe losses in 2019 could erode this excess capital.",
    "Moody's analysts said lines of business that have been performing badly over the last few years, for example due to losses related to hurricanes in the United States, would see price rises in the mid-teens.",
    "Fitch Senior Director Graham Coutts said he expected average rates to rise 1-2%, similar to the increases seen in January 2019, although further rises could be seen depending on the scale of losses from Dorian and other hurricanes."
  ],
  "published_datetime": "2019-09-03 09:49:00"
}