{
  "url": "https://www.nasdaq.com/article/what-to-do-if-you-lose-your-credit-card-cm1210490",
  "title": "What to Do If You Lose Your Credit Card - Nasdaq.com",
  "text": [
    " A missing credit card can put you in a tough spot, especially   when you have no idea what happened to it. What if someone stole it? You want to alert your issuer before   fraudulent charges start piling up and get a replacement ASAP.   But getting a new card could take days. And what if it's merely lost? You could cancel the card   immediately - only to find it minutes later, hiding behind some   couch cushions.makeArticleAd(); Here's what to do when you realize your credit card isn't   where it's supposed to be. First, freeze or lock your card When you're not sure what happened to your card, the best   thing you can do is buy yourself some time to retrace your steps.   That's easy to do if your card gives you the   option to lock or freeze    certain new card transactions remotely from your phone or   computer. Freezing or locking your card generally takes only a   few clicks, and cards can be \"thawed\" or unlocked instantly. In 2015, Discover became the  first major issuer to add   this capability to its credit cards when it debuted a feature   called \"Freeze it.\" The feature \"truly is an on/off switch that our cardmembers   can use through their app or on our website to prevent new   purchases, balance transfers and cash advances if they can't find   their card,\" Laks Vasudevan, vice president of product strategy   for Discover, said via email. Since then, almost every major issuer has introduced similar   card controls. If your card has a feature like this, take   advantage of it. Still missing? Contact your issuer If, after you've locked it, your card is still nowhere to be   found, it's time to alert your issuer. \"Call the credit card company immediately and tell them,\" Chi   Chi Wu, staff attorney for the National Consumer Law Center, said   via email. \"The company will cancel the card and send you a new   one.\" By doing this, you're preventing future unauthorized charges   on the card, Wu notes. Of course, even if fraudulent charges are   made, you generally won't be liable for them. Federal law sharply   limits your liability for fraudulent credit card purchases on   lost or stolen cards, and credit card networks' zero-liability   policies generally mean   you won't be liable    for any amount. But it's best to prevent fraudulent charges in   the first place, Wu says. Remember that after replacing your card, you'll no longer be   able to use your old card number to make purchases or other   transactions, even if you find it later. You'll also have to   update any payment information for the recurring charges linked   to your old card number. Generally, such a replacement will not   affect your credit score, since the new card number will be   associated with the same account. Stolen? File a police report Say you're certain a thief stole your credit card - or even   swiped your whole wallet. Calling your issuers to report the   theft is a good start, but it's not the only thing you should   do. In cases of stolen credit cards, \"One step you don't really   see people taking, and they really should be taking, is filing a   police report,\" says Kyle Marchini, senior analyst for fraud   management at Javelin Strategy & Research, a research-based   advisory firm. He notes it's doubly important to file such a report if your   driver's license was stolen, too, since it includes information   that could be used for financial fraud or criminal impersonation.   Reporting the theft could help the police gather information and   potentially recognize patterns of similar criminal activity,   Marchini notes. To file a police report, call your local police department. Be   prepared to provide information about where and when the theft   happened and which items were stolen. How to keep your cards close Sometimes, credit cards go missing for reasons beyond your   control. But if you regularly have trouble keeping track of your   plastic, making these small changes could help. Give your card a home When you're done using a card, make a habit of putting it back   in the same place every time - say, your wallet - rather than   just pocketing it, setting it on a nightstand or letting it fly   solo in your purse. Take a wallet inventory Marchini recommends making a list of all the cards in your   wallet. \"It makes it that much easier if your wallet does go   missing or is stolen,\" he says. \"You know who you should be   getting in contact with.\" Download your credit card issuer's app Set this up now so you'll be able to lock or freeze your card   quickly in case it ever goes missing again. While you're at it,   turn on   push notifications to notify you about your card   spending    , too, so you can spot fishy charges right away.  This article was written by NerdWallet and was originally     published by     Forbes      .  The article What to Do If You Lose Your Credit Card originally   appeared on NerdWallet. ",
    "A missing credit card can put you in a tough spot, especially   when you have no idea what happened to it.",
    "What if someone stole it? You want to alert your issuer before   fraudulent charges start piling up and get a replacement ASAP.   But getting a new card could take days.",
    "And what if it's merely lost? You could cancel the card   immediately - only to find it minutes later, hiding behind some   couch cushions.",
    "Here's what to do when you realize your credit card isn't   where it's supposed to be.",
    "When you're not sure what happened to your card, the best   thing you can do is buy yourself some time to retrace your steps.   That's easy to do if your card gives you the   option to lock or freeze    certain new card transactions remotely from your phone or   computer. Freezing or locking your card generally takes only a   few clicks, and cards can be \"thawed\" or unlocked instantly.",
    "In 2015, Discover became the  first major issuer to add   this capability to its credit cards when it debuted a feature   called \"Freeze it.\"",
    "The feature \"truly is an on/off switch that our cardmembers   can use through their app or on our website to prevent new   purchases, balance transfers and cash advances if they can't find   their card,\" Laks Vasudevan, vice president of product strategy   for Discover, said via email.",
    "Since then, almost every major issuer has introduced similar   card controls. If your card has a feature like this, take   advantage of it.",
    "If, after you've locked it, your card is still nowhere to be   found, it's time to alert your issuer.",
    "\"Call the credit card company immediately and tell them,\" Chi   Chi Wu, staff attorney for the National Consumer Law Center, said   via email. \"The company will cancel the card and send you a new   one.\"",
    "By doing this, you're preventing future unauthorized charges   on the card, Wu notes. Of course, even if fraudulent charges are   made, you generally won't be liable for them. Federal law sharply   limits your liability for fraudulent credit card purchases on   lost or stolen cards, and credit card networks' zero-liability   policies generally mean   you won't be liable    for any amount. But it's best to prevent fraudulent charges in   the first place, Wu says.",
    "Remember that after replacing your card, you'll no longer be   able to use your old card number to make purchases or other   transactions, even if you find it later. You'll also have to   update any payment information for the recurring charges linked   to your old card number. Generally, such a replacement will not   affect your credit score, since the new card number will be   associated with the same account.",
    "Say you're certain a thief stole your credit card - or even   swiped your whole wallet. Calling your issuers to report the   theft is a good start, but it's not the only thing you should   do.",
    "In cases of stolen credit cards, \"One step you don't really   see people taking, and they really should be taking, is filing a   police report,\" says Kyle Marchini, senior analyst for fraud   management at Javelin Strategy & Research, a research-based   advisory firm.",
    "He notes it's doubly important to file such a report if your   driver's license was stolen, too, since it includes information   that could be used for financial fraud or criminal impersonation.   Reporting the theft could help the police gather information and   potentially recognize patterns of similar criminal activity,   Marchini notes.",
    "To file a police report, call your local police department. Be   prepared to provide information about where and when the theft   happened and which items were stolen.",
    "Sometimes, credit cards go missing for reasons beyond your   control. But if you regularly have trouble keeping track of your   plastic, making these small changes could help.",
    "When you're done using a card, make a habit of putting it back   in the same place every time - say, your wallet - rather than   just pocketing it, setting it on a nightstand or letting it fly   solo in your purse.",
    "Marchini recommends making a list of all the cards in your   wallet. \"It makes it that much easier if your wallet does go   missing or is stolen,\" he says. \"You know who you should be   getting in contact with.\"",
    "Set this up now so you'll be able to lock or freeze your card   quickly in case it ever goes missing again. While you're at it,   turn on   push notifications to notify you about your card   spending    , too, so you can spot fishy charges right away.",
    " This article was written by NerdWallet and was originally     published by     Forbes      . ",
    "The article What to Do If You Lose Your Credit Card originally   appeared on NerdWallet.",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 11:35:05"
}