{
  "url": "https://www.nasdaq.com/article/job-openings-are-near-all-time-highs-wages-are-up-cm1206803",
  "title": "Job Openings Are Near All-Time Highs, Wages Are Up - Nasdaq.com",
  "text": [
    "Job openings in August climbed by 3.2% year over year to 5.94 million, according to Glassdoor's latest Job Market Report . That's just below July's all-time high of 6 million openings listed on the jobs website.",
    "With so many companies needing to fill open positions, pay rates  last month also rose by 1.9% to a median rate of $53,950 a year. \"That's in line with the rate of growth seen over the last three months, but is still below the 2.6% average pay growth we saw in the second half of 2018,\" wrote Glassdoor's Daniel Zhao in a press release. \"Pay growth has been stubbornly low in 2019, and we don't yet see any signs of faster acceleration consistent with full employment.\"",
    "Job openings are nearing record levels. Image source: Getty Images.",
    "Boston had the fastest rate of job growth at 8.5%, driven by the diversity of industries within the city.",
    "San Francisco had the highest rate of pay growth at 3.2%, continuing a 13-month streak. But job openings in the city actually fell by 0.1% \"driven partially by a pullback in hiring in the tech industry, but the decline was also seen across many industries in the local economy,\" according to Glassdoor. Here are the job openings and pay across 10 major metropolitan areas.",
    "Data source: Glasssdoor. YOY = year over year.",
    "Even though there are some fears of a recession, American consumer sentiment remains near generational highs. That has driven hiring in service industries as well as beauty and fitness, \"a smaller industry that relies heavily on consumer spending,\" Zhao noted.",
    "Data source: Glassdoor.",
    "While the demand for workers has been strong, pay growth has not climbed to reflect that. Some fields, however, have done better than others, with a shortage of workers causing companies to be willing to pay more to fill openings.",
    "Data source: Glassdoor.",
    "It's worth noting that except for field engineer and truck driver, all the jobs with the fastest rates of wage growth pay below the $53,950 median for all jobs. That suggests that employers are having a hard time filling lower-paying jobs, forcing them to raise wages.",
    "If openings continue to climb, wages should rise at least in fields where a lack of employees will hit a company's bottom line. That hasn't happened across the board yet, as companies have been slow to raise wages. But at some point -- as we see on the list above -- the need to fill positions should make companies pay more for at least some jobs.",
    "The $16,728 Social Security bonus most retirees completely overlook\r\n If you're like most Americans, you're a few years (or more) behind on your retirement savings. But a handful of little-known \"Social Security secrets\" could help ensure a boost in your retirement income. For example: one easy trick could pay you as much as $16,728 more... each year! Once you learn how to maximize your Social Security benefits, we think you could retire confidently with the peace of mind we're all after. Simply click here to discover how to learn more about these strategies .",
    "The Motley Fool has a disclosure policy .",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:06:00"
}