{
  "url": "https://www.nasdaq.com/article/in-subtle-differences-hints-of-robust-fed-ratecut-debate-20190904-00884",
  "title": "In subtle differences, hints of robust Fed rate-cut debate - Nasdaq.com",
  "text": [
    "By Jonnelle Marte, Richard Leong and Nichola Saminather",
    "NEW YORK/TORONTO, Sept 4 (Reuters) - Slowing global economies, the escalating trade war between Washington and Beijing and a warning sign of recession flashing in the U.S. Treasury market have all fed expectations the Federal Reserve is poised to lower rates at the close of its Sept. 17-18 meeting.",
    "But sentiment is much less well-defined within the Fed over whether to reduce borrowing costs for the second time this year, and if so by how much.",
    "John Williams, president of the hugely influential New York Federal Reserve, said on Wednesday consumer spending is \"robust\" and one reason the U.S. economy is in a \"favorable\" place.\"",
    "Still, after his prepared remarks he told reporters: \"I don't see consumer spending really continuing to grow faster into the future like it has been.\"",
    "Household spending accounts for about 70% of the U.S. economy and surged last quarter despite a drop in business investment.",
    "The Fed, he said, is ready to \"act as appropriate\" to help America avoid an economic downturn, echoing closely language used by Fed Chair Jerome Powell used last month which fed expectations of another quarter-point interest-rate cut in September. ",
    "But Williams also told reporters he expects the economy to grow at an above-trend pace of 2.0%-2.5% in 2019.",
    "\"Doesn't sound like someone ready to ease 50 basis points. Or at all,\" quipped Northern Trust economist Carl Tannenbaum on Twitter.",
    "Boston Fed President Eric Rosengren, who in July opposed the first Fed rate cut since 2008, said on Tuesday there is no reason to cut rates as long as the economy keeps growing at around 2%. ",
    "An hour after Williams spoke, Dallas Federal Reserve Bank President Robert Kaplan said in Toronto, Canada, that the U.S. economy was \"mixed\" and he was focused on whether consumer spending, the strongest part of the world's biggest economy, will be hit by trade uncertainty that last month drove a decline in domestic manufacturing.",
    "Kaplan said he has lowered his growth outlook for the year and could do so again. Fed officials will submit fresh economic forecasts and views on appropriate rates just ahead of their Sept. 17-18 meeting.",
    "\"My own view is I'm going to assess the data leading right up to the meeting, and make a judgment on what the appropriate action, if any, would be for us to take,\" he told reporters. If the Fed waits to see weakness in consumer spending, he said, \"that's probably too late.\"",
    "He said he is looking at factors including the fact that the Fed's 2% to 2.25% target range for the benchmark fed funds rate is above yields of even the longest-dated U.S. Treasuries, setting the stage for possible distortions.",
    "On Tuesday, St. Louis Fed President James Bullard cited that disconnect as one reason he is proposing a half-percentage-point rate cut at the Fed's September meeting.",
    "Minneapolis Fed President Neel Kashkari, in a separate talk Wednesday, called the inverted yield curve \"the most concerning signal\" because it flags investor worries about a recession, which can be self-fulfilling if businesses and households begin to limit purchases based on those concerns.",
    "\"If business investment continues to slump, if the recession warning lights continue to flash, I think the Federal Reserve will need to do what we can to try to keep the economy moving,\" Kashkari said.",
    "The Fed's beige book, a collection of anecdotes from the 12 regional Fed banks published ahead of each policy meeting, on Wednesday underscored the widely shared view at the Fed that trade tensions are slowing businesses, and showed some signs that consumers may be starting to feel the pinch.",
    "In the St. Louis district, which covers a swath of the Midwest and South, \"reports from general retailers and auto dealers indicate consumer activity has been mixed since our previous report.\" The Minneapolis district reported that consumer spending was flat, while the Atlanta district noted that consumer loan growth declined.",
    "Still, the report was mixed, with San Francisco reporting a notable increase in sales of retail goods, and Boston reporting a \"largely positive\" retail outlook."
  ],
  "published_datetime": "2019-09-04 12:46:00"
}