{
  "url": "https://www.nasdaq.com/article/why-healthequity-is-sinking-today-cm1207373",
  "title": "Why HealthEquity Is Sinking Today - Nasdaq.com",
  "text": [
    " What happened Despite its posting better-than-expected fiscal 2020   second-quarter results, shares of   HealthEquity    (NASDAQ: HQY) , a leading provider of managed healthcare   accounts, dropped as much as 12% in early-morning trading on   Wednesday. The stock was down about 9% as of 10:55 a.m. EST. So what The headline numbers from the company's fiscal second quarter   looked quite good:  Revenue jumped 22% to $86.6 million. That was ahead of the     $85 million in revenue that Wall Street had expected. HSA membership grew 16% to 4.2 million. Custodial assets under management grew 21% to $8.5     billion. Gross margin jumped 200 basis points to 67.5%. Net income reported under generally accepted accounting     principles (     GAAP      ) dropped 14% to $19.4 million, or $0.30 per share. Non-GAAP net income was $29.4 million, or $0.45 per share.     That was much higher than the $0.35 that Wall Street had     expected. HealthEquity closed its     acquisition of WageWorks       on August 30th. The \"new HealthEquity\" is now the largest     HSA administrator by accounts in the country.    Image source: Getty Images.makeArticleAd();  However, management also let investors know that its expenses   were going to remain elevated as it works to integrated WageWorks   and service the new $1.25 billion in debt it recently floated to   pay for the acquisition. In response, here's the guidance being   shared with investors for fiscal 2020:  Revenue is now expected to land between $341 million and     $347 million. That's up from its prior guidance range of $333     million to $339 million. The midpoint of this range is also     above the $343.3 million that Wall Street was expecting. WageWorks is projected to contribute another $170 million     to $175 million in total revenue. Non-GAAP net income is now projected to land between $76     million and $80 million, or $1.10 to $1.16 per share. That's     lower than its prior range of $83 million to $87 million, or     $1.28 to $1.31 per share. The midpoint is also far below the     $1.33 that market watchers were looking for.  Traders are selling off the stock today in response to the   mixed guidance. Now what There are both positive and negative takeaways for investors   in this report. The good news is that HealthEquity's legacy business continues   to grow rapidly in spite of distraction from the WageWorks   acquisition. The focus on growing custodial revenue is also   allowing its gross margin to rise. The bad news is that management's decision to invest heavily   in the WageWorks acquisition is going to take a near-term toll on   profitability. The formerly pristine balance sheet is also now   about to be saddled with $1.25 billion in debt. Acquisitions are notoriously tricky to pull off, and it can   take a long time for the benefits to be realized, so it is   understandable that Wall Street has knocked down HealthEquity's   stock to a fresh 52-week low. After all, it wasn't all that long   ago that HealthEquity was considered an   ultra-high-growth business    and traded at a significant premium to the market. Only time will tell if management will be able to successfully   integrate WageWorks and return the business to its days of   turbocharged profit growth. Long-term shareholders have no choice   but to remain patient and hope for the best.   10 stocks we like better than HealthEquity       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HealthEquity wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019        Brian Feroldi      owns shares of HealthEquity. The Motley Fool owns shares of and     recommends HealthEquity. The Motley Fool has a     disclosure policy      .  ",
    "Despite its posting better-than-expected fiscal 2020   second-quarter results, shares of   HealthEquity    (NASDAQ: HQY) , a leading provider of managed healthcare   accounts, dropped as much as 12% in early-morning trading on   Wednesday. The stock was down about 9% as of 10:55 a.m. EST.",
    "The headline numbers from the company's fiscal second quarter   looked quite good:",
    "  Image source: Getty Images.makeArticleAd(); ",
    "Image source: Getty Images.",
    "However, management also let investors know that its expenses   were going to remain elevated as it works to integrated WageWorks   and service the new $1.25 billion in debt it recently floated to   pay for the acquisition. In response, here's the guidance being   shared with investors for fiscal 2020:",
    "Traders are selling off the stock today in response to the   mixed guidance.",
    "There are both positive and negative takeaways for investors   in this report.",
    "The good news is that HealthEquity's legacy business continues   to grow rapidly in spite of distraction from the WageWorks   acquisition. The focus on growing custodial revenue is also   allowing its gross margin to rise.",
    "The bad news is that management's decision to invest heavily   in the WageWorks acquisition is going to take a near-term toll on   profitability. The formerly pristine balance sheet is also now   about to be saddled with $1.25 billion in debt.",
    "Acquisitions are notoriously tricky to pull off, and it can   take a long time for the benefits to be realized, so it is   understandable that Wall Street has knocked down HealthEquity's   stock to a fresh 52-week low. After all, it wasn't all that long   ago that HealthEquity was considered an   ultra-high-growth business    and traded at a significant premium to the market.",
    "Only time will tell if management will be able to successfully   integrate WageWorks and return the business to its days of   turbocharged profit growth. Long-term shareholders have no choice   but to remain patient and hope for the best.",
    "  10 stocks we like better than HealthEquity       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.* David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HealthEquity wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.  See the 10 stocks      *Stock Advisor returns as of June 1, 2019     ",
    " 10 stocks we like better than HealthEquity       When investing geniuses David and Tom Gardner have a stock tip,     it can pay to listen. After all, the newsletter they have run     for over a decade,     Motley Fool Stock Advisor      , has quadrupled the market.*",
    "David and Tom just revealed what they believe are the     ten best stocks      for investors to buy right now... and HealthEquity wasn't one     of them! That's right -- they think these 10 stocks are even     better buys.",
    " See the 10 stocks ",
    "  *Stock Advisor returns as of June 1, 2019  ",
    "  Brian Feroldi      owns shares of HealthEquity. The Motley Fool owns shares of and     recommends HealthEquity. The Motley Fool has a     disclosure policy      . ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 11:16:00"
}