{
  "url": "https://www.nasdaq.com/article/cnh-industrials-spin-off-of-iveco-truck-unit-to-unlock-value-cm1207291",
  "title": "CNH Industrial's Spin-Off of IVECO Truck Unit to Unlock Value - Nasdaq.com",
  "text": [
    " As part of the five-year plan to boost profits, CNH Industrial N.V. CNHI  is set to separate the IVECO truck business from the agriculture and construction business, thereby creating two distinct world-leading businesses. Subject to certain precedent conditions, the industrial vehicle maker intends to complete the revamp by 2021, forming two independent publicly-listed companies in a bid to rev up asset values and optimize portfolio.  Details of the Spin-Off  Following a comprehensive portfolio review, CNH Industrial will split its business into two units - 'On Highway' and 'Off-Highway' businesses. The 'Off-Highway' assets, which contributed around $15.6 billion to 2018 pro-forma combined revenues, will comprise agricultural and construction business along with specialty vehicles. The agricultural equipment division, including the profitable tractors business, will generate around 75% of revenues. The construction equipment and special vehicles divisions will likely account for 19% and 6% of revenues, respectively. The 'On-Highway' assets, which represented 2018 pro-forma combined revenues of around $13.1 billion, will include Iveco, Iveco Bus and Heuliez Bus commercial vehicle brands (accounting for around 69% of revenues). The unit will also include the FPT Industrial powertrain business (roughly 31% revenues). The strategic spin-off holds the promise of unlocking significant value by maximizing focus, optimizing costs and delivering synergies. The creation of two separate entities will allow both of them to pursue great opportunities in their respective market segments and better serve the needs of both investor groups.  Spin-Off Forms Part of the Ambitious Five-Year   Plan  The company's decision to hive off the Iveco brand and powertrain business into a separate company is part of its new five-year 2020-2024 business plan, Transform 2 Win. Per the plan, the company aims at operational efficiency through targeted restructuring efforts in order to enhance profits and streamline business. It expects full implementation of the plan by the end of 2022. However, the company is likely to incur within $450-$500 million in restructuring charges in the said period. CNH Industrial aims to invest around $13 billion in product development over the course of the five-year plan and expects earnings per share to increase from the current level of $0.86 to $2 by 2024. Adjusted EBIT margins are projected to more than double from the current level to 10% by 2024.  Final Thoughts  While upgraded product offerings and digitalization initiatives are aiding the Zacks Rank #3 (Hold) company to achieve new business contracts, CNH Industrial is bearing the brunt of high capital spending, rising costs and tariff headwinds, which are denting profits. You can see   the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  .  The spin-off is likely to unlock immense value for its shareholders and accelerate the pursuit of respective business goals, empowering them to reach their fullest potential in the long term. However, high product development investment, as part of the five-year plan, and restructuring expenses may clip margins. Following the announcement of the spin-off, shares of CNH Industrial scaled down 2.73% to close at $9.98 yesterday. Notably, its decision to split its business into two listed entities comes six years after Fiat Chrysler FCAU  spun off the trucks and tractor maker to unlock shareholder value, and stimulate growth and margins. Further, Fiat's spinoff of the supercar brand Ferrari RACE  in 2016 had created significant windfalls for the former. Volkswagen VWAGY  also followed Fiat's footstep to spin off its truck brands, MAN and Scania, which began trading as Traton Group a few months back.  Biggest Tech Breakthrough in a Generation  Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity. A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.   See 7 breakthrough stocks now>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Fiat Chrysler Automobiles N.V. (FCAU): Free Stock Analysis Report   CNH Industrial N.V. (CNHI): Free Stock Analysis Report   Ferrari N.V. (RACE): Free Stock Analysis Report   Volkswagen AG (VWAGY): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    "As part of the five-year plan to boost profits, CNH Industrial N.V. CNHI  is set to separate the IVECO truck business from the agriculture and construction business, thereby creating two distinct world-leading businesses. Subject to certain precedent conditions, the industrial vehicle maker intends to complete the revamp by 2021, forming two independent publicly-listed companies in a bid to rev up asset values and optimize portfolio.",
    " Details of the Spin-Off ",
    "Following a comprehensive portfolio review, CNH Industrial will split its business into two units - 'On Highway' and 'Off-Highway' businesses.",
    "The 'Off-Highway' assets, which contributed around $15.6 billion to 2018 pro-forma combined revenues, will comprise agricultural and construction business along with specialty vehicles. The agricultural equipment division, including the profitable tractors business, will generate around 75% of revenues. The construction equipment and special vehicles divisions will likely account for 19% and 6% of revenues, respectively.",
    "The 'On-Highway' assets, which represented 2018 pro-forma combined revenues of around $13.1 billion, will include Iveco, Iveco Bus and Heuliez Bus commercial vehicle brands (accounting for around 69% of revenues). The unit will also include the FPT Industrial powertrain business (roughly 31% revenues).",
    "The strategic spin-off holds the promise of unlocking significant value by maximizing focus, optimizing costs and delivering synergies. The creation of two separate entities will allow both of them to pursue great opportunities in their respective market segments and better serve the needs of both investor groups.",
    " Spin-Off Forms Part of the Ambitious Five-Year   Plan ",
    "The company's decision to hive off the Iveco brand and powertrain business into a separate company is part of its new five-year 2020-2024 business plan, Transform 2 Win. Per the plan, the company aims at operational efficiency through targeted restructuring efforts in order to enhance profits and streamline business. It expects full implementation of the plan by the end of 2022. However, the company is likely to incur within $450-$500 million in restructuring charges in the said period.",
    "CNH Industrial aims to invest around $13 billion in product development over the course of the five-year plan and expects earnings per share to increase from the current level of $0.86 to $2 by 2024. Adjusted EBIT margins are projected to more than double from the current level to 10% by 2024.",
    " Final Thoughts ",
    "While upgraded product offerings and digitalization initiatives are aiding the Zacks Rank #3 (Hold) company to achieve new business contracts, CNH Industrial is bearing the brunt of high capital spending, rising costs and tariff headwinds, which are denting profits. You can see   the complete list of today's Zacks #1 Rank (Strong Buy) stocks here  . ",
    "The spin-off is likely to unlock immense value for its shareholders and accelerate the pursuit of respective business goals, empowering them to reach their fullest potential in the long term. However, high product development investment, as part of the five-year plan, and restructuring expenses may clip margins. Following the announcement of the spin-off, shares of CNH Industrial scaled down 2.73% to close at $9.98 yesterday.",
    "Notably, its decision to split its business into two listed entities comes six years after Fiat Chrysler FCAU  spun off the trucks and tractor maker to unlock shareholder value, and stimulate growth and margins. Further, Fiat's spinoff of the supercar brand Ferrari RACE  in 2016 had created significant windfalls for the former. Volkswagen VWAGY  also followed Fiat's footstep to spin off its truck brands, MAN and Scania, which began trading as Traton Group a few months back.",
    " Biggest Tech Breakthrough in a Generation ",
    "Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it's expected to create 22 million jobs and generate $12.3 trillion in activity.",
    "A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks' just-released special report reveals 7 stocks to watch. The report is only available for a limited time.",
    "  See 7 breakthrough stocks now>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-04 10:15:00"
}