{
  "url": "https://www.nasdaq.com/article/baidu-bidu-invests-200m-in-neusoft-expands-ai-presence-cm1210574",
  "title": "Baidu (BIDU) Invests $200M in Neusoft, Expands AI Presence - Nasdaq.com",
  "text": [
    "  Baidu, Inc. BIDU  is leaving no stone unturned to bolster presence in the artificial intelligence (AI) space. Reportedly, the ever-growing Chinese internet company plans to invest 1.44 billion yuan ($200 million) in an investment firm, Neusoft Holdings Co. Ltd. Founded in 2011, Neusoft is an investment company focused on AI, cloud computing and big data services in those areas. Though much details of the transaction have not yet been revealed, Baidu plans to work together in important growth areas namely smart cities, education services and healthcare. Per the deal, Baidu's chief technology officer Wang Haifeng will join the board of Neusoft. Baidu's strategic motive behind the deal is to strengthen presence in AI and the cloud computing business.  Baidu, Inc. Price and Consensus           Baidu, Inc. price-consensus-chart    |   Baidu, Inc. Quote    Baidu's Continuous Efforts in AI Space  Baidu has been making continuous investments in companies affiliated with Neusoft Holdings. In March, Baidu invested 22.5 million yuan in its subsidiary Neusoft Medical Systems, a provider of medical equipment manufacturer and cloud solutions. In June, Baidu partnered with Neusoft Group, a software unit of Neusoft Holdings, to develop AI technologies in healthcare and city management. Baidu also invested in other companies to in a bid to ramp up its AI efforts. Just last month, Baidu teamed up with Chongqing team to accelerate the latter's intelligent development of the municipality. The recent deal is a win-win situation for both the companies. The partnership will help the companies in developing new products and strengthening their AI capabilities in growing areas.  Bottom Line  AI techniques have gained immense traction over the past couple of years due to massive demand for analyzing unstructured data such as tweets, social-media posts, photos and videos across different industries. This partnership underscores Baidu's growing interest in this highly promising space. It appears that the company is flexing its muscles in this space to leverage the concept of consumer convenience, in a bid to impress both customers and investors.  Zacks Rank and Stocks to Consider  Baidu currently carries a Zacks Rank #3 (Hold). Some better-ranked stocks in the broader technology sector include Alphabet Inc. GOOGL  , Itron, Inc. ITRI  and MACOM Technology Solutions Holdings, Inc. MTSI  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   . Long-term earnings growth for Alphabet, Itron and MACOM Technology is currently projected at 17.5%, 25% and 15%, respectively.  Looking for Stocks with Skyrocketing Upside?  Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.      Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.     See the pot trades we're targeting>>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report makeArticleAd();  Baidu, Inc. (BIDU): Free Stock Analysis Report   Alphabet Inc. (GOOGL): Free Stock Analysis Report   MACOM Technology Solutions Holdings, Inc. (MTSI): Free Stock Analysis Report   Itron, Inc. (ITRI): Free Stock Analysis Report   To read this article on Zacks.com click here.   Zacks Investment Research ",
    " Baidu, Inc. BIDU  is leaving no stone unturned to bolster presence in the artificial intelligence (AI) space.",
    "Reportedly, the ever-growing Chinese internet company plans to invest 1.44 billion yuan ($200 million) in an investment firm, Neusoft Holdings Co. Ltd.",
    "Founded in 2011, Neusoft is an investment company focused on AI, cloud computing and big data services in those areas.",
    "Though much details of the transaction have not yet been revealed, Baidu plans to work together in important growth areas namely smart cities, education services and healthcare. Per the deal, Baidu's chief technology officer Wang Haifeng will join the board of Neusoft.",
    "Baidu's strategic motive behind the deal is to strengthen presence in AI and the cloud computing business.",
    " Baidu, Inc. Price and Consensus ",
    "         Baidu, Inc. price-consensus-chart    |   Baidu, Inc. Quote  ",
    " Baidu, Inc. price-consensus-chart    |   Baidu, Inc. Quote ",
    " Baidu's Continuous Efforts in AI Space ",
    "Baidu has been making continuous investments in companies affiliated with Neusoft Holdings.",
    "In March, Baidu invested 22.5 million yuan in its subsidiary Neusoft Medical Systems, a provider of medical equipment manufacturer and cloud solutions. In June, Baidu partnered with Neusoft Group, a software unit of Neusoft Holdings, to develop AI technologies in healthcare and city management.",
    "Baidu also invested in other companies to in a bid to ramp up its AI efforts. Just last month, Baidu teamed up with Chongqing team to accelerate the latter's intelligent development of the municipality.",
    "The recent deal is a win-win situation for both the companies. The partnership will help the companies in developing new products and strengthening their AI capabilities in growing areas.",
    " Bottom Line ",
    "AI techniques have gained immense traction over the past couple of years due to massive demand for analyzing unstructured data such as tweets, social-media posts, photos and videos across different industries.",
    "This partnership underscores Baidu's growing interest in this highly promising space. It appears that the company is flexing its muscles in this space to leverage the concept of consumer convenience, in a bid to impress both customers and investors.",
    " Zacks Rank and Stocks to Consider ",
    "Baidu currently carries a Zacks Rank #3 (Hold). Some better-ranked stocks in the broader technology sector include Alphabet Inc. GOOGL  , Itron, Inc. ITRI  and MACOM Technology Solutions Holdings, Inc. MTSI  , each carrying a Zacks Rank #2 (Buy). You can see  the complete list of today's Zacks #1 Rank   (Strong Buy) stocks here   .",
    "Long-term earnings growth for Alphabet, Itron and MACOM Technology is currently projected at 17.5%, 25% and 15%, respectively.",
    " Looking for Stocks with Skyrocketing Upside? ",
    "Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.     ",
    "Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.  ",
    "  See the pot trades we're targeting>>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-11 10:18:00"
}