{
  "url": "https://www.nasdaq.com/article/low-store-traffic-likely-to-mar-kirklands-kirk-q2-earnings-cm1206582",
  "title": "Low Store Traffic Likely to Mar Kirkland's (KIRK) Q2 Earnings - Nasdaq.com",
  "text": [
    "  Kirkland's, Inc. KIRK  is slated to release second-quarter fiscal 2019 results on Sep 5, before market open. This home products retailer has lagged earnings estimates in three out of the trailing four quarters, the average negative surprise being 9.4%. Let's see what's in store for the company in the quarter to be reported.  makeArticleAd(); Estimates Look Dull    The Zacks Consensus Estimate for second-quarter earnings is pegged at a loss of 71 cents, which suggests deterioration from a loss of 40 cents delivered in the year-ago quarter. The consensus mark has remained unchanged in the past 30 days.    For revenues, the Zacks Consensus Estimate stands at $126.6 million that indicates a decline of almost 5.4% from the year-ago quarter's figure.  Kirkland's, Inc. Price, Consensus and EPS   Surprise           Kirkland's, Inc.   price-consensus-eps-surprise-chart    |   Kirkland's, Inc. Quote      What's Likely to Impede Q2 Performance?    Kirkland's is facing adverse impacts from low traffic in its brick-and-mortar stores as more customers are resorting to online buying. This has been weighing on the company's comparable store sales (comps) as witnessed in the first quarter. In fact, management expects sales in the first half of fiscal 2019 to be challenged by weakness in brick-and-mortar traffic and core assortments. For this period, it expects comps to decline in the low-to-mid single digit range. Persistent sluggishness in comps is likely to hurt the company's top- and the bottom-line performances in the to-be-reported quarter.    Weak gross margin rates have also been a hurdle for Kirkland's. The metric is under pressure from headwinds like lower merchandise margins as well as higher store occupancy and central distribution costs. Moreover, the decline in merchandise margins is being triggered by inbound freight costs and a decline in product margins. Softness in gross margin remains a considerable threat to the bottom line in the second quarter. Apart from these, management is cautious about any adverse impacts stemming from additional tariffs.    Although such adversities are likely to impede the company's second-quarter results, we expect it to gain some respite from growth in e-commerce as well as increased efficiency in merchandising, branding and product designing capabilities.   What Does the Zacks Model Predict?    Our proven model doesn't show that Kirkland can beat bottom-line estimates in the to-be-reported quarter. For this to happen, a stock needs to have a positive Earnings ESP  and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold).    Although Kirkland's carries a Zacks Rank #3, its Earnings ESP of 0.00% makes us less confident about an earnings surprise. You can uncover the best stocks to buy or sell before they're reported with our  Earnings ESP Filter  .   Stocks Poised to Beat Estimates    Here are a few companies you may want to consider as our model shows that they have the right combination of elements to beat on earnings.    Burlington Stores BURL  has an Earnings ESP of +4.14% and a Zacks Rank #2. You can see   the complete list of today's Zacks #1 Rank stocks   here   .    Dollar General DG  has an Earnings ESP of +0.37% and a Zacks Rank #3.    Costco COST  has an Earnings ESP of +0.62% and a Zacks Rank #3.   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.   See these 5 \"sin stocks\" now >>     Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report   Dollar General Corporation (DG): Free Stock Analysis Report   Burlington Stores, Inc. (BURL): Free Stock Analysis Report   Costco Wholesale Corporation (COST): Free Stock Analysis Report   Kirkland's, Inc. (KIRK): Free Stock Analysis Report   To read this article on Zacks.com click here. ",
    " Kirkland's, Inc. KIRK  is slated to release second-quarter fiscal 2019 results on Sep 5, before market open. This home products retailer has lagged earnings estimates in three out of the trailing four quarters, the average negative surprise being 9.4%. Let's see what's in store for the company in the quarter to be reported.  makeArticleAd(); Estimates Look Dull    The Zacks Consensus Estimate for second-quarter earnings is pegged at a loss of 71 cents, which suggests deterioration from a loss of 40 cents delivered in the year-ago quarter. The consensus mark has remained unchanged in the past 30 days.    For revenues, the Zacks Consensus Estimate stands at $126.6 million that indicates a decline of almost 5.4% from the year-ago quarter's figure.",
    " Kirkland's, Inc. Price, Consensus and EPS   Surprise ",
    "       Kirkland's, Inc.   price-consensus-eps-surprise-chart    |   Kirkland's, Inc. Quote  ",
    " Kirkland's, Inc.   price-consensus-eps-surprise-chart    |   Kirkland's, Inc. Quote ",
    " What's Likely to Impede Q2 Performance?    Kirkland's is facing adverse impacts from low traffic in its brick-and-mortar stores as more customers are resorting to online buying. This has been weighing on the company's comparable store sales (comps) as witnessed in the first quarter. In fact, management expects sales in the first half of fiscal 2019 to be challenged by weakness in brick-and-mortar traffic and core assortments. For this period, it expects comps to decline in the low-to-mid single digit range. Persistent sluggishness in comps is likely to hurt the company's top- and the bottom-line performances in the to-be-reported quarter.    Weak gross margin rates have also been a hurdle for Kirkland's. The metric is under pressure from headwinds like lower merchandise margins as well as higher store occupancy and central distribution costs. Moreover, the decline in merchandise margins is being triggered by inbound freight costs and a decline in product margins. Softness in gross margin remains a considerable threat to the bottom line in the second quarter. Apart from these, management is cautious about any adverse impacts stemming from additional tariffs.    Although such adversities are likely to impede the company's second-quarter results, we expect it to gain some respite from growth in e-commerce as well as increased efficiency in merchandising, branding and product designing capabilities.   What Does the Zacks Model Predict?    Our proven model doesn't show that Kirkland can beat bottom-line estimates in the to-be-reported quarter. For this to happen, a stock needs to have a positive Earnings ESP  and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold).    Although Kirkland's carries a Zacks Rank #3, its Earnings ESP of 0.00% makes us less confident about an earnings surprise. You can uncover the best stocks to buy or sell before they're reported with our  Earnings ESP Filter  .   Stocks Poised to Beat Estimates    Here are a few companies you may want to consider as our model shows that they have the right combination of elements to beat on earnings.    Burlington Stores BURL  has an Earnings ESP of +4.14% and a Zacks Rank #2. You can see   the complete list of today's Zacks #1 Rank stocks   here   .    Dollar General DG  has an Earnings ESP of +0.37% and a Zacks Rank #3.    Costco COST  has an Earnings ESP of +0.62% and a Zacks Rank #3.   Legalizing THIS Could Be Even Bigger than Marijuana    Americans spend an estimated $150 billion in this industry every year… more than twice as much as they spend on marijuana.    Now that 8 states have fully-legalized it (with several more states following close behind), Zacks has identified 5 stocks that could soar in response to the powerful demand. One industry insider described the future as \"mind-blowing\" - and early investors can still get in ahead of the surge.",
    "  See these 5 \"sin stocks\" now >>  ",
    "\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.\n"
  ],
  "published_datetime": "2019-09-03 09:21:00"
}